const t={map:'[{"css":["0.0","6.4","6.25"],"常用选择器":["0.1"],"通配选择器":["0.2"],"x":["0.3","0.4","0.5","0.6","0.7","0.8","0.9","0.10","0.11","0.12","0.13","0.14","0.15","0.16","0.17","0.18","0.19","0.20","0.21","0.22","0.23","0.24","0.25"],"css和js两种方式实现div右移1000px动画":["0.26"],"visibility":["0.27"],"回流和重绘":["0.28"],"单行截断和多行截断":["0.29"],"flex布局":["0.30"],"flex":["0.31"],"transition":["0.32"],"如何画一条":["0.33"],"说一下bfc":["0.34"],"css垂直居中的方案":["0.35"],"伪元素和伪类的区别":["0.36"],"position的几个属性和含义":["0.37"],"说一下盒模型":["0.38"],"响应式布局方案":["0.39"],"三栏式布局方案":["0.40"],"关于低版本的安卓系统下浏览器的异常表现":["0.41"],"http":["1.0","1.5","1.6","1.14","1.24"],"http报文结构":["1.1"],"get和post的区别":["1.2"],"为什么post请求会发送两次请求":["1.3"],"常见的http请求头和响应头":["1.4"],"content":["1.7"],"常见的http请求方法":["1.9"],"ajax基本写法":["1.10"],"ajax请求如何取消":["1.11"],"uri":["1.12"],"http状态码":["1.13"],"http的缺点":["1.15"],"accept字段":["1.16"],"http是如何传入定长和不定长的数据":["1.17"],"http如何处理大文件传输":["1.18"],"http中如何处理表单数据的提交":["1.19"],"http1":["1.20"],"cookie":["1.21"],"https为什么可靠":["1.22"],"tcp传输":["1.23"],"javascript":["2.0"],"map和set的区别":["2.1"],"数组的filter":["2.2"],"防抖":["2.3"],"节流":["2.4"],"深拷贝":["2.5"],"call":["2.6"],"apply":["2.7"],"promise":["2.8","2.9","2.10","2.11","2.12","2.13","2.14"],"验证promise":["2.15"],"es6有哪些新特性":["2.16"],"说一下对promise的了解":["2.17"],"promise的all和race有什么区别":["2.18"],"箭头函数和普通函数的区别":["2.19"],"let":["2.20"],"堆和栈的区别":["2.21"],"闭包的原理":["2.22"],"instanceof的实现原理":["2.23"],"new的实现原理":["2.24"],"数据类型有哪些":["2.25"],"jquery实现链式调用的原理是什么":["2.26"],"分别介绍一下原型":["2.27"],"js运行机制和事件循环":["2.28"],"nodejs的事件循环":["2.29"],"onload":["2.30"],"图像文件转换为base64":["2.31"],"formdata相关":["2.32"],"十六进制":["2.33"],"rgb":["2.34"],"rgba":["2.35"],"十六进制转rgb":["2.36"],"rgb转十六进制":["2.37"],"随机生成中文":["2.38"],"监听文件下载进度":["2.39"],"实现页面等比缩放适应所有屏幕":["2.40"],"性能较好的拖拽方案":["2.41"],"尾调用":["2.42"],"优化尾递归":["2.43"],"tostring":["2.44"],"深度优先遍历":["2.45"],"广度优先遍历":["2.46"],"typescript":["3.0"],"typescript相较于javascript有什么优势和劣势":["3.1"],"const":["3.2"],"接口和类型别名的区别":["3.3"],"泛型":["3.4"],"泛型约束":["3.5"],"泛型工具类型":["3.6"],"索引类型":["3.7"],"类型映射":["3.8"],"partial":["3.9"],"required":["3.10"],"readonly":["3.11"],"pick":["3.12"],"record":["3.13"],"returntype":["3.14"],"exclude":["3.15"],"extract":["3.16"],"omit":["3.17"],"nonnullable":["3.18"],"parameters":["3.19"],"tsconfig":["3.20"],"其他":["4.0"],"解决vscode终端不能运行yarn脚本":["4.1"],"删除node":["4.2"],"命令行打包":["4.3"],"patch":["4.4"],"修改服务器配置地址不重启项目的方法":["4.5"],"electron依赖安装缓慢":["4.6"],"electron由于地址证书问题导致打开白屏":["4.7"],"electron":["4.8","4.9","4.10","4.12"],"打包文件去除缓存":["4.11"],"关于接口延迟的测试方法":["4.13"],"如果出现一个接口超时":["4.14"],"网络问题":["4.15"],"接口串行问题":["4.16"],"发现这个问题的场景":["4.17"],"打包出zip":["4.18"],"关于压缩的问题":["4.19"],"安装依赖的时候提示淘宝镜像证书过期的问题":["4.20"],"vscode图片预览":["4.21"],"小程序":["5.0"],"小程序架构":["5.1"],"小程序和h5的区别":["5.2"],"小程序在安卓和ios区别":["5.3"],"为什么要用taro":["5.4"],"框架相关":["6.0"],"react":["6.1"],"vue和":["6.2","6.3"],"说一下虚拟dom":["6.5"],"虚拟dom是如何合并patch的":["6.6"],"map":["6.7"],"组件通信的方式有哪些":["6.8"],"watch能监听computed的属性吗":["6.9"],"vue的响应式原理":["6.10"],"mounted拿到数据可以后可以直接获取dom吗":["6.11"],"nexttick原理":["6.12"],"vue模板":["6.13"],"vuex为什么同时设计mutation和action":["6.14"],"vue2和":["6.15"],"vue挂载和卸载父子组件生命周期钩子执行顺序":["6.16"],"vue的优化方案":["6.17"],"keep":["6.18"],"setstate是同步还是异步的":["6.19"],"fiber的实现原理":["6.20"],"为什么webpack打包慢":["6.21"],"说说webpack编译打包的流程":["6.22"],"说一下对tree":["6.23"],"webpack中plugin和laoder的区别":["6.24"],"动态路由找不到模块":["6.26"],"错误":["6.27"],"事件总线需要注意的问题":["6.28"],"a":["6.29","6.34","6.37","6.38","6.39","6.40"],"页面存在多个表单冲突的解决方案":["6.30"],"修改keepalive的缓存策略":["6.31"],"避免input读取历史记录":["6.32"],"textarea输入不自动撑开的原因之一":["6.33"],"ant":["6.35"],"ant固定列高度问题":["6.36"],"表格调整高度":["6.41"],"关于jsx修改框架样式":["6.42"],"立体柱状图":["6.43"],"关于el":["6.44"],"关于可视化mapgl":["6.45"],"关于bmapgl的图标标记出现异常图标的问题":["6.46"],"关于bmapgl的地图瓦片问题":["6.47"],"关于性能问题":["6.48"],"浏览器":["7.0"],"介绍一下eventloop":["7.1"],"eventloop中为什么要同时存在宏任务和微任务两个队列":["7.2"],"script标签为什么要放在底部":["7.3"],"defer和async的区别":["7.4"],"如何设计css":["7.5"],"内存泄漏":["7.6"],"settimeout为什么会造成内存泄露":["7.7"],"介绍一下http缓存":["7.8"],"哪些字段用做强缓存":["7.9"],"用户行为对缓存的影响":["7.10"],"宏任务和微任务的区别":["7.11"],"为什么和定时器有关的任务是宏任务":["7.12"],"事件为什么是宏任务呢":["7.13"],"js本身语法内的":["7.14"],"非js本身的":["7.15"],"那么像observer":["7.16"],"浏览器页面加载过程":["7.17"],"sessionsorage":["7.18"],"浏览器线程":["7.19"],"关于渲染时部分样式丢失的问题":["7.20"],"关于一个mousemove加条件判断的怪异卡顿问题":["7.21"],"算法":["8.0"],"快排":["8.1"],"规范":["9.0"],"缩进":["9.1"],"js相关":["9.2"],"三元不等式":["9.3"],"匿名函数":["9.4"],"关于变量的风格":["9.5"],"if判断":["9.6"],"vue相关":["9.7"],"template":["9.8"],"import":["9.9"],"name":["9.10"],"components":["9.11"],"props":["9.12"],"data":["9.13"],"模板推荐的写法":["9.14"],"关于事件总线规范":["9.15"],"代码规范":["9.16"],"背景":["9.17"],"阶段":["9.18"],"过渡阶段注意事项":["9.19"],"安装插件及其配置":["9.20"],"编辑器webstorm配置":["9.21"],"编辑器vscode配置":["9.22"]},{"0":["0.26","0.33","1.18","1.24","4.10","6.43","7.9"],"1":["0.29","0.31","0.33","0.35","0.39","0.40","0.41","1.1","1.3","1.7","1.11","1.14","1.22","1.24","2.31","2.41","2.43","3.1","3.3","3.6","4.1","4.4","4.10","4.12","4.20","4.21","6.11","6.22","6.31","6.34","6.43","7.1","7.14","9.3","9.8","9.9","9.11","9.12","9.13","9.14","9.15","9.17","9.18","9.19","9.20","9.21","9.22"],"2":["1.11","1.22","1.24","6.31","6.34","7.19","9.3","9.8","9.20","9.21","9.22"],"3":["6.31","6.34","9.20","9.22"],"4":["6.43"],"5":["6.43","9.20"],"15":["6.34"],"16":["2.44"],"22":["6.43"],"27":["6.43"],"30":["3.6"],"59":["6.43"],"65":["6.43"],"76":["6.43"],"91":["6.43"],"101":["1.13"],"106":["6.43"],"126":["6.43"],"131":["6.43"],"133":["6.43"],"168":["6.43"],"179":["6.43"],"182":["6.43"],"199":["6.43"],"200":["1.13"],"234":["6.43"],"236":["6.43"],"255":["6.43"],"499":["1.18"],"500":["1.18"],"星号可以用来定义页面的所有元素":["0.2"],"许多开发者会使用这个技巧来把":["0.2"],"margin":["0.2"],"id选择器":["0.3"],"类选择器":["0.4"],"这是":["0.4"],"y":["0.5","0.8","0.9","0.10","1.18","3.3"],"元素选择器":["0.6"],"visited":["0.7"],"title":["0.11"],"属性选择器":["0.11"],"href":["0.11"],"foo":["0.11"],"指向具体":["0.11"],"checked":["0.12"],"after":["0.13"],"伪类选择器":["0.13"],"伪类":["0.13"],"before":["0.13"],"和":["0.13","1.24","2.30","6.7"],"hover":["0.14"],"not":["0.15"],"selector":["0.15"],"pseudoelement":["0.16"],"伪元素选择器":["0.16"],"伪元素":["0.16"],"用":["0.16"],"表示":["0.16"],"nth":["0.17","0.18","0.19","0.20"],"child":["0.17"],"n":["0.17"],"first":["0.21","0.25"],"last":["0.22"],"only":["0.23","0.24"],"css":["0.26","6.42","7.19"],"test":["0.26","6.34"],"width":["0.26","0.29","2.40"],"50px":["0.26"],"height":["0.26"],"box":["0.26","0.30"],"shadow":["0.26"],"5px":["0.26","0.33"],"rgba":["0.26"],"display":["0.27","0.29"],"opacity的区别":["0.27"],"项目":["0.27","0.28"],"回流一定会触发重绘":["0.28"],"而重绘不一定会回流":["0.28"],"单行":["0.29"],"span":["0.29"],"line":["0.29"],"block":["0.29","0.34"],"150px":["0.29"],"overflow":["0.29"],"hidden":["0.29"],"text":["0.29"],"ellipsis":["0.29"],"white":["0.29"],"space":["0.29"],"nowrap":["0.29"],"多行":["0.29"],"必须在webkit内核浏览器使用":["0.29"],"而且不支持自定义点击展开的样式":["0.29"],"flexible":["0.30"],"弹性布局":["0.30"],"webkit内核的浏览器需要加":["0.30"],"webkit":["0.30"],"设置属性后":["0.30"],"float":["0.30"],"clear":["0.30","6.34"],"vertival":["0.30"],"align":["0.30"],"均失效":["0.30"],"有两个主轴":["0.30"],"main":["0.30"],"axis":["0.30"],"cross":["0.30"],"两个主轴空间":["0.30"],"transform":["0.32"],"translate的区别":["0.32"],"的边框":["0.33"],"直接定义0":["0.33"],"tip":["0.34","2.22","2.24","2.42","3.8","3.9","4.4","7.19","9.0"],"formatting":["0.34"],"项":["0.36","0.37","1.2","5.2","5.3","6.1","6.2","6.3","6.8","6.16","6.24","7.4","7.9"],"static":["0.37"],"absolute":["0.37"],"盒模型":["0.38"],"css3动画会引起页面的canvas闪屏":["0.41"],"可以考虑切换svg以获得更优的性能":["0.41"],"请求报文":["1.1"],"起始行":["1.1"],"get":["1.1","1.2","1.9","6.34"],"home":["1.1"],"http":["1.1"],"post":["1.2","1.9"],"第一次请求为":["1.3"],"request":["1.5"],"header":["1.5","1.6","6.40"],"accept":["1.5","1.16"],"responses":["1.6"],"type":["1.7","1.16","3.3","3.6","3.10","6.34"],"常见的":["1.7"],"属性值有以下四种":["1.7"],"application":["1.7","1.19"],"304多一点好还是少一点":["1.8"],"为什么会有304":["1.8"],"服务器为了提高网站访问速度":["1.8"],"向服务器获取数据":["1.9"],"发送数据给服务器":["1.9"],"通常会造成服务器资源的新增修改":["1.9"],"js":["1.10","2.3","2.4","2.5","2.6","2.7","2.8","2.9","2.11","2.12","2.13","2.14","2.15","2.31","2.38","2.39","2.40","2.43","2.44","2.45","2.46","3.3","3.4","3.5","3.6","3.7","3.8","3.10","3.11","3.14","3.20","4.3","4.5","4.7","4.8","4.10","4.11","4.12","4.17","4.18","6.34","6.35","6.36","6.37","6.39","6.40","6.41","6.42","6.43","9.3","9.4","9.5","9.6"],"let":["1.10","2.8","2.36"],"xhr":["1.10","1.11"],"new":["1.10","1.11","2.24","2.31","4.11"],"xmlhttprequest":["1.10","1.11"],"原生xhr取消请求":["1.11"],"ini":["1.11"],"var":["1.11","2.31","4.12","8.1"],"abort":["1.11"],"axios取消请求":["1.11"],"使用":["1.11","4.4"],"canceltoken":["1.11"],"source":["1.11"],"统一资源标识符":["1.12"],"scheme":["1.12"],"user":["1.12"],"1xx":["1.13"],"表示目前是协议处理的中间状态":["1.13"],"还需要后续操作":["1.13"],"br":["1.13","6.2"],"switching":["1.13"],"protocols":["1.13"],"在http升级为websocket的时候":["1.13"],"如果服务器同意变更":["1.13"],"就会发送101":["1.13"],"2xx":["1.13"],"表示成功":["1.13"],"ok是最常见的状态码":["1.13"],"通常在响应体中放有数据":["1.13"],"的特点":["1.14"],"灵活可扩展":["1.14"],"无状态":["1.15"],"需要长连接的场景中":["1.15"],"数据格式":["1.16"],"mime":["1.16"],"发送端":["1.16"],"content":["1.16"],"接收端":["1.16"],"定长包":["1.17"],"发送端会在带上content":["1.17"],"范围请求":["1.18"],"响应头需要增加accrpt":["1.18"],"ranges":["1.18"],"none通知客户端支持范围请求":["1.18"],"客户端":["1.18","1.23"],"range请求头字段确定":["1.18"],"格式为bytes":["1.18"],"x":["1.18","3.3","3.6"],"位开始到第499个字节":["1.18"],"表示第500到终点":["1.18"],"有两种主要的表单提交方式":["1.19"],"1如何解决http的对头阻塞问题":["1.20"],"请求头":["1.21"],"http是明文通讯":["1.22"],"而https是加密通讯":["1.22"],"过程":["1.23","6.16"],"服务端":["1.23"],"的区别":["1.24","6.2"],"二进制协议":["1.24"],"是一个二进制协议":["1.24"],"在":["1.24"],"map和object的区别":["2.1"],"set":["2.1"],"类似数组":["2.1"],"但成员唯一":["2.1"],"可用于数组":["2.1"],"字符串去重":["2.1"],"不会发生类型转换":["2.1"],"使用的算法叫same":["2.1"],"value":["2.1"],"zero":["2.1"],"equality类似":["2.1"],"但是区别在于set认为nan":["2.1"],"nan":["2.1"],"对象总是不相等":["2.1"],"size":["2.1","6.34"],"every":["2.2"],"触发最后一次":["2.3"],"function":["2.3","2.4","2.5","2.6","2.7","2.13","2.14","2.33","2.34","2.35","2.36","2.37","2.39","2.40","2.43","2.44","2.46","3.4","3.5","3.6","3.7","6.31","6.34","8.1"],"debounce":["2.3"],"fn":["2.3"],"触发第一次":["2.4"],"clonetype":["2.5"],"target":["2.5","3.20"],"return":["2.5","3.6","6.31","6.34"],"object":["2.5","6.10","6.31","6.34"],"prototype":["2.5","2.6","2.7","6.31"],"mycall":["2.6"],"myapply":["2.7"],"context":["2.7"],"if":["2.7","2.36","2.37","6.17","6.31","9.6"],"null":["2.7","2.25","4.12","6.34"],"class":["2.8"],"constructor":["2.8"],"runpromise":["2.8"],"this":["2.8","2.39","6.34"],"state":["2.8"],"pending":["2.8"],"successval":["2.8"],"failreason":["2.8"],"onresolvedcallbacks":["2.8"],"onrejectedcallbacks":["2.8"],"resolve":["2.8","2.9"],"val":["2.8","6.34"],"fulfilled":["2.8"],"foreach":["2.8"],"reject":["2.10"],"all":["2.11","2.18"],"race":["2.12"],"allsettled":["2.13"],"promisearr":["2.13"],"any":["2.14"],"promises":["2.15"],"aplus":["2.15"],"块级作用域":["2.16"],"有三个状态":["2.17"],"写法简洁":["2.19"],"var和const的区别":["2.20"],"如果希望const定义的对象的属性也不能被修改该怎么做":["2.20"],"栈":["2.21"],"stack":["2.21"],"自动释放":["2.21"],"闭包":["2.22"],"闭包是函数创建时创建的":["2.22"],"用于检测构造函数的":["2.23"],"创建一个空对象obj":["2.24"],"将obj的原型链上的":["2.24"],"proto":["2.24"],"指向构造函数的原型prototype":["2.24"],"如何判断一个数据是否是数组":["2.25"],"number":["2.25","3.3","3.6","6.34"],"string":["2.25","3.6","6.34"],"boolean":["2.25","6.34"],"undefined":["2.25","6.34"],"返回jq对象":["2.26"],"原型链":["2.27"],"作用域和作用域链的含义和使用场景":["2.27"],"js其重要用途是用于交互":["2.28"],"为了避免出现矛盾的交互情况":["2.28"],"所以其只能是单线程语言":["2.28"],"web":["2.28"],"worker允许js脚本创建线程":["2.28"],"process":["2.29"],"上传图片":["2.31"],"imagetobase64":["2.31"],"file":["2.31"],"reader":["2.31"],"filereader":["2.31"],"readasdataurl":["2.31"],"warning":["2.32","6.26"],"javascript":["2.33","2.34","2.35","2.36","2.37","7.19"],"randomcolor":["2.34","2.35"],"const":["2.35","2.38","2.39","3.6","4.11","4.12","4.18","6.31","6.36","6.40","6.41","6.43","9.5"],"hextorgb":["2.36"],"hex":["2.36"],"rgb":["2.36","2.37","6.43"],"rgbtohex":["2.37"],"rgb2hex":["2.37"],"createrandomchinese":["2.38"],"count":["2.38"],"start":["2.38"],"parseint":["2.38"],"async":["2.39"],"downloadfile":["2.39"],"fileurl":["2.39"],"filename":["2.39"],"未命名的文件":["2.39"],"blob":["2.39"],"await":["2.39","7.14"],"getblob":["2.39"],"downloadfilebyblog":["2.39"],"resize":["2.40"],"document":["2.40"],"body":["2.40"],"style":["2.40"],"mousedown":["2.41"],"蹦床函数":["2.43"],"trampoline":["2.43"],"f":["2.43"],"while":["2.43"],"instanceof":["2.43"],"恢复":["2.44"],"hex2int":["2.44"],"一":["2.44"],"dfs":["2.45"],"bfs":["2.46"],"优势":["3.1"],"func":["3.2","3.6"],"a":["3.2"],"语法不同":["3.3"],"interface":["3.3","3.6","3.8"],"point":["3.3"],"numbe":["3.3"],"setpoint":["3.3"],"void":["3.3"],"t":["3.4","3.5","3.7","3.9","3.16","3.17","3.18","3.19","6.34"],"是一个抽象类型":["3.4"],"只有在调用的时候才确定它的值":["3.4"],"identity":["3.4"],"若参数的类型不是简单的类型":["3.5"],"则需要对泛型进行约束":["3.5"],"例如":["3.5"],"trace":["3.5"],"arg":["3.5"],"typeof":["3.6"],"的主要用途是在类型上下文中获取变量或者属性的类型":["3.6"],"person":["3.6"],"name":["3.6","4.10","6.34"],"age":["3.6"],"sem":["3.6"],"semlinker":["3.6"],"此外":["3.6"],"操作符除了可以获取对象的结构类型之外":["3.6"],"它也可以用来获取函数对象的类型":["3.6"],"toarray":["3.6"],"array":["3.6"],"getvalues":["3.7"],"k":["3.7","3.13","3.17"],"extends":["3.7","3.13"],"keyof":["3.7"],"概念":["3.8","3.9"],"根据旧的类型创建出新的类型":["3.8"],"我们称之为映射类型":["3.8"],"testinterface":["3.8"],"将类型的属性变成可选":["3.9"],"required将类型的属性变成必选":["3.10"],"从某个类型中挑出一些属性出来":["3.12"],"用来得到一个函数的返回值类型":["3.14"],"json":["3.20"],"重要字段":["3.20"],"files":["3.20"],"设置要编译的文件的名称":["3.20"],"include":["3.20"],"设置需要进行编译的文件":["3.20"],"支持路径模式匹配":["3.20"],"exclude":["3.20"],"设置无需进行编译的文件":["3.20"],"compileroptions":["3.20"],"设置与编译流程相关的选项":["3.20"],"其中compileroptions":["3.20"],"基本选项":["3.20"],"es5":["3.20"],"指定":["3.20"],"ecmascript":["3.20"],"目标版本":["3.20"],"es3":["3.20"],"default":["3.20","6.34"],"es6":["3.20"],"es2015":["3.20"],"vscode的终端执行":["4.1"],"modules":["4.2"],"e":["4.3","6.34"],"cd":["4.3"],"hbuilderx":["4.3"],"package使用":["4.4"],"在项目根目录创建env":["4.5"],"module":["4.5","6.42"],"exports":["4.5","6.42"],"npm":["4.6","9.20"],"config":["4.6","6.22"],"forge存在的打包问题":["4.8"],"id":["4.8"],"is":["4.8"],"required":["4.8","6.34"],"makers":["4.8"],"packager":["4.9"],"打包直接生成绿色包":["4.9"],"无需安装":["4.9"],"无法打包成安装包":["4.9"],"builder":["4.10"],"优点":["4.10"],"可打包成安装包":["4.10"],"无缓存":["4.10"],"有免安装":["4.10"],"快速":["4.10"],"缺点":["4.10"],"会将项目下的所有内容都打包":["4.10"],"尽可能保持项目的干净":["4.10"],"以保持安装包体积":["4.10"],"my":["4.10"],"version":["4.10"],"timestamp":["4.11"],"update":["4.12"],"electron自动更新":["4.12"],"在根目录新建updater":["4.12"],"autoupdater":["4.12"],"require":["4.12"],"updater":["4.12"],"mainwin":["4.12"],"checkupdate":["4.12"],"win":["4.12"],"ipcmain":["4.12"],"如果仅仅只是网络延迟":["4.15"],"该接口在后台等待了别的接口处理":["4.16"],"在写路由鉴权时":["4.17"],"没有把用户权限都请求回来":["4.17"],"是不能放行的":["4.17"],"router":["4.17","6.1","6.34"],"beforeeach":["4.17"],"to":["4.17"],"from":["4.17","6.34"],"next":["4.17"],"nprogress":["4.17"],"zipplugin":["4.18"],"node":["4.19"],"env不是production的话很多node":["4.19"],"modules里的包不会压缩":["4.19"],"使用gzip":["4.19"],"nginx":["4.19"],"切换好镜像":["4.20"],"双线程模型":["5.1"],"h5":["5.2"],"小程序":["5.2"],"taro是如何实现跨端的":["5.4"],"vue":["6.1","6.2","6.34","6.40","6.41"],"router原理":["6.1"],"hash模式":["6.1"],"history模式":["6.1"],"标记":["6.1"],"带有":["6.1"],"无":["6.1"],"react":["6.2","6.3"],"问世":["6.2"],"14年2月":["6.2"],"13年5月":["6.2"],"数据绑定":["6.2"],"vue是实现了双向数据绑定的mvvm框架":["6.2"],"当视图改变更新模型层":["6.2"],"当模型层改变更新视图层":["6.2"],"在vue中":["6.2"],"使用了双向绑定技术":["6.2"],"就是view的变化能实时让model发生变化":["6.2"],"而model的变化也能实时更新到view":["6.2"],"vue采用数据劫持":["6.2"],"发布":["6.2"],"订阅模式的方式":["6.2"],"如何做技术选型":["6.3"],"module原理":["6.4"],"为什么要使用虚拟dom":["6.5"],"防抖":["6.6"],"父子通讯":["6.8"],"兄弟通讯":["6.8"],"跨级通讯":["6.8"],"用法":["6.8"],"props":["6.8","6.34"],"emit":["6.8"],"能":["6.9"],"置于任务队列的最后":["6.12"],"template":["6.13","6.39"],"只设计一个行不行":["6.14"],"vue3":["6.15"],"渲染过程":["6.16"],"等同于如何编写可读性高":["6.17"],"易维护且高性能的vue代码":["6.17"],"v":["6.17","6.31"],"show":["6.17","6.34"],"if为真正的条件渲染":["6.17"],"确保切换过程中条件块内的事件监听器和子组件适当的被销毁和重建":["6.17"],"也是惰性的":["6.17"],"如果初始渲染时条件为假":["6.17"],"则什么也不做直至条件变为真时":["6.17"],"alive的原理":["6.18"],"使用有什么问题":["6.18"],"如何解决":["6.18"],"抽象组件":["6.18"],"本身不会渲染一个dom元素":["6.18"],"也不会出现在父组件链中":["6.18"],"进入了react的调度流程就是异步":["6.19"],"window":["6.20"],"为什么vite会比webpack快":["6.21"],"如果想提高webpack速度":["6.21"],"应该怎么做":["6.21"],"主要在":["6.21"],"编译js":["6.21"],"读取命令行传入的配置以及项目中的":["6.22"],"webpack":["6.22"],"shaking的了解":["6.23"],"对commonjs和esm都可以用tree":["6.23"],"它们的执行时机":["6.24"],"以及常用的plugin和loader":["6.24"],"loader的作用是什么":["6.25"],"import":["6.26","6.34"],"中的表达式":["6.26"],"不能使用完全动态的":["6.26"],"critical":["6.27"],"mountred开启监听":["6.28"],"input只读属性无效":["6.29"],"原理":["6.30"],"创建多个表单时":["6.30"],"base":["6.31"],"keep":["6.31"],"alive":["6.31"],"主要解决问题场景":["6.31"],"多级路由缓存":["6.31"],"前提":["6.31"],"保证动态路由生成的route":["6.31"],"fullpath":["6.31"],"值都声明了且唯一":["6.31"],"基于以上对keep":["6.31"],"alive进行以下改造":["6.31"],"组件名称获取更改为路由fullpath":["6.31"],"cache缓存key也更改为路由fullpath":["6.31"],"prunecache":["6.31"],"tostring":["6.31"],"isregexp":["6.31"],"call":["6.31"],"regexp":["6.31"],"export":["6.31","6.34"],"remove":["6.31"],"arr":["6.31","8.1"],"item":["6.31"],"length":["6.31","8.1"],"index":["6.31"],"indexof":["6.31"],"splice":["6.31"],"autocomplete":["6.32"],"使用了栅格":["6.33"],"table增加列拖拽排序":["6.34"],"列拖拽调整列宽":["6.34"],"ant":["6.34","6.40"],"design":["6.34"],"es":["6.34"],"table":["6.34"],"lodash":["6.34"],"data":["6.34"],"needtotallist":["6.34"],"selectedrows":["6.34"],"selectedrowkeys":["6.34"],"localloading":["6.34"],"false":["6.34"],"localdatasource":["6.34"],"localpagination":["6.34"],"assign":["6.34"],"pagination":["6.34"],"存储表格onchange时的filters":["6.34"],"sorter对象":["6.34"],"filters":["6.34"],"sorter":["6.34"],"dropblock":["6.34"],"coordinateofdrop":["6.34"],"exchangecolname":["6.34"],"timeclock":["6.34"],"rowkey":["6.34"],"key":["6.34"],"true":["6.34","6.39"],"allowdropwidth":["6.34"],"allowdropcol":["6.34"],"pagenum":["6.34"],"pagesize":["6.34"],"showsizechanger":["6.34"],"alert":["6.34"],"rowselection":["6.34"],"deprecated":["6.34"],"showalertinfo":["6.34"],"showpagination":["6.34"],"auto":["6.34"],"enable":["6.34"],"page":["6.34"],"uri":["6.34"],"mode":["6.34"],"g":["6.34"],"users":["6.34"],"queryparam":["6.34"],"pageuri":["6.34"],"watch":["6.34"],"current":["6.34"],"push":["6.34"],"route":["6.34"],"params":["6.34"],"pageno":["6.34"],"change":["6.34"],"reset":["6.34"],"total":["6.34"],"inittotallist":["6.34"],"columns":["6.34"],"展开列后":["6.35"],"固定列错位问题":["6.35"],"expand":["6.35"],"expanded":["6.35"],"autofixheight":["6.36"],"el":["6.36","6.40","6.41"],"binding":["6.36","6.40","6.41"],"vnode":["6.36","6.40","6.41"],"oldvnode":["6.36","6.40","6.41"],"table中fixed与ellipsis无法共存的问题":["6.37"],"select搜索问题":["6.38"],"modal内嵌a":["6.39"],"modal引发的问题":["6.39"],"按钮增加key可解决":["6.39"],"div":["6.39"],"button":["6.39"],"click":["6.39"],"visible":["6.39"],"测试":["6.39"],"modal拖拽":["6.40"],"drag":["6.40"],"nexttick":["6.40"],"isthememodal":["6.40"],"classlist":["6.40"],"contains":["6.40"],"grid":["6.40"],"theme":["6.40"],"dialogheaderel":["6.40"],"queryselector":["6.40"],"tabs":["6.40"],"bar":["6.40"],"modal":["6.40"],"dragdom":["6.40"],"adjusttablescrollxy":["6.41"],"jsx":["6.42"],"deep":["6.42"],"一般做法":["6.42"],"colorarr":["6.43"],"offset":["6.43"],"color":["6.43"],"image失败时更换请求地址的操作":["6.44"],"能不使用它最好不要使用":["6.45"],"这里建立图标的时候需要设立图标的宽高":["6.46"],"经过测试基本上是失败":["6.47"],"经过测试基本上和显卡挂钩":["6.48"],"网络":["7.0"],"所有同步任务在主线程执行":["7.1"],"设计一个行不行":["7.2"],"避免脚本阻塞":["7.3"],"以及它们的加载和执行时机":["7.4"],"js等文件的缓存":["7.5"],"定义":["7.6","7.9"],"如何防止settimeout内存泄露":["7.7"],"为了提升页面的访问速度":["7.8"],"哪些字段用做协商缓存":["7.9"],"强缓存":["7.9"],"协商缓存":["7.9"],"本地缓存":["7.9"],"只浏览器不发出请求":["7.9"],"直接从缓存中获取":["7.9"],"当校验发现不能使用强缓存":["7.9"],"expires":["7.9"],"http1":["7.9"],"用户操作":["7.10"],"进程的切换肯定是宏任务":["7.11"],"因为":["7.12"],"事件的触发是依赖于":["7.13"],"比如async":["7.14"],"如mutationobserver等":["7.16"],"和一些渲染为什么都是微任务呢":["7.16"],"浏览器进程进程":["7.17"],"作用":["7.17"],"浏览器进程":["7.17"],"管理标签页的创建销毁以及页面的显示":["7.17"],"资源下载":["7.17"],"第三方插件进程":["7.17"],"管理第三方插件":["7.17"],"gpu进程":["7.17"],"3d绘制与硬件加速":["7.17"],"localstorage":["7.18"],"cookie的区别":["7.18"],"同一个系统开两个网页":["7.18"],"两个网页的sessionstorage共享吗":["7.18"],"浏览器的2个重要的执行线程":["7.19"],"这":["7.19"],"个线程协同工作来渲染一个网页":["7.19"],"主线程和合成线程":["7.19"],"主线程":["7.19"],"运行":["7.19"],"计算":["7.19"],"html":["7.19","7.21"],"元素的":["7.19"],"样式":["7.19"],"页面的布局":["7.19"],"将元素绘制到一个或多个位图中":["7.19"],"将这些位图交给合成线程":["7.19"],"可用定时器让任务重复排进队列":["7.20"],"mousemove":["7.21"],"鼠标在上方移动时":["7.21"],"第一个区域会存在卡顿的问题":["7.21"],"但如果打开开发者控制台":["7.21"],"则卡顿问题会消失":["7.21"],"目前不知道如何解释这种情况":["7.21"],"个人理解是否是因为第一个的if条件相当于个防抖":["7.21"],"html例子":["7.21"],"doctype":["7.21"],"quicksort":["8.1"],"len":["8.1"],"如果公司有自定义的规则":["9.1"],"aaa":["9.3","9.6"],"一般不超过编辑器的2":["9.5"],"3的":["9.5"],"均不推荐换行":["9.5"],"result":["9.5"],"判断路径下的代码逻辑只有一句的情况下":["9.6"],"可不用写":["9.6"],"必须严格要求缩进":["9.8"],"一个组件元素只要长度不超过编辑器的2":["9.8"],"没有用到的变量":["9.9"],"必须手动删除":["9.9"],"不要留在代码上":["9.9"],"必须为组件生命一个独立的name":["9.10"],"在每一个属性不长时":["9.12"],"推荐不换行":["9.12"],"常用":["9.14"],"created":["9.14"],"可在created":["9.15"],"偷":["9.16"],"初始阶段":["9.18"],"安装prettier插件":["9.20"],"install":["9.20"],"save":["9.20"],"dev":["9.20"],"prettier":["9.20","9.22"],"完成":["9.21","9.22"],"安装插件及其配置":["9.21","9.22"],"进入":["9.21"],"设置":["9.21"],"setting":["9.21","9.22"],"安装vscode":["9.22"],"插件":["9.22"],"进入设置页配置":["9.22"]},{"0":["0.27","2.11","2.14","2.36","2.43","6.31","6.40"],"1":["1.18","1.20","1.23","2.5","2.37","4.2","6.5","7.9","7.16","7.17","8.1","9.6"],"2":["0.33","0.39","0.41","2.37","2.41","3.1","3.3","3.6","4.20","7.1","7.17","9.9","9.12","9.17","9.18"],"3":["2.36","2.37","9.8","9.21"],"5":["0.33"],"6":["0.26"],"8":["2.5","7.21"],"16":["2.38"],"42":["6.43"],"44":["6.43"],"58":["6.43"],"64":["4.10"],"74":["6.43"],"80":["6.43"],"85":["6.43"],"100":["0.26","1.18"],"102":["6.43"],"107":["6.43"],"115":["6.43"],"148":["6.43"],"150":["9.20"],"152":["6.43"],"187":["6.43"],"197":["6.43"],"204":["1.13"],"206":["1.13"],"247":["6.43"],"1000":["2.3"],"和":["0.2","3.6","7.19"],"padding":["0.2"],"都设为0":["0.2"],"使用":["0.3","6.18","7.19"],"class":["0.4","0.29"],"后代选择器":["0.5"],"如果你的选择器看起来像":["0.5"],"假如你想定义页面里所有":["0.6"],"type":["0.6","3.9","3.11","3.12","3.14","3.19","4.3"],"link":["0.7"],"邻近选择器":["0.8"],"直接后代选择器":["0.9"],"兄弟选择器":["0.10"],"nettuts":["0.11"],"正则匹配":["0.11"],"http":["0.11","1.18","4.5","7.9","7.21"],"正则匹配前缀":["0.11"],"jpg":["0.11"],"正则匹配结尾":["0.11"],"选中选择器":["0.12"],"属于高级用法":["0.13"],"几乎每一天都有人找到高效而有创意的新用法":["0.13"],"这两个伪类可以在元素前面和后面添加内容":["0.13"],"许多人认识到这两个伪类是因为这是清除浮动的技巧":["0.13"],"css":["0.13","0.29","1.16"],"clearfix":["0.13"],"交互选择器":["0.14"],"否定伪类选择器":["0.15"],"比如":["0.15"],"我希望选中所有的div元素":["0.15"],"来定义某些片段元素":["0.16"],"要记住的是这只能用于块状":["0.16"],"block":["0.16"],"元素":["0.16"],"下面匹配段落的第一个字母":["0.16"],"队列选择器":["0.17"],"队列元素选择器":["0.17"],"要注意的是":["0.17"],"last":["0.18","0.20"],"of":["0.19","0.24","0.25"],"child":["0.21","0.22","0.23"],"animation":["0.26"],"1s":["0.26"],"move":["0.26","6.40"],"forwards":["0.26"],"keyframes":["0.26"],"margin":["0.26","6.39"],"left":["0.26","6.40"],"1000px":["0.26"],"none":["0.27"],"opacity":["0.27"],"回流":["0.28"],"重绘":["0.28"],"添加":["0.28","9.20"],"html":["0.29","1.16"],"p":["0.29","3.9","3.10"],"content":["0.29","1.13"],"测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试":["0.29"],"400px":["0.29"],"webkit":["0.29"],"box":["0.29"],"size":["0.30","3.5"],"两个开始位置":["0.30"],"start":["0.30","4.17"],"两个结束位置":["0.30"],"end":["0.30","2.38"],"父容器":["0.30"],"flex":["0.30"],"direction":["0.30"],"决定主轴方向":["0.30"],"row":["0.30","6.36"],"放大一倍":["0.31"],"过渡":["0.32"],"缩放":["0.33"],"scaley":["0.33"],"contexts":["0.34"],"块级格式化上下文":["0.34"],"容器内的元素不会影响容器外的元素":["0.34"],"绝对定位":["0.35"],"margin负值":["0.35"],"伪元素":["0.36"],"relative":["0.37"],"fixed":["0.37"],"inherit":["0.37"],"border":["0.38"],"媒体查询":["0.39"],"纯浮动":["0.40"],"css3动画掉帧的问题":["0.41"],"尽量使用transform来做动画":["0.41"],"方法":["1.1"],"路径":["1.1"],"http版本":["1.1"],"最后接一个换行":["1.1"],"头部":["1.1"],"缓存":["1.2"],"浏览器主动缓存":["1.2"],"无缓存":["1.2"],"编码":["1.2","1.24"],"options":["1.3","6.31"],"预检请求":["1.3"],"浏览器能够处理的内容类型":["1.5"],"charset":["1.5","7.21"],"date":["1.6","4.11"],"表示消息发送的时间":["1.6"],"x":["1.7","1.19","2.43"],"www":["1.7","1.10","1.19"],"form":["1.7","1.19"],"urlencoded":["1.7"],"浏览器的原生":["1.7"],"表单":["1.7"],"对之前访问的部分页面指定缓存机制":["1.8"],"当客户端在此对这些页面进行请求":["1.8"],"服务器会根据缓存内容判断页面与之前是否相同":["1.8"],"若相同便直接返回304":["1.8"],"put":["1.9"],"用于全量修改目标资源":["1.9"],"看接口":["1.9"],"也可以用于添加":["1.9"],"patch":["1.9"],"open":["1.10","2.39"],"get":["1.10","1.11","2.39","4.1"],"https":["1.10"],"baidu":["1.10"],"com":["1.10"],"工厂方法创建":["1.11"],"cancel":["1.11"],"token":["1.11"],"php":["1.11"],"const":["1.11","2.33","2.34","2.40","2.44","2.46","6.34","6.35"],"axios":["1.11"],"user":["1.11"],"passwd":["1.12"],"host":["1.12"],"portpath":["1.12"],"not":["1.13"],"但响应头后没有body数据":["1.13"],"partial":["1.13"],"表示部分内容":["1.13"],"使用场景为http分块下载和断点续传":["1.13"],"会带上相应的相应头字段content":["1.13"],"range":["1.13","1.18"],"3xx":["1.13"],"重定向":["1.13","6.1"],"资源位置发生变动":["1.13"],"需要重新请求":["1.13"],"语义上的自由":["1.14"],"只规定了基本格式":["1.14"],"没有严格的语法限制":["1.14"],"需要保存大量的上下文信息":["1.15"],"以免传输大量重复的信息":["1.15"],"类型":["1.16"],"值":["1.16"],"text":["1.16"],"plain":["1.16"],"length":["1.17","2.44"],"短于返回值":["1.17"],"会被截去":["1.17"],"表示最后100个":["1.18"],"服务器":["1.18"],"收到请求后":["1.18"],"验证范围":["1.18"],"如果越界返回416":["1.18"],"否则206":["1.18"],"同时添加content":["1.18"],"请求单段数据和请求多段数据响应头是不一样的":["1.18"],"单段数据":["1.18"],"js":["1.18","2.10","2.28","3.9","3.12","3.19","4.9","6.22","6.38"],"a":["1.21","2.35","2.44"],"xxx":["1.21"],"b":["1.21","2.34","2.35","3.2"],"ca证书":["1.22"],"密钥传输过程":["1.22"],"客户端":["1.22"],"过程":["1.22"],"服务端":["1.22"],"标记位syn":["1.23"],"同步序列编号":["1.23"],"seq":["1.23"],"版中":["1.24"],"报文的头信息必须是文本":["1.24"],"ascii":["1.24"],"数据体可以是文本":["1.24"],"也可以是二进制":["1.24"],"则是一个彻底的二进制协议":["1.24"],"头信息和数据体都是二进制":["1.24"],"并且统称为":["1.24"],"帧":["1.24"],"可以分为头信息帧和数据帧":["1.24"],"帧的概念是它实现多路复用的基础":["1.24"],"多路复用":["1.24"],"返回成员总数":["2.1"],"add":["2.1"],"增加成员":["2.1"],"delete":["2.1"],"删除成员":["2.1"],"has":["2.1"],"查询成员":["2.1"],"clear":["2.1"],"清空成员":["2.1"],"可用array":["2.1"],"from":["2.1","6.42"],"将转化为数组":["2.1"],"keys":["2.1","3.7"],"返回键名":["2.1"],"values":["2.1"],"flat的作用是什么":["2.2"],"filter":["2.2"],"wait":["2.3","2.4"],"immediate":["2.3"],"false":["2.3"],"let":["2.3","2.11","2.13","2.14","2.44","6.31"],"throttle":["2.4"],"fn":["2.4","2.8"],"tostring":["2.5"],"call":["2.5"],"slice":["2.5","6.40"],"clonedeep":["2.5"],"context":["2.6"],"args":["2.6"],"if":["2.6","2.43","4.17","6.34","6.39","6.40","8.1"],"undefined":["2.7","6.31"],"window":["2.7"],"else":["2.7"],"object":["2.7","2.25","3.6"],"isarraylike":["2.7"],"o":["2.7"],"reject":["2.8"],"reason":["2.8"],"rejected":["2.8"],"try":["2.8"],"catch":["2.8","4.12"],"err":["2.8"],"then":["2.8","6.34"],"onfulfilled":["2.8"],"onrejected":["2.8"],"typeof":["2.8","6.34"],"function":["2.11","2.12","2.25","2.31","2.42","2.45","9.4"],"promisearr":["2.11","2.12","2.14"],"index":["2.11","2.14"],"result":["2.13","2.31","6.34","6.36"],"return":["2.13","2.14","2.39","2.43","3.4","3.7","6.40","8.1","9.6"],"new":["2.13","2.14","2.39","2.44"],"resolve":["2.13","2.39"],"tests":["2.15"],"promise":["2.15","2.39"],"defer":["2.15"],"箭头函数":["2.16"],"默认参数":["2.16"],"pending":["2.17"],"接收一个iterator结构的数据作为参数":["2.18"],"其中的每个值都是promise实例":["2.18"],"没有this":["2.19"],"会捕获上下文的this作为自己的this值":["2.19"],"var":["2.20"],"有变量提升":["2.20"],"存储一些基础变量":["2.21"],"string":["2.21","3.8"],"number":["2.21","3.8","7.9"],"即有函数创建就会生成闭包":["2.22"],"闭包和其函数在统一上下文":["2.22"],"闭包包含该作用域下所有变量":["2.22"],"prototype":["2.23","2.27"],"属性是否是某个实例对象的原型链上":["2.23"],"并且在原型链":["2.24"],"上设置构造函数的constructor为要实例化的fn":["2.24"],"传入参数":["2.24"],"并让构造函数的fn指向obj并执行":["2.24"],"如果fn执行后返回的是对象类型":["2.24"],"array":["2.25","6.31"],"symbol":["2.25"],"判断是否为数组":["2.25"],"instanceof":["2.25"],"可更改不稳定":["2.25"],"原型":["2.27"],"函数有一个":["2.27"],"但子线程完全受主线程控制":["2.28"],"且不得操作dom":["2.28"],"的任务分为":["2.28"],"同步任务":["2.28"],"nexttick":["2.29","6.35","6.41"],"domcontentloaded的区别":["2.30"],"onload":["2.31"],"console":["2.31","3.5","4.17"],"log":["2.31","3.5","4.17"],"转":["2.31"],"base64结果":["2.31"],"onerror":["2.31"],"error":["2.31","3.5"],"注意":["2.32"],"randomcolor":["2.33"],"color":["2.33"],"r":["2.34","2.35","6.34"],"g":["2.34","2.35"],"9a":["2.36"],"f":["2.36"],"i":["2.36","4.4","6.31"],"test":["2.36","6.42"],"d":["2.37"],"4e00":["2.38"],"9fa5":["2.38"],"xhr":["2.39"],"xmlhttprequest":["2.39"],"true":["2.39","3.20","4.12","6.42"],"监听进度事件":["2.39"],"1920px":["2.40"],"height":["2.40","6.41"],"1080px":["2.40"],"winheight":["2.40"],"目标元素触发拖拽":["2.41"],"并创建拖拽动画":["2.41"],"即函数在最后一步调用函数自身":["2.42"],"sum":["2.43"],"y":["2.43"],"hex":["2.44"],"len":["2.44"],"node":["2.45","6.31"],"root":["2.46"],"queue":["2.46"],"静态类型":["3.1"],"可以在编写脚本时就检查出类型错误":["3.1"],"setpoing":["3.3"],"与接口不同":["3.3"],"类型别名还可以用于其他类型":["3.3"],"如":["3.3"],"基本类型":["3.3"],"arg":["3.4"],"其中":["3.4"],"property":["3.5"],"keyof":["3.6","3.13","3.17"],"javascript":["3.6","3.20","9.21","9.22"],"是一种高度动态的语言":["3.6"],"有时在静态类型系统中捕获某些操作的语义可能会很棘手":["3.6"],"以一个简单的":["3.6"],"prop":["3.6"],"函数为例":["3.6"],"obj":["3.6"],"key":["3.6"],"该函数接收":["3.6"],"两个参数":["3.6"],"并返回对应属性的值":["3.6"],"对象上的不同属性":["3.6"],"可以具有完全不同的类型":["3.6"],"我们甚至不知道":["3.6"],"对象长什么样":["3.6"],"那么在":["3.6"],"typescript":["3.6"],"中如何定义上面的":["3.6"],"函数呢":["3.6"],"我们来尝试一下":["3.6"],"person":["3.7"],"name":["3.8","4.8","6.31","9.5"],"age":["3.8","7.9"],"加上可选":["3.8"],"我们可以通过":["3.8"],"来指定添加还是删除":["3.8"],"t":["3.10","3.13","3.15"],"any":["3.13","3.17"],"u":["3.15","3.16"],"的作用是从":["3.16"],"extends":["3.17"],"的作用是用来过滤类型中的":["3.18"],"null":["3.18","6.31","6.39"],"的作用是用于获得函数的参数类型组成的元组类型":["3.19"],"es2016":["3.20"],"es2017":["3.20"],"or":["3.20"],"esnext":["3.20"],"module":["3.20"],"commonjs":["3.20"],"指定使用模块":["3.20"],"amd":["3.20"],"system":["3.20"],"umd":["3.20"],"lib":["3.20"],"指定要包含在编译中的库文件":["3.20"],"allowjs":["3.20"],"允许编译":["3.20"],"文件":["3.20","6.22"],"checkjs":["3.20"],"报告":["3.20"],"文件中的错误":["3.20"],"jsx":["3.20"],"preserve":["3.20"],"executionpolicy":["4.1"],"显示":["4.1"],"cli":["4.3"],"publish":["4.3"],"platform":["4.3"],"app":["4.3","4.7"],"安装npm":["4.4"],"package":["4.4","4.9"],"yarn":["4.4"],"url":["4.5"],"xxxxxx":["4.5"],"dev":["4.5","4.10"],"测试":["4.5"],"set":["4.6"],"electron":["4.6"],"mirror":["4.6"],"forge":["4.8"],"maker":["4.8"],"squirrel":["4.8"],"config":["4.8"],"authors":["4.8"],"author":["4.10"],"编程三昧":["4.10"],"scripts":["4.10","7.19"],"enable":["4.10"],"loggin":["4.10"],"no":["4.10","7.9"],"sandbox":["4.10"],"build":["4.10"],"win":["4.10"],"x64":["4.10"],"linux":["4.10"],"gettime":["4.11"],"configurewebpack":["4.11"],"output":["4.11"],"autodownload":["4.12"],"自动下载":["4.12"],"autoinstallonappquit":["4.12"],"应用退出后自动安装":["4.12"],"检测是否有更新包并通知":["4.12"],"checkforupdatesandnotify":["4.12"],"监听渲染进程的":["4.12"],"install":["4.12"],"事件":["4.12"],"触发退出应用并安装":["4.12"],"所有接口都应该超时":["4.15"],"这种情况的判断的方法":["4.16"],"gettoken":["4.17"],"缓存存在token":["4.17"],"store":["4.17"],"dispatch":["4.17"],"validtoken":["4.17"],"require":["4.18"],"zip":["4.18"],"webpack":["4.18"],"gzip":["4.19"],"on":["4.19"],"vary":["4.19"],"删除node":["4.20"],"modules":["4.20"],"安装":["4.21"],"image":["4.21"],"渲染层":["5.1"],"运行环境":["5.2"],"浏览器":["5.2","7.13"],"特定的移动软件平台":["5.2"],"运行机制":["5.2"],"安卓":["5.3"],"ios":["5.3"],"现如今市面上端的形态多种多样":["5.4"],"原理":["6.1"],"改变hash值不会触发浏览器请求":["6.1"],"并且会触发hashchange事件":["6.1"],"最低支持ie8":["6.1"],"会触发浏览器请求":["6.1"],"如果资源不存在会404":["6.1"],"需要后端配合":["6.1"],"类似history":["6.1"],"vue在创建vm的时候":["6.2"],"会将数据配置在实例当中":["6.2"],"然后通过object":["6.2"],"defineproperty对数据进行操作":["6.2"],"为数据动态添加了getter与setter方法":["6.2"],"当获取数据的时候会触发对应的getter方法":["6.2"],"当设置数据的时候会触发对应的setter方法":["6.2"],"从而进一步触发vm的watcher方法":["6.2"],"然后数据更改":["6.2"],"vm则会进一步触发视图更新操作":["6.2"],"react是单向数据流":["6.2"],"react中属性是不允许更改的":["6.2"],"状态是允许更改的":["6.2"],"react中组件不允许通过this":["6.2"],"state这种方式直接更改组件的状态":["6.2"],"自身设置的状态":["6.2"],"可以通过setstate来进行更改":["6.2"],"在setstate中":["6.2"],"传入一个对象":["6.2"],"就会将组件的状态中键值对的部分更改":["6.2"],"vue":["6.3","9.8","9.22"],"适合":["6.3"],"通过编译生成独一无二的类名":["6.4"],"v":["6.7","6.39"],"父组件绑定属性":["6.8"],"子组件props属性接收":["6.8"],"br":["6.8","7.9"],"emits":["6.8"],"父组件定义方法":["6.8"],"子组件":["6.8"],"emits触发该方法":["6.8"],"但是只能监听data中存在的属性":["6.9"],"defineproperty":["6.10"],"this":["6.11","6.31","6.35"],"里为什么不能使用多个头结点":["6.13"],"为了能用devtools追踪状态变化":["6.14"],"在数据绑定这一块有什么区别":["6.15"],"父beforecreate":["6.16"],"父created":["6.16"],"父beforemount":["6.16"],"才开始渲染":["6.17"],"show则总是渲染":["6.17"],"只是用display切换":["6.17"],"if适用于运行很少改变条件":["6.17"],"不需要频繁切换条件的场景":["6.17"],"computed":["6.17","9.14"],"watch":["6.17"],"计算属性":["6.17"],"依赖其他属性值":["6.17"],"有缓存":["6.17"],"alive":["6.18"],"包裹动态组件时":["6.18"],"会缓存不活动的组件实例":["6.18"],"include":["6.18"],"没有进入就是同步":["6.19"],"requestidiecallback":["6.20"],"和css的":["6.21"],"loader":["6.21","6.24"],"以及对这":["6.21"],"两类代码压缩":["6.21"],"的":["6.21"],"初始化本次构建的配置参数":["6.22"],"并且执行配置文件中的插件实例化语句":["6.22"],"生成compiler传入plugin的apply方法":["6.22"],"shaking吗":["6.23"],"通过工具消除无用的js代码":["6.23"],"plugin":["6.24"],"作用":["6.24"],"不使用css":["6.25"],"语句":["6.26"],"例如":["6.26"],"foo":["6.26"],"是因为":["6.26"],"dependency":["6.27"],"the":["6.27"],"原因参考":["6.28"],"navigator":["6.28"],"readonly":["6.29"],"vue只会实例一个表单":["6.30"],"不仅表单本身会冲突":["6.30"],"主要更改了":["6.31"],"值获取的规则":["6.31"],"param":["6.31","6.34"],"opts":["6.31"],"getcomponentname":["6.31"],"ctor":["6.31"],"tag":["6.31"],"route":["6.31"],"isdef":["6.31"],"isasyncplaceholder":["6.31"],"iscomment":["6.31"],"asyncfactory":["6.31"],"getfirstcomponentchild":["6.31"],"children":["6.31"],"isarray":["6.31"],"for":["6.31"],"c":["6.31"],"off":["6.32"],"如ant中的":["6.33"],"created":["6.34"],"localpagenum":["6.34"],"parseint":["6.34"],"includes":["6.34"],"loaddata":["6.34"],"methods":["6.34"],"表格重新加载方法":["6.34"],"如果参数为":["6.34"],"则强制刷新到第一页":["6.34"],"bool":["6.34"],"refresh":["6.34"],"加载数据方法":["6.34"],"分页选项器":["6.34"],"过滤条件":["6.34"],"排序条件":["6.34"],"parameter":["6.34"],"field":["6.34"],"sortfield":["6.34"],"order":["6.34"],"sortorder":["6.34"],"对接自己的通用数据接口需要修改下方代码中的":["6.34"],"totalcount":["6.34"],"eslint":["6.34"],"disable":["6.34"],"next":["6.34"],"line":["6.34"],"record":["6.35"],"element":["6.35"],"document":["6.35","6.41"],"queryselectorall":["6.35","6.36"],"settimeout":["6.36"],"tr":["6.36"],"data":["6.36"],"全局样式加入":["6.37"],"ant":["6.37"],"modal":["6.39"],"footer":["6.39"],"addtaskdevice":["6.39"],"style":["6.39","6.40"],"csstext":["6.40"],"indexof":["6.40"],"cursor":["6.40"],"sty":["6.40"],"dom":["6.40","7.19"],"body":["6.41"],"clientheight":["6.41"],"table":["6.41"],"requiremoduleextension":["6.42"],"import":["6.42"],"styles":["6.42"],"f89c39":["6.43"],"cc802f":["6.43"],"975f23":["6.43"],"7a5125":["6.43"],"2ce965":["6.43"],"25ad4e":["6.43"],"tip":["6.44"],"提示":["6.44"],"性能差":["6.45"],"必须为图标本身的宽高":["6.46"],"图片转化问题存在太多的误差以及偏移":["6.47"],"不用想着去优化了":["6.48"],"形成一个执行栈":["7.1"],"一段代码在执行时":["7.2"],"共同点":["7.4"],"不同":["7.4"],"增加版本号":["7.5"],"由于疏忽或程序错误造成的未能释放已经不再使用的内存":["7.6"],"清除定时器为什么就不会有内存泄露":["7.7"],"把能缓存的页面或数据缓存到能够更快取到的地方":["7.8"],"值为一个绝对时间的标准gmt格式的时间字符串":["7.9"],"cache":["7.9","7.10"],"control":["7.9"],"max":["7.9"],"最新一次请求事件小于资源第一次请求的事件加上number":["7.9"],"expires":["7.10"],"线程的切换是微任务":["7.11"],"计时是实时的":["7.12"],"的实现":["7.13"],"它本身是一个迭代器":["7.14"],"迭代器利用了纤程":["7.14"],"在不同的纤程之间切换":["7.14"],"因为往往被设计成不被js阻塞的":["7.15"],"虽然它们和js的本身无关":["7.16"],"最多一个":["7.17"],"渲染进程":["7.17"],"页面文档解析":["7.17"],"执行与渲染":["7.17"],"浏览器地址栏输入url":["7.17"],"dns服务器解析域名":["7.17"],"解析过程":["7.17"],"查看浏览器dns缓存":["7.17"],"项":["7.18"],"cookie":["7.18"],"sessionstorage":["7.18"],"大小":["7.18"],"主线程渲染流程":["7.19"],"创建文档对象模型":["7.19"],"创建":["7.19"],"对象模型":["7.19"],"cssom":["7.19"],"基于":["7.19"],"执行脚本":["7.19"],"lang":["7.21"],"en":["7.21"],"head":["7.21"],"meta":["7.21"],"utf":["7.21"],"equiv":["7.21"],"mid":["8.1"],"math":["8.1"],"个人总结的代码规范":["9.0"],"则无视":["9.1"],"在表达式较长时":["9.3"],"推荐换行":["9.3"],"xxlajsdlkjaklsd":["9.3"],"id":["9.5"],"address":["9.5"],"old":["9.5"],"home":["9.5"],"可以写在一行":["9.8"],"一旦超过必须换行":["9.8"],"而且闭合标签必须和开头标签保持相同的缩进":["9.8"],"的对象属性":["9.9"],"超过5个需要换行":["9.9"],"注意严格保持缩进":["9.9"],"此步骤不能缺":["9.10"],"必须换行":["9.11"],"若其中有一项函数过长":["9.12"],"则单独让它换行":["9.12"],"最后一项必须加":["9.12"],"变量声明的数据格式必须和其后续复制的数据格式一致":["9.13"],"mounted":["9.14"],"method":["9.14"],"mounted等生命周期里面监听":["9.15"],"但是必须在":["9.15"],"beforedestroy":["9.15"],"前端代码格式本身松散":["9.17"],"初次添加prettier插件":["9.18"],"过渡阶段":["9.18"],"过渡阶段只使用":["9.19"],"快捷键":["9.19"],"prettierrc":["9.20","9.22"],"json配置文件":["9.20"],"前端":["9.20"],"常见的prettier配置":["9.20"],"json":["9.20","9.22"],"printwidth":["9.20"],"tabwidth":["9.20"],"usetabs":["9.20"],"语言":["9.21"],"框架":["9.21"],"language":["9.21"],"frameworks":["9.21"],"prettier":["9.21"],"webstorm内置prettier":["9.21"],"configpath":["9.22"],"editor":["9.22"],"defaultformatter":["9.22"],"esbenp":["9.22"]},{"0":["2.4","2.7","2.38","2.44","2.46","6.34"],"1":["4.9","6.13","6.30"],"2":["0.29","0.35","0.40","1.1","1.14","2.31","4.1","4.4","4.21","6.22","7.14","7.16","8.1","9.11","9.14","9.15","9.19"],"3":["0.39","4.20","7.17","9.17"],"4":["0.29","7.17","9.21"],"5":["7.17","9.21"],"7":["6.43"],"9":["1.18"],"10":["1.18"],"50":["0.33"],"100":["0.33","6.43"],"123":["1.11"],"204":["1.3"],"206":["1.18"],"301":["1.13"],"302":["1.13"],"304":["1.13"],"1000":["2.4"],"642323":["6.43"],"在快速开发测试中这种设置固然是好的":["0.2"],"但我建议绝对不要在最终的产品代码中使用":["0.2"],"因为会给浏览器增加大量不必要的":["0.2"],"负荷":["0.2"],"号作为前缀可以选择该":["0.3"],"id":["0.3","0.4","0.15","6.35"],"和":["0.4","0.30","2.28","6.34"],"标签类型一样的元素":["0.6"],"而不使用":["0.6"],"链接选择器":["0.7"],"我们使用":["0.7"],"这是邻近元素选择器":["0.8"],"只会选中直接后代":["0.9"],"data":["0.11","6.35"],"匹配所有含有":["0.11"],"的元素":["0.11"],"bar":["0.11"],"波浪符号":["0.11"],"这个伪类可以用来定义":["0.12"],"content":["0.13","0.38","1.10","1.18","7.21"],"display":["0.13","0.28"],"block":["0.13"],"clear":["0.13"],"both":["0.13"],"visibility":["0.13"],"用户交互伪类":["0.14"],"除了一个":["0.15"],"为":["0.15"],"css":["0.16"],"p":["0.16","2.13","3.8"],"first":["0.16"],"letter":["0.16"],"float":["0.16"],"指序列里的第n个元素":["0.17"],"从1数起":["0.17"],"child":["0.18"],"type":["0.19","0.24","0.25","1.10","3.4","3.5","3.8","9.12"],"n":["0.19"],"of":["0.20","2.1","3.6","6.27"],"第一子元素选择器":["0.21"],"最后子元素选择器":["0.22"],"唯一子元素选择器":["0.23"],"js":["0.26","3.15","9.12"],"let":["0.26","2.4","2.5","2.15","2.24","2.31","2.37","2.38"],"time":["0.26"],"window":["0.26"],"onload":["0.26"],"setinterval":["0.26"],"const":["0.26"],"document":["0.26","2.25","6.40"],"getelementbyid":["0.26"],"if":["0.26","1.11","2.5","2.8","2.9","2.14","2.39","2.45"],"hidden":["0.27"],"占位":["0.27"],"否":["0.27"],"是":["0.27","0.28","0.30"],"删除元素":["0.28"],"clamp":["0.29"],"orient":["0.29"],"vertical":["0.29"],"align":["0.29"],"justify":["0.29"],"div":["0.29","6.42"],"container":["0.29"],"reverse":["0.30"],"column":["0.30","6.34"],"wrap":["0.30"],"换行":["0.30"],"nowrap":["0.30"],"warp":["0.30"],"flow":["0.30"],"property":["0.32"],"虚化问题可加":["0.33"],"transform":["0.33"],"origin":["0.33"],"解决":["0.33"],"形成条件":["0.34"],"body根元素":["0.34"],"浮动元素":["0.34"],"伪类":["0.36"],"区别":["0.36"],"含义":["0.37"],"默认文档流":["0.37"],"绝对定位":["0.37"],"box":["0.38"],"百分比布局":["0.39"],"浮动":["0.40"],"不要使用height":["0.41"],"width":["0.41","7.21"],"margin":["0.41"],"padding等":["0.41"],"字段名不区分大小写":["1.1"],"br":["1.1","1.2","1.14","1.22","6.1"],"字段名不允许出现空格":["1.1"],"下划线":["1.1"],"只能进行url编码":["1.2"],"只能接受ascii字符":["1.2"],"无限制":["1.2"],"状态码为":["1.3"],"作用":["1.3"],"浏览器能够显示的字符集":["1.5"],"encoding":["1.5"],"时间的描述格式由rfc822定义":["1.6"],"server":["1.6"],"如果不设置":["1.7"],"enctype":["1.7"],"属性":["1.7","2.27"],"那么最终就会以":["1.7"],"此时客户端调用缓存内容":["1.8"],"不必进行二次下载":["1.8"],"状态码304不应该认为是一种错误":["1.8"],"而是对客户端":["1.8"],"用于对资源进行部分修改":["1.9"],"delete":["1.9"],"用于删除指定的资源":["1.9"],"head":["1.9"],"获取报文首部":["1.9"],"setrequestheader":["1.10"],"application":["1.10"],"x":["1.10","2.8","7.21"],"catch":["1.11","4.17","6.34"],"thrown":["1.11"],"iscancel":["1.11"],"console":["1.11","4.12"],"log":["1.11","4.12"],"request":["1.11","6.27"],"canceled":["1.11"],"message":["1.11"],"query":["1.12"],"fragment":["1.12"],"协议名":["1.12"],"moved":["1.13"],"permanently":["1.13"],"永久重定向":["1.13"],"如果网站从http升级到https":["1.13"],"以前的站点不再使用":["1.13"],"应当返回301通知浏览器做缓存优化":["1.13"],"在后续访问会自动访问重定向的地址":["1.13"],"found":["1.13"],"临时重定向":["1.13"],"modified":["1.13"],"当协商缓存返回的状态码":["1.13"],"传输形式的多样性":["1.14"],"明文传输":["1.15"],"协议中的报文":["1.15"],"image":["1.16","2.31"],"git":["1.16"],"jpeg":["1.16"],"png":["1.16"],"audio":["1.16"],"video":["1.16"],"长于返回值":["1.17"],"则导致传输失败":["1.17"],"不定长包":["1.17"],"partial":["1.18"],"length":["1.18","2.7","2.46","6.34"],"accept":["1.18"],"bytes":["1.18"],"urlencoded":["1.19"],"multipart":["1.19"],"并发":["1.20"],"响应头":["1.21"],"ca证书公钥黄":["1.22"],"请求服务器公钥":["1.22"],"ca证书私钥绿":["1.22"],"服务器私钥红":["1.22"],"j":["1.23"],"ack":["1.23"],"实现了多路复用":["1.24"],"仍然复用":["1.24"],"tcp":["1.24"],"连接":["1.24"],"但是在一个连接里":["1.24"],"客户端和服务器都可以同时发送多个请求或回应":["1.24"],"而且不用按照顺序一一发送":["1.24"],"这样就避免了":["1.24"],"队头堵塞":["1.24"],"的问题":["1.24"],"数据流":["1.24"],"返回键值":["2.1"],"entries":["2.1"],"返回键值对":["2.1"],"数组":["2.1"],"foreach":["2.1","2.13","6.34","6.36","6.43"],"回调函数遍历":["2.1"],"没有返回值":["2.1"],"只对数组结构处理默认遍历器生成函数就是values":["2.1"],"所以for":["2.1"],"of可直接遍历":["2.1"],"其中set没有键名":["2.1"],"所以keys和values行为一致":["2.1"],"扩展运算符":["2.1","2.16"],"内部使用的for":["2.1"],"故可用":["2.1"],"过滤数组":["2.2"],"会创建一个新数组":["2.2"],"timer":["2.3"],"null":["2.3","2.6","2.21","2.43"],"return":["2.3","2.11","2.12","2.42","3.5"],"debounced":["2.3"],"args":["2.3","3.14"],"previous":["2.4"],"result":["2.5","2.11"],"clonetyperesult":["2.5"],"undefined":["2.6","2.21","3.18"],"typeof":["2.7","6.31"],"isfinite":["2.7"],"function":["2.8","2.9","2.10","2.15","2.24"],"value":["2.8","2.9"],"throw":["2.8"],"promise2":["2.8"],"new":["2.8","2.11","2.12","6.43"],"settimeout":["2.8"],"resolve":["2.11","2.14"],"reject":["2.13","2.14"],"i":["2.13","2.37","2.38","2.44"],"deferred":["2.15"],"dfd":["2.15"],"解构赋值":["2.16"],"fulfilled":["2.17"],"只有状态都变成fulfilled才":["2.18"],"all的状态才会变成fulfilled":["2.18"],"匿名函数":["2.19"],"不能作为构造函数":["2.19"],"只在命令所在的代码块内有效":["2.20"],"不存在变量提升":["2.20"],"boolean":["2.21"],"引用地址":["2.22"],"定义函数不会创建闭包":["2.22"],"只有创建":["2.22"],"实现原理":["2.23"],"null除外":["2.24"],"则返回该对象":["2.24"],"否则返回obj":["2.24"],"fn":["2.24"],"constructor":["2.25"],"举例":["2.25"],"var":["2.25"],"iframe":["2.25"],"createelement":["2.25"],"它指向一个对象":["2.27"],"该对象称为原型对象":["2.27"],"异步任务":["2.28"],"其中":["2.28"],"进入":["2.28"],"将指定任务排到所有异步任务之前":["2.29"],"在文档中的所有对象都在dom中":["2.30"],"网络图片":["2.31"],"imageurltobase64":["2.31"],"url":["2.31"],"一定要设置为let":["2.31"],"不然图片不显示":["2.31"],"formdata中append上去的数据中":["2.32"],"math":["2.33","2.34","2.35"],"floor":["2.33","2.34","2.35","8.1"],"random":["2.35"],"sixhex":["2.36"],"replace":["2.36"],"ig":["2.36"],"kw":["2.36"],"test":["2.37","4.9","6.31"],"hex":["2.37"],"name":["2.38","3.3","3.7","4.11","6.28","7.21"],"for":["2.38","2.44","6.7","9.21"],"需要在请求发送前监听":["2.39"],"addeventlistener":["2.39"],"progress":["2.39"],"evt":["2.39"],"lengthcomputable":["2.39"],"percentcomplete":["2.39"],"loaded":["2.39"],"total":["2.39"],"percentage是当前下载进度":["2.39"],"可根据自己的需求自行处理":["2.39"],"documentelement":["2.40","6.40"],"clientheight":["2.40","6.40"],"浏览器的高度":["2.40"],"winwidth":["2.40"],"body":["2.41","6.40"],"的":["2.41"],"f":["2.42","4.3"],"bind":["2.43"],"else":["2.43","6.31","9.6"],"array":["2.44","6.34","6.43"],"code":["2.44"],"children":["2.45","6.8"],"while":["2.46"],"由于严格的类型检查":["3.1"],"使得重构比较安全":["3.1"],"要求编写typescript":["3.2"],"要求a":["3.2"],"b参数类型一致":["3.2"],"联合类型":["3.3"],"元组":["3.3"],"primitive":["3.3"],"string":["3.3","3.7","6.31"],"object":["3.3"],"partialpointx":["3.3"],"partialpointy":["3.3"],"union":["3.3"],"partialpoint":["3.3"],"代表":["3.4"],"在定义泛型时通常用作第一个类型变量名称":["3.4"],"但实际上":["3.4"],"可以用任何有效名称代替":["3.4"],"doesn":["3.5"],"exist":["3.5"],"on":["3.5","4.12"],"错的原因在于":["3.5"],"在上面代码中":["3.6"],"为了避免调用":["3.6"],"函数时传入错误的参数类型":["3.6"],"我们为":["3.6"],"参数设置了类型":["3.6"],"分别为":["3.6"],"类型":["3.6"],"然而":["3.6"],"事情并没有那么简单":["3.6"],"针对上述的代码":["3.6"],"编译器会输出以下错误信息":["3.6"],"element":["3.6"],"implicitly":["3.6"],"has":["3.6"],"an":["3.6"],"any":["3.6","4.19"],"because":["3.6"],"expression":["3.6"],"can":["3.6"],"t":["3.6","3.8","3.11","3.12","3.14"],"be":["3.6"],"used":["3.6"],"to":["3.6"],"index":["3.6"],"元素隐式地拥有":["3.6"],"因为":["3.6"],"类型不能被用于索引":["3.6"],"map":["3.7","3.20","6.34"],"key":["3.7","6.35","6.36"],"interface":["3.7"],"optionaltestinterface":["3.8"],"in":["3.8","3.9","3.10"],"keyof":["3.8","3.9","3.10"],"局限":["3.9"],"的作用是将":["3.13"],"中所有的属性的值转化为":["3.13"],"extends":["3.14"],"的作用是将某个类型中属于另一个的类型移除掉":["3.15"],"中提取出":["3.16"],"的作用是使用":["3.17"],"类型中除了":["3.17"],"及":["3.18"],"代码的生成":["3.20"],"react":["3.20"],"native":["3.20"],"declaration":["3.20"],"生成相应的":["3.20"],"d":["3.20"],"ts":["3.20"],"sourcemap":["3.20"],"outfile":["3.20"],"将输出文件合并为一个文件":["3.20"],"outdir":["3.20"],"指定输出目录":["3.20"],"rootdir":["3.20"],"用来控制输出目录结构":["3.20"],"removecomments":["3.20"],"restricted":["4.1"],"受限":["4.1"],"进入文件夹":["4.2"],"appresource":["4.3"],"project":["4.3"],"mes":["4.3"],"pda":["4.3"],"xcopy":["4.3"],"add":["4.4"],"在vue":["4.5"],"config":["4.5"],"js的代理中":["4.5"],"xxx":["4.5"],"target":["4.5","6.28"],"https":["4.6"],"taobao":["4.6"],"commandline":["4.7"],"dusanjiao":["4.8"],"作者必须要用":["4.8"],"否则就会提示id":["4.8"],"out":["4.9"],"outapp":["4.9"],"mac":["4.10"],"builder配置":["4.10"],"productname":["4.10"],"myfirstapp":["4.10"],"项目名":["4.10"],"这也是生成的exe文件的前缀名":["4.10"],"appid":["4.10"],"xxxxx":["4.10"],"copyright":["4.10"],"xxxx":["4.10"],"版权信息":["4.10"],"filename":["4.11"],"static":["4.11"],"handle":["4.12"],"quitandinstall":["4.12"],"available":["4.12"],"info":["4.12"],"有新版本需要更新":["4.12"],"not":["4.12"],"去接口拦截器把超时时间设置1到2分钟":["4.16"],"then":["4.17"],"getuserrole":["4.17"],"err":["4.17"],"logout":["4.17"],"plugin":["4.18","6.21"],"path":["4.18"],"proxied":["4.19"],"types":["4.19"],"text":["4.19"],"删除package":["4.20"],"lock":["4.20"],"preview":["4.21"],"webview":["5.1"],"多线程":["5.1"],"网页":["5.2"],"可以热启动":["5.2"],"系统权限":["5.2"],"开发语言":["5.2"],"js运行环境":["5.3"],"v8":["5.3"],"当业务要求各终端都要实现":["5.4"],"api":["6.1","6.17"],"fallback":["6.1"],"初始化":["6.1"],"createbrowserhistory":["6.1"],"html5history":["6.1"],"createhashhistory":["6.1"],"hashhistory":["6.1"],"creatememoryhistory":["6.1"],"还可以传入一个函数":["6.2"],"这个回调函数必须向上面方式一样的一个对象函数可以接受prevstate和props":["6.2"],"通过调用this":["6.2"],"setstate去更新this":["6.2"],"state":["6.2"],"不能直接操作this":["6.2"],"请把它当成不可变的":["6.2"],"调用setstate更新this":["6.2"],"它不是马上就会生效的":["6.2"],"它是异步的":["6.2"],"所以不要认为调用完setstate后可以立马获取到最新的值":["6.2"],"多个顺序执行的setstate不是同步的一个接着一个的执行":["6.2"],"会加入一个异步队列":["6.2"],"然后最后一起执行":["6.2"],"即批处理":["6.2"],"setstate是异步的":["6.2"],"导致获取dom可能拿的还是之前的内容":["6.2"],"所以我们需要在setstate第二个参数":["6.2"],"webapp":["6.3"],"适合做用户交互多":["6.3"],"各种动态效果变化丰富的应用":["6.3"],"特别是pc":["6.3"],"用js对象表示dom的树结构":["6.5"],"用于构建真实dom":["6.5"],"parent":["6.8"],"节制地使用":["6.8"],"parent和":["6.8"],"它们的主要目的是作为访问组件的应急方法":["6.8"],"this":["6.8"],"conputed可以定义data中不存在的属性":["6.9"],"nexttick":["6.11"],"mutation是同步的":["6.14"],"vue2运用object":["6.15"],"defineproperty":["6.15"],"子beforecreate":["6.16"],"子created":["6.16"],"子beforemount":["6.16"],"只有依赖的值发生改变":["6.17"],"下一次获取computed的值时才会重新计算computed":["6.17"],"监听器":["6.17"],"需要进行数值计算只用computed":["6.17"],"执行异步或者开销较大的操作使用watch":["6.17"],"使用":["6.17"],"选项允许我们执行异步操作":["6.17"],"访问一个":["6.17"],"限制我们执行该操作的频率":["6.17"],"并在我们得到最终结果前":["6.17"],"定义缓存白名单":["6.18"],"exclude":["6.18"],"定义缓存黑名单":["6.18"],"max":["6.18"],"定义缓存组件上限":["6.18"],"超出上限使用lru的策略置换缓存数据":["6.18"],"什么东西不会进入react的调度流程":["6.19"],"会在浏览器空闲时期一次调用函数":["6.20"],"上":["6.21"],"原因是编译和压缩的过程中":["6.21"],"都需要将代码转化为":["6.21"],"ast":["6.21"],"语法分析树":["6.21"],"为webpack事件流挂上自定义钩子":["6.22"],"进入entryoption阶段":["6.22"],"webpack开始读取配置的entries":["6.22"],"uglify不能跨文件做dce":["6.23"],"tip":["6.23"],"文件加载器":["6.24"],"处理文件":["6.24"],"事件监听器":["6.24"],"运行":["6.24"],"loader行不行":["6.25"],"配合webpack打包css文件":["6.25"],"可能是系统或项目中任何文件的任何路径":["6.26"],"必须至少包含一些关于模块的路径信息":["6.26"],"打包可以限定于一个特定的目录或文件集":["6.26"],"以便于在使用动态表达式时":["6.26"],"表单下的item如果属性相同也会冲突":["6.30"],"合并为一个表单":["6.30"],"componentoptions":["6.31"],"matches":["6.31"],"pattern":["6.31"],"split":["6.31"],"istanbul":["6.31"],"ignore":["6.31"],"next":["6.31"],"false":["6.31","9.20"],"keepaliveinstance":["6.31"],"filter":["6.31"],"a":["6.33","9.8"],"返回结果中的当前分页数":["6.34"],"注意":["6.34"],"已更改为前端页码":["6.34"],"跳过后台获取":["6.34"],"原码为":["6.34"],"返回结果中的总记录数":["6.34"],"为防止删除数据后导致页面当前页面数据长度为":["6.34"],"自动翻页到上一页":["6.34"],"这里用于判断接口是否有返回":["6.34"],"且":["6.34"],"存在":["6.34"],"小于等于":["6.34"],"的大小":["6.34"],"当情况满足时":["6.34"],"表示数据不满足分页大小":["6.34"],"关闭":["6.34"],"分页功能":["6.34"],"try":["6.34"],"hideonsinglepage":["6.34"],"返回结果中的数组数据":["6.34"],"finally":["6.34"],"totallist":["6.34"],"instanceof":["6.34"],"needtotal":["6.34"],"用于更新已选中的列表数据":["6.34"],"统计":["6.34"],"updateselect":["6.34"],"list":["6.34"],"item":["6.34","6.36","6.43"],"reduce":["6.34"],"sum":["6.34"],"dataindex":["6.34"],"isnan":["6.34"],"清空":["6.34"],"已选中项":["6.34"],"clearselected":["6.34"],"onchange":["6.34"],"tr":["6.35"],"row":["6.35"],"extra":["6.35"],"notfix":["6.36"],"fix":["6.36"],"table":["6.37"],"fixed":["6.37"],"option":["6.38"],"5px":["6.39"],"background":["6.39"],"67c23a":["6.39"],"color":["6.39"],"white":["6.39"],"返回后再点击我":["6.39"],"attr":["6.40"],"getcomputedstyle":["6.40"],"onmousedown":["6.40"],"e":["6.40"],"鼠标按下":["6.40"],"计算当前元素距离可视区的距离":["6.40"],"disx":["6.40"],"clientx":["6.40"],"offsetleft":["6.40"],"disy":["6.40"],"clienty":["6.40"],"offsettop":["6.40"],"screenwidth":["6.40"],"clientwidth":["6.40"],"body当前宽度":["6.40"],"screenheight":["6.40"],"可见区域高度":["6.40"],"queryselector":["6.41"],"ant":["6.41"],"antcardbody":["6.41"],"scss":["6.42"],"class":["6.42"],"以上做法用于样式直接作用于某个元素上":["6.42"],"247c3e":["6.43"],"1a4727":["6.43"],"f046e2":["6.43"],"c437b8":["6.43"],"962d8d":["6.43"],"61215c":["6.43"],"d42f2f":["6.43"],"a72727":["6.43"],"912b2b":["6.43"],"data1":["6.43"],"data2":["6.43"],"data3":["6.43"],"fill":["6.43"],"由于官方文档稀烂得来":["6.44"],"尤其需要注意不能频繁创建":["6.45"],"因为它并不会帮你查重":["6.45"],"或者小于图片的宽高":["6.46"],"这多亏了百度":["6.47"],"如果实在想优化":["6.48"],"主线程外存在一个任务队列":["7.1"],"异步任务有了结果":["7.1"],"程序是如何去区分宏任务和微任务的":["7.2"],"defer":["7.4"],"并行下载js":["7.4"],"增加修改时间戳":["7.5"],"引起内存泄漏的场景":["7.6"],"第一个参数为字符串":["7.7"],"响应数据不能被任何接受响应的客户端所缓存":["7.9"],"强制从服务器进行拉取":["7.9"],"可用在请求头和响应头中":["7.9"],"store":["7.9"],"所传送的响应数据除了不能被缓存":["7.9"],"也不能存入磁盘":["7.9"],"public":["7.9"],"允许所有终端缓存数据":["7.9"],"private":["7.9"],"control":["7.10"],"last":["7.10"],"它一定不能":["7.12"],"平台有它自己的事件注册和派发机制":["7.13"],"所以是微任务":["7.14"],"进程和纤":["7.14"],"所以会单独开启一个进程作管理":["7.15"],"但是它们的执行时机和它们所在的进程是有关的":["7.16"],"1不存在则查询本地计算机本地dns缓存":["7.17"],"2不存在则询问递归式dns服务器":["7.17"],"3不存在则访问根域名服务器和tld域名服务器":["7.17"],"再到对应的权威dns服务":["7.17"],"器找":["7.17"],"并缓存啊到递归式服务器":["7.17"],"再将记录返回本地":["7.17"],"4k":["7.18"],"5m":["7.18"],"生命周期":["7.18"],"不设置有效期则会存放在内存中":["7.18"],"合并":["7.19"],"形成渲染树":["7.19"],"render":["7.19"],"tree":["7.19"],"使用渲染树布局":["7.19"],"layout":["7.19"],"所有元素":["7.19"],"渲染":["7.19"],"paint":["7.19"],"合成线程":["7.19"],"通过":["7.19"],"gpu":["7.19"],"将位图绘制到屏幕上":["7.19"],"ua":["7.21"],"compatible":["7.21"],"ie":["7.21"],"edge":["7.21"],"viewport":["7.21"],"temp":["8.1"],"splice":["8.1"],"代码规范很重要":["9.0"],"能够帮你很舒服的阅读代码":["9.0"],"否则规定两个空格作为缩进":["9.1"],"aslkdjasjdklasd":["9.3"],"12308102938123":["9.3"],"lghldsfgjdfgdjklfgjdklfgkshdfgsdjlghdf":["9.3"],"12837189072398":["9.3"],"以上均没严格要求":["9.5"],"但是在变量不长的情况下":["9.5"],"不推荐":["9.8","9.9"],"input":["9.8"],"v":["9.8"],"model":["9.8"],"html":["9.9","9.22"],"getlist":["9.9"],"开头必须为大写字母":["9.10"],"visible":["9.12"],"watch":["9.14"],"watch不要在生命周期中声明":["9.14"],"注销监听":["9.15"],"事件名称统一使用字符串":["9.15"],"公司项目代码格式不一致":["9.17"],"项目中存在":["9.18"],"已格式化":["9.18"],"未格式化":["9.18"],"格式化代码":["9.19"],"semi":["9.20"],"true":["9.20"],"singlequote":["9.20"],"prosewrap":["9.20"],"preserve":["9.20"],"arrowparens":["9.20"],"always":["9.20"],"bracketspacing":["9.20"],"选择手动配置":["9.21"],"将prettier指向当前目录下的插件":["9.21"],"将你想要格式化的文件后缀配置在":["9.21"],"run":["9.21"],"files":["9.21"],"vscode":["9.22"]},{"0":["0.13","4.9","7.21"],"1":["2.28","6.23","6.42","7.2","7.21"],"2":["1.20","2.43","4.2","6.11","6.30","6.43","9.6"],"3":["0.33","0.35","0.41","1.1","3.1","3.3","6.22","6.43","7.1","9.14","9.18"],"4":["0.39","4.20"],"6":["6.43"],"7":["4.9"],"8":["6.43"],"10":["6.40"],"12":["6.43"],"20":["6.43"],"40":["6.34"],"48":["2.44"],"100":["2.39"],"200":["2.39"],"256":["2.34","2.35"],"400":["1.13"],"403":["1.13"],"404":["1.13"],"405":["1.13"],"600":["6.34"],"1000":["4.12"],"1920":["2.40"],"100000":["2.43"],"1677216":["2.33"],"星形":["0.2"],"也可以用于子元素选择器":["0.2"],"child":["0.2"],"的元素":["0.3"],"类选择器的区别是":["0.4"],"z":["0.5"],"id":["0.6"],"或者":["0.6"],"伪类来定义所有还没点击的链接":["0.7"],"只会":["0.8"],"在x后面的y元素都会被选中":["0.10"],"可以让你定义取值带有空格的属性":["0.11"],"a":["0.11","6.27"],"path":["0.11"],"to":["0.11","4.10"],"image":["0.11"],"info":["0.11"],"选中":["0.12","9.21"],"hidden":["0.13"],"font":["0.13","0.16","6.34"],"size":["0.13","0.16"],"height":["0.13","0.29"],"user":["0.14"],"container":["0.15"],"的div":["0.15"],"css":["0.15","4.19","5.2","9.22"],"left":["0.16","6.34","6.37","8.1"],"2em":["0.16"],"如果你想匹配列表里的第二个元素":["0.17"],"可以使用":["0.17"],"li":["0.17"],"n":["0.18"],"元素类型选择器":["0.19"],"type":["0.20","3.15","3.16","6.39","6.43"],"选中母元素的第一个子元素":["0.21"],"匹配最后一个子元素":["0.22"],"匹配唯一的子元素":["0.23"],"唯一子元素类型选择器":["0.24"],"第一个元素类型选择器":["0.25"],"style":["0.26","6.34","6.35","6.36"],"marginleft":["0.26"],"200px":["0.26"],"return":["0.26","2.7","2.10"],"clearinterval":["0.26"],"回流与渲染":["0.27"],"none":["0.28"],"standard":["0.29"],"more":["0.29"],"更多":["0.29"],"max":["0.29"],"54px":["0.29"],"最大高度":["0.29"],"超出隐藏":["0.29"],"的简写形式":["0.30"],"默认值为row":["0.30"],"justify":["0.30"],"content":["0.30"],"定义子项在主轴方向上的对齐方式":["0.30"],"center":["0.30","6.43"],"space":["0.30"],"between":["0.30"],"around":["0.30"],"items":["0.30"],"定义子项在交叉轴上如何对齐":["0.30"],"duration":["0.32"],"timing":["0.32"],"渐变":["0.33"],"linear":["0.33"],"gradient":["0.33"],"0deg":["0.33"],"绝对定位元素":["0.34"],"display":["0.34"],"inline":["0.34"],"translate位移":["0.35"],"创建元素":["0.36"],"相对定位":["0.37"],"继承父元素定位":["0.37"],"rem":["0.39"],"bfc":["0.40"],"原因阅读下方连接":["0.41"],"通过打包一个空的安卓应用访问项目地址的方式可以闪屏问题":["0.41"],"字段名后面必须紧跟冒号":["1.1"],"空行":["1.1"],"用来区分头部和实体":["1.1"],"实体":["1.1"],"响应报文":["1.1"],"参数":["1.2"],"查询字符串":["1.2"],"请求体":["1.2"],"幂等性":["1.2"],"作用1":["1.3"],"询问服务器是否支持修改的请求头":["1.3"],"浏览器能够处理的压缩编码":["1.5"],"language":["1.5"],"服务器名称":["1.6"],"connection":["1.6"],"方式提交数据":["1.7"],"该种方式提交的数据放在":["1.7"],"body":["1.7","2.25","7.21"],"里面":["1.7"],"数据按照":["1.7"],"key1":["1.7"],"有缓存情况下":["1.8"],"服务端的一种响应":["1.8"],"搜索引擎蜘蛛会更加青睐内容源更新频繁的网站":["1.8"],"通过特定时间内对网站抓取返回的状态码来调节对该网站的抓取频次":["1.8"],"与get相比":["1.9"],"不返回报文主体部分":["1.9"],"使用场景是比如下载一个大文件前":["1.9"],"先获取其大小再决定是否要下载":["1.9"],"以此可以节约宽带资源":["1.9"],"form":["1.10"],"urlencoded":["1.10"],"send":["1.10","4.12"],"onreadystatechange":["1.10"],"else":["1.11","2.5","2.6","4.17","6.34"],"处理错误":["1.11"],"post":["1.11"],"name":["1.11"],"小明":["1.11"],"取消请求":["1.11"],"参数是可选的":["1.11"],"http":["1.12"],"https":["1.12"],"file等":["1.12"],"4xx":["1.13"],"客户端错误":["1.13"],"bad":["1.13"],"request":["1.13"],"forbidden":["1.13"],"服务器禁止访问":["1.13"],"资源未找到":["1.13"],"不仅可以传输文本":["1.14"],"还能传输图片":["1.14"],"视频等":["1.14"],"主要指头部":["1.15"],"不适用二进制数据":["1.15"],"mpeg":["1.16"],"mp4":["1.16"],"application":["1.16","4.19"],"json":["1.16","4.10","4.20","4.21"],"javascript":["1.16","4.19"],"transfer":["1.17"],"enconding":["1.17"],"chunked":["1.17"],"i":["1.18","2.11"],"am":["1.18"],"xxxxx":["1.18"],"表示请求的返回":["1.18"],"表示资源的总大小":["1.18"],"多段请求":["1.18"],"data":["1.19","3.3","6.43"],"数据会被编码成以":["1.19"],"set":["1.21","4.1"],"服务器公钥蓝":["1.22"],"使用了数据流的概念":["1.24"],"因为":["1.24"],"的数据包是不按顺序发送的":["1.24"],"同一个连接里面连续的数据包":["1.24"],"可能属于不同的请求":["1.24"],"因此":["1.24"],"必须要对数据包做标记":["1.24"],"指出它属于哪个请求":["1.24"],"将每个请求或回应的所有数据包":["1.24"],"要改变原set结构":["2.1"],"需要用":["2.1"],"重新赋值或者array":["2.1"],"中回调函数重新赋值":["2.1"],"tip":["2.1"],"weakset":["2.1"],"类似set":["2.1"],"不重复":["2.1"],"成员只能是对象":["2.1"],"对象都是弱引用":["2.1"],"没有引用会自动回收":["2.1"],"所以不适合引用":["2.1"],"只适合临时存放对象":["2.1"],"只有add":["2.1"],"if":["2.3","2.44","7.9"],"cleartimeout":["2.3"],"const":["2.4","2.20","3.7"],"throttled":["2.4"],"args":["2.4","3.19"],"array":["2.5","2.24"],"window":["2.6"],"math":["2.7","2.38","4.12","6.43"],"floor":["2.7"],"4294967296":["2.7"],"true":["2.7","4.5","9.12"],"resolvepromise":["2.8"],"instanceof":["2.9"],"reason":["2.10"],"reject":["2.11","2.12"],"foreach":["2.11","2.14"],"p":["2.11","2.14","3.11"],"resolve":["2.12"],"then":["2.13"],"val":["2.13"],"push":["2.13","6.36","6.43"],"status":["2.13","2.39"],"length":["2.14"],"new":["2.15"],"模板字符串":["2.16"],"rejected":["2.17"],"只有所有值中均没有reject":["2.18"],"才会进入all的catch":["2.18"],"使用call":["2.19"],"暂时性死区":["2.20"],"不允许重复声明":["2.20"],"以及一些对象的引用变量":["2.21"],"固定大小":["2.21"],"线性结构":["2.21"],"执行函数同时才创建闭包":["2.22"],"js":["2.22","3.2","3.13","3.16","3.17","3.18","5.2","7.19"],"function":["2.22"],"不断遍历左边值的隐式属性":["2.23"],"proto":["2.23"],"obj":["2.24"],"arg":["2.24"],"prototype":["2.24"],"slice":["2.24"],"appendchild":["2.25"],"取得iframe对象的构造数组方法":["2.25"],"即原型":["2.27"],"任务队列":["2.28"],"task":["2.28"],"queue":["2.28"],"事件循环":["2.28"],"运行效率高":["2.29"],"所有图片":["2.30"],"解决跨域问题":["2.31"],"setattribute":["2.31"],"crossorigin":["2.31"],"anonymous":["2.31"],"imageurl":["2.31"],"src":["2.31"],"null和undefined会被转为字符串":["2.32"],"random":["2.33","2.34","6.43"],"tostring":["2.33"],"replace":["2.37"],"g":["2.37"],"cha":["2.38"],"percentage":["2.39"],"console":["2.39"],"log":["2.39"],"false":["2.39","2.43","4.5","6.43"],"responsetype":["2.39"],"onload":["2.39"],"clientwidth":["2.40"],"浏览器的宽度":["2.40"],"sw":["2.40"],"mousemove":["2.41"],"拖拽动画跟随鼠标":["2.41"],"改变margin值":["2.41"],"必须是调用自身":["2.42"],"真正的优化尾递归":["2.43"],"tco":["2.43"],"var":["2.43"],"value":["2.43"],"active":["2.43"],"charcodeat":["2.44"],"for":["2.45","8.1"],"let":["2.45","3.3","6.34"],"node":["2.46"],"shift":["2.46"],"容易":["3.1"],"提供更加安全的合作环境":["3.1"],"都为number或者都为string":["3.2"],"interface":["3.2"],"tuple":["3.3"],"dom":["3.3"],"div":["3.3"],"document":["3.3","7.21"],"createelement":["3.3"],"b":["3.3"],"typeof":["3.3"],"接口可以定义多次":["3.3"],"除了":["3.4"],"之外":["3.4"],"以下是常见泛型变量代表的意思":["3.4"],"k":["3.4","3.6","3.12","6.34"],"key":["3.4","6.31"],"表示对象中的键类型":["3.4"],"理论上是可以是任何类型的":["3.5"],"不同于":["3.5"],"any":["3.5","3.14","3.19"],"你不管使用它的什么属性或者方法都会报错":["3.5"],"除非这个属性和方法是所有集合共有的":["3.5"],"那么直观的想法是限定传给":["3.5"],"函数的":["3.5"],"要解决这个问题":["3.6"],"你可以使用以下非常暴力的方案":["3.6"],"as":["3.6"],"很明显该方案并不是一个好的方案":["3.6"],"我们来回顾一下":["3.6"],"函数的作用":["3.6"],"该函数用于获取某个对象中指定属性的属性值":["3.6"],"因此我们期望用户输入的属性是对象上已存在的属性":["3.6"],"那么如何限制属性名的范围呢":["3.6"],"这时我们可以利用本文的主角":["3.6"],"操作符":["3.6"],"extends":["3.6","3.12","3.19"],"在以上代码中":["3.6"],"age":["3.7"],"number":["3.7"],"musion":["3.7"],"newtestinterface":["3.8"],"只能处理第一层属性":["3.9"],"deeppartial":["3.9"],"其中":["3.10"],"是代表移除":["3.10"],"类型":["3.13","3.18"],"类型的所有属性":["3.17"],"来构造一个新的类型":["3.17"],"删除编译后的所有的注释":["3.20"],"noemit":["3.20"],"不生成输出文件":["3.20"],"importhelpers":["3.20"],"从":["3.20"],"tslib":["3.20"],"导入辅助工具函数":["3.20"],"isolatedmodules":["3.20"],"将每个文件做为单独的模块":["3.20"],"与":["3.20"],"transpilemodule":["3.20"],"类似":["3.20","9.5"],"严格的类型检查选项":["3.20"],"strict":["3.20"],"启用所有严格类型检查选项":["3.20"],"noimplicitany":["3.20"],"在表达式和声明上有隐含的":["3.20"],"any类型时报错":["3.20"],"strictnullchecks":["3.20"],"执行":["4.1","7.19"],"unpackage":["4.3"],"resources":["4.3"],"json的script中增加":["4.4"],"postinstall":["4.4"],"此语句可在其他协作者安装依赖时":["4.4"],"ws":["4.5"],"changeorigin":["4.5"],"org":["4.6"],"mirrors":["4.6"],"appendswitch":["4.7"],"zip":["4.8"],"platforms":["4.8"],"darwin":["4.8"],"directories":["4.10"],"output":["4.10"],"输出文件夹":["4.10"],"extraresources":["4.10"],"需要读写的配置文件":["4.10"],"from":["4.10"],"config":["4.10"],"icon":["4.10"],"xxx":["4.10"],"chunkfilename":["4.11"],"无需更新":["4.12"],"download":["4.12"],"progress":["4.12"],"prog":["4.12"],"webcontents":["4.12"],"speed":["4.12"],"ceil":["4.12"],"bytespersecond":["4.12"],"网速":["4.12"],"percent":["4.12"],"看看实际请求时间":["4.16"],"例如上图的写法":["4.17"],"在没有进行":["4.17"],"用户信息请求成功返回的情况下直接页面放行":["4.17"],"此时会让页面所有接口发送":["4.17"],"此时就会进入到上面所说的接口串行问题":["4.17"],"导致获取用户信息的接口排在后面":["4.17"],"configurewebpack":["4.18"],"plain":["4.19"],"运行npm":["4.20"],"打开settings":["4.21"],"逻辑层":["5.1"],"html":["5.2"],"wxml":["5.2"],"jscore":["5.3"],"开发成本就很高":["5.4"],"abstracthistory":["6.1"],"回调函数":["6.2"],"中获取更新后的新的内容":["6.2"],"diff算法":["6.2"],"在内存中构建虚拟dom树":["6.2"],"将内存中虚拟dom树渲染成真实dom结构":["6.2"],"数据改变的时候":["6.2"],"将之前的虚拟dom树结合新的数据生成新的虚拟dom树":["6.2"],"将此次生成好的虚拟dom树和上一次的虚拟dom树进行一次比对":["6.2"],"diff算法进行比对":["6.2"],"来更新只需要被替换的dom":["6.2"],"而不是全部重绘":["6.2"],"在diff算法中":["6.2"],"只平层的比较前后两棵dom树的节点":["6.2"],"没有进行深度的遍历":["6.2"],"会将对比出来的差异进行重新渲染":["6.2"],"dom结构发生改变":["6.2"],"手机的网页版":["6.3"],"商城等页面":["6.3"],"oa":["6.3"],"用新的dom树和旧的dom树对比":["6.5"],"中":["6.7"],"childten访问子组件":["6.8"],"parent访问组组件":["6.8"],"on":["6.8","9.21"],"传值组件":["6.8"],"虚拟dom比较算法依赖于单根节点的组件":["6.13"],"同步的意义在于每一个mutation执行完后都可以对应到一个新的状态":["6.14"],"vue3运用es6的proxy":["6.15"],"子mounted":["6.16"],"父mounted":["6.16"],"子更新过程":["6.16"],"设置中间状态":["6.17"],"for必须为item添加key":["6.17"],"同时避免使用v":["6.17"],"长列表性能优化":["6.17"],"不需要改变的数据":["6.17"],"使用object":["6.17"],"freeze冻结":["6.17"],"事件的销毁":["6.17"],"组件销毁时":["6.17"],"会自动清理和它和其他实例的链接":["6.17"],"绑它的全部指令及事件监听器":["6.17"],"abstract":["6.18"],"true会跳过该组件的实例":["6.18"],"生命周期定义了三个钩子函数":["6.18"],"created":["6.18"],"初始化两个对象分别缓存vnode":["6.18"],"虚拟dom":["6.18"],"settimeout":["6.19"],"可以让开发者在主事件循环中执行后台或低优先级的任务":["6.20"],"接着需要遍历树转化回代码":["6.21"],"提高编译速度":["6.21"],"缓存":["6.21"],"多线程":["6.21"],"抽离静态依赖":["6.21"],"递归遍历所有的入口文件":["6.22"],"compilation阶段":["6.22"],"依次进入其中每一个入口文件":["6.22"],"先使用用户配置好的loader对文件内容进行编译":["6.22"],"dce的特征":["6.23"],"一个文件可以使用多个loader":["6.24"],"br":["6.24","7.18"],"执行顺序和配置中的顺序相反":["6.24"],"css组件化":["6.25"],"包括可能在":["6.26"],"调用中请求的每个模块":["6.26"],"生命周期":["6.28"],"url":["6.28"],"为每个表单的item绑定独立的属性值":["6.30"],"cache":["6.31"],"keys":["6.31"],"vnode":["6.31"],"in":["6.31"],"cachednode":["6.31"],"之前默认从router":["6.31"],"view取储存key值":["6.31"],"现在改为路由name":["6.31"],"所以这里得改成当前key":["6.31"],"prunecacheentry":["6.31"],"current":["6.31"],"cached":["6.31"],"row":["6.33"],"处理交给":["6.34"],"使用者去处理":["6.34"],"事件时":["6.34"],"内部选中统计同时调用":["6.34"],"callback":["6.34"],"returns":["6.34"],"renderclear":["6.34"],"margin":["6.34","6.43"],"24px":["6.34"],"onclick":["6.34"],"renderalert":["6.34"],"绘制统计列数据":["6.34"],"needtotalitems":["6.34"],"span":["6.34"],"right":["6.34","8.1"],"12px":["6.34"],"title":["6.34","7.21","9.5"],"总计":["6.34"],"weight":["6.34"],"customrender":["6.34"],"绘制":["6.34"],"按钮":["6.34"],"clearitem":["6.34"],"组件":["6.34"],"showicon":["6.34"],"bottom":["6.34"],"16px":["6.34"],"template":["6.34"],"slot":["6.34"],"message":["6.34"],"已选择":["6.34"],"resizeabletitle":["6.34"],"h":["6.34"],"children":["6.34"],"restprops":["6.34"],"col":["6.34"],"selection":["6.34"],"支持复选框":["6.34"],"width":["6.34"],"find":["6.34"],"th":["6.34"],"showdropforwidth":["6.34"],"计算需要展开高度":["6.35"],"采用append":["6.35"],"dom元素的方式撑开高度":["6.35"],"直接修改高度":["6.35"],"但是当前行触发moursemove事件":["6.35"],"会触发dom":["6.35"],"hasattribute":["6.36"],"filter":["6.38"],"visible2":["6.39"],"danger":["6.39"],"先点击我":["6.39"],"应为body高度":["6.40"],"可某些环境下无法获取":["6.40"],"dragdomwidth":["6.40"],"offsetwidth":["6.40"],"对话框宽度":["6.40"],"dragdomheight":["6.40"],"offsetheight":["6.40"],"对话框高度":["6.40"],"mindragdomleft":["6.40"],"maxdragdomleft":["6.40"],"mindragdomtop":["6.40"],"maxdragdomtop":["6.40"],"footer":["6.41"],"会自动根据文件生成独立的样式名":["6.42"],"而对于嵌套的框架元素":["6.42"],"一般无法将类名直接赋予子元素":["6.42"],"解决方案":["6.42"],"exclude":["6.42"],"parseint":["6.43"],"data4":["6.43"],"option":["6.43"],"textstyle":["6.43"],"c9c9c9":["6.43"],"legend":["6.43"],"show":["6.43"],"grid":["6.43"],"xaxis":["6.43"],"category":["6.43"],"axisline":["6.43"],"splitline":["6.43"],"axistick":["6.43"],"splitarea":["6.43"],"axislabel":["6.43"],"interval":["6.43"],"align":["6.43"],"rotate":["6.43"],"fff":["6.43"],"fontsize":["6.43"],"lineheight":["6.43"],"yaxis":["6.43"],"el":["6.44"],"image的error函数接收两个参数":["6.44"],"会一直创建新画布":["6.45"],"独树一帜":["6.47"],"可以采取缩小地图宽高的方式":["6.48"],"就在任务队列中放置一个事件":["7.1"],"异步":["7.4"],"下载完毕后立即执行":["7.4"],"闭包使用不当引起内存泄漏":["7.6"],"递归":["7.7"],"只允许客户端缓存":["7.9"],"优先级高于expires":["7.9"],"last":["7.9"],"modify":["7.9","7.10"],"since":["7.9"],"都是用的gmt时间格式":["7.9"],"流程":["7.9"],"第一次请求时":["7.9"],"etag":["7.10"],"被阻塞":["7.12"],"比如nodejs用的内核libuv":["7.13"],"所以不管怎样":["7.13"],"线":["7.14"],"程最大的区别是":["7.14"],"进程占用单独的资源":["7.14"],"这样出来的都是宏任务":["7.15"],"比如mutationobserver":["7.16"],"观察的是dom":["7.16"],"dns解析非常耗时":["7.17"],"如果页面中需要解析的域名过多":["7.17"],"非常影响页面性能":["7.17"],"考虑使用dns预加载或减少dns解析":["7.17"],"取得ip地址后":["7.17"],"发起请求":["7.17"],"建立tcp连接":["7.17"],"网络协议":["7.17"],"会话结束自动删除":["7.18"],"设置了有效期则会存放在硬盘中":["7.18"],"有效期到了自动删除":["7.18"],"永久有效":["7.18"],"通知主线程更新页面中可见或即将变成可见的部分的位图":["7.19"],"计算出页面中哪部分是可见的":["7.19"],"计算出当你在滚动页面时哪部分是即将变成可见的":["7.19"],"当你滚动页面时将相应位置的元素移动到可视区域":["7.19"],"合成线程优点":["7.19"],"其工作无关主线程":["7.19"],"合成器线程不需要等待样式计算或者":["7.19"],"这就是为什么合成器相关的动画最流畅":["7.19"],"如果某个动画涉及到布局或者绘制的调整":["7.19"],"触发回流的操作":["7.19"],"就会涉及到主线程的重新计算":["7.19"],"自然会慢很多":["7.19"],"那么回到原来的问题":["7.19"],"为什么动画会卡顿":["7.19"],"那就是主线程和合成线程的调度不合理":["7.19"],"device":["7.21"],"initial":["7.21"],"scale":["7.21"],"代码工整很容易维护":["9.0"],"选中代码片段tab":["9.1"],"当存在多个三元不等式嵌套时":["9.3"],"一般要求换行":["9.3"],"uiuqwoeui":["9.3"],"必须在开头加":["9.4"],"推荐一行":["9.5"],"这样代码行数下去了":["9.5"],"阅读会方便很多":["9.5"],"columns":["9.5"],"bbb":["9.6"],"queryparam":["9.8"],"materialcode":["9.8"],"disabled":["9.8"],"allcleared":["9.8"],"readonly":["9.8"],"importexcel":["9.9"],"结尾元素必须加":["9.11"],"boolean":["9.12"],"required":["9.12"],"loading":["9.12"],"单独写watch监听":["9.14"],"在1中":["9.14"],"全局搜索也比较方便":["9.15"],"并且不存在事件出错的问题":["9.15"],"如下":["9.15"],"手动格式代码太过繁琐":["9.17"],"心智负担过重":["9.17"],"两种代码文件":["9.18"],"完成阶段":["9.18"],"在格式化某个":["9.19"],"从未格式化":["9.19"],"endofline":["9.20"],"lf":["9.20"],"eslintintegration":["9.20"],"htmlwhitespacesensitivity":["9.20"],"ignore":["9.20"],"ignorepath":["9.20"],"jsxbracketsameline":["9.20"],"reformat":["9.21"],"code":["9.21"],"action":["9.21"],"ctrl":["9.21"],"less":["9.22"]},{"0":["2.25","7.19","8.1"],"1":["0.13","0.26","1.16","2.24"],"2":["0.17","2.28","6.13"],"3":["0.40","2.41","4.3","4.4","4.21","9.6"],"4":["0.33","0.41","1.10","3.3","4.3","9.17","9.18"],"6":["2.36","9.21"],"7":["9.21"],"9":["4.9"],"10":["0.26","9.3"],"15":["4.3"],"16":["2.33"],"20":["9.3"],"21":["6.35"],"35":["3.7"],"40":["6.43"],"50":["6.43"],"58":["2.44"],"64":["6.41"],"100":["0.29"],"123":["7.21","9.8"],"189":["1.18"],"200":["1.1"],"406":["1.13"],"408":["1.13"],"409":["1.13"],"1080":["2.40"],"1231":["9.8"],"81354":["4.3"],"9999999":["6.34"],"selectors":["0.2"],"css":["0.2","0.11","4.11"],"container":["0.2"],"border":["0.2","0.41"],"这是最常见的用法":["0.3"],"类选择器可以定义多个元素":["0.4"],"当你想定义一组元素的样式时可以使用":["0.4"],"a":["0.5"],"b":["0.5"],"class":["0.6"],"呢":["0.6"],"另外还有":["0.7"],"选中紧接在另一个元素后的元素":["0.8"],"external":["0.11"],"click":["0.11","9.8"],"me":["0.11"],"fool":["0.11"],"使用上面的代码":["0.11"],"现在我们可以用波浪号的技巧来定义包含其中一个值的元素":["0.11"],"target":["0.11","4.10","6.34","6.41"],"inline":["0.13"],"这个例子利用":["0.13"],"action":["0.14"],"div":["0.15","6.34","7.21"],"weight":["0.16"],"bold":["0.16"],"family":["0.16"],"cursive":["0.16"],"padding":["0.16","6.35","6.42"],"我们甚至可以使用这种方法来选择一系列的子元素":["0.17"],"元素的类型":["0.19"],"n":["0.20"],"常常用于去掉第一个或最后一个元素的边框":["0.21"],"选择该类型的第一个元素":["0.25"],"0px":["0.26"],"parsefloat":["0.26"],"px":["0.26","6.34"],"element":["0.26","3.4"],"子代继承":["0.27"],"不继承":["0.27"],"继承":["0.27"],"visibility":["0.28"],"否":["0.28"],"移动元素":["0.28"],"18px":["0.29","7.19"],"方便计算几行":["0.29"],"font":["0.29"],"size":["0.29"],"12px":["0.29"],"三个元素都设置float":["0.29"],"float":["0.29"],"right":["0.29"],"margin":["0.29","0.35","7.19"],"left":["0.29","7.19"],"50px":["0.29","6.34"],"这是第一个元素":["0.29"],"由于他宽度是100":["0.29"],"所以需要给standard位置":["0.29"],"position":["0.29","6.34","6.43"],"baseline":["0.30"],"stretch":["0.30"],"默认值":["0.30"],"定义了多根轴线的对齐方式":["0.30"],"如果只有一根轴线":["0.30"],"该属性不起作用":["0.30"],"function":["0.32","1.10"],"delay":["0.32"],"fff":["0.33"],"000":["0.33"],"有虚化":["0.33"],"box":["0.33"],"shadow":["0.33"],"table":["0.34"],"cells":["0.34"],"flex":["0.34"],"操作已有元素":["0.36"],"文档流":["0.37"],"正常文档流":["0.37"],"脱离文档流":["0.37"],"区域":["0.38"],"vw":["0.39"],"vh":["0.39"],"radius不支持的问题":["0.41"],"可以考虑用图层遮盖的方式遮盖以达到圆的目的":["0.41"],"状态行":["1.1"],"表示执行相同的操作":["1.2"],"结果也是相同的":["1.2"],"tcp":["1.2","7.17"],"如果服务器支持":["1.3"],"则在第二次中发送真正的请求":["1.3"],"作用2":["1.3"],"浏览器当前设置的语言":["1.5"],"connection":["1.5","1.18"],"浏览器与服务器之间连接的类型":["1.5","1.6"],"cookie":["1.5"],"cache":["1.6","4.20"],"val1":["1.7"],"key2":["1.7"],"val2":["1.7"],"的方式进行编码":["1.7"],"key":["1.7","2.1","2.6","2.7","6.7"],"和":["1.7"],"val":["1.7","2.11","2.14"],"都进行了":["1.7"],"若网站在一定时间内一直处于304的状态":["1.8"],"那么蜘蛛可能会降低对网站的抓取次数":["1.8"],"相反":["1.8"],"若网站变化的频率非常之快":["1.8"],"options":["1.9"],"浏览器自动执行":["1.9"],"询问支持的请求方法":["1.9"],"用来跨域请求":["1.9"],"预检请求":["1.9"],"if":["1.10","2.4","2.13","2.46"],"readystate":["1.10"],"by":["1.11"],"the":["1.11"],"传递一个":["1.11"],"executor":["1.11"],"函数到":["1.11"],"的构造函数来创建":["1.11"],"必须跟":["1.12"],"表示登录主机时的用户信息":["1.12"],"method":["1.13"],"allowed":["1.13"],"该请求方法不允许":["1.13"],"acceptable":["1.13"],"资源无法满足客户端条件":["1.13"],"timeout":["1.13"],"服务器等待超时":["1.13"],"conflict":["1.13"],"可靠传输":["1.14"],"基于tcp":["1.14"],"ip":["1.14"],"请求":["1.14"],"而是文本形式":["1.15"],"对头阻塞问题":["1.15"],"当http开启长连接时":["1.15"],"pdf":["1.16"],"octet":["1.16"],"stream":["1.16"],"压缩方式":["1.16"],"分块传输":["1.17"],"设置该字段后":["1.17"],"content":["1.17","1.19","6.28"],"type":["1.18","3.13","3.17","3.18"],"multipart":["1.18"],"byteranges":["1.18"],"boundary":["1.18"],"00000010101":["1.18"],"keep":["1.18"],"分隔的键值对":["1.19"],"type字段会包含boundary且该":["1.19"],"域名分片":["1.20"],"br":["1.21"],"服务端将ca证书私钥绿加密服务器公钥蓝":["1.22"],"客户端ca证书公钥黄解密ca证书私钥绿得到服务器公钥蓝":["1.22"],"k":["1.23"],"称为一个数据流":["1.24"],"每个数据流都有一个独一无二的编号":["1.24"],"数据包发送时":["1.24"],"都必须标记数据流":["1.24"],"id":["1.24","3.6","6.34","7.21"],"用来区分它属于哪个数据流":["1.24"],"头信息压缩":["1.24"],"实现了头信息压缩":["1.24"],"由于":["1.24"],"协议不带状态":["1.24"],"has方法":["2.1"],"没有size":["2.1"],"不可遍历":["2.1"],"map":["2.1","6.43"],"类似对象":["2.1"],"键名接受各种类型的值":["2.1"],"每一个双元素的数组的数据结构都可以作为参数":["2.1"],"set和map都可以生成新的map":["2.1"],"map的键是和内存地址绑定的":["2.1"],"解决了同名属性碰撞问题":["2.1"],"返回成员":["2.1"],"测试数组中的每个值":["2.2"],"返回一个布尔值":["2.2"],"apply":["2.3","2.19"],"this":["2.3","2.7","2.31","3.20"],"now":["2.4"],"for":["2.5"],"i":["2.5","2.14","8.1"],"in":["2.5","3.11"],"object":["2.6","3.9","6.15"],"const":["2.6","2.7"],"false":["2.7","9.12"],"new":["2.7","2.10","4.18"],"symbol":["2.7"],"let":["2.7","6.40"],"push":["2.8","2.43"],"error":["2.8"],"return":["2.9","6.43"],"then":["2.11","2.14"],"foreach":["2.12"],"p":["2.12","7.21"],"fulfilled":["2.13"],"value":["2.13","3.4","6.43"],"length":["2.13"],"resolve":["2.15"],"reject":["2.15"],"字面量增强":["2.16"],"对象属性增强":["2.16"],"状态改变后不可逆":["2.17"],"race":["2.18"],"和all相似":["2.18"],"bind对this没影响":["2.19"],"只在命令所在的代码块有效":["2.20"],"后进先出":["2.21"],"读取速度快":["2.21"],"堆":["2.21"],"test":["2.22","7.21"],"var":["2.22"],"sum":["2.22"],"判断其是否等于右边值的":["2.23"],"call":["2.24"],"arguments":["2.24","2.43"],"xarray":["2.25"],"window":["2.25"],"frames":["2.25"],"arr":["2.25"],"原型拥有自己的原型":["2.27"],"proto":["2.27"],"其不断指向其最上层原型":["2.27"],"所有同步任务在主线程执行":["2.28"],"形成一个执行栈":["2.28"],"主线程外存在一个任务队列":["2.28"],"异步任务有了结果":["2.28"],"不用检查任务队列":["2.29"],"脚本":["2.30"],"链接以及子框都完成了装载":["2.30"],"that":["2.31"],"onload为异步加载":["2.31"],"canvas":["2.31"],"document":["2.31","6.34"],"createelement":["2.31","6.34"],"生成ffffff以内的16进制数":["2.33"],"while":["2.33"],"kw":["2.37"],"parseint":["2.37"],"tostring":["2.37"],"floor":["2.38"],"random":["2.38"],"response":["2.39"],"send":["2.39"],"下载文件":["2.39"],"url":["2.39"],"extensionname":["2.39"],"xlsx":["2.39"],"sh":["2.40"],"transition":["2.40"],"all":["2.40","4.9"],"注意":["2.42","9.21"],"只有不再用到外层函数的内部变量":["2.42"],"accumulated":["2.43"],"accumulator":["2.43"],"true":["2.43","6.31","6.43"],"else":["2.44"],"child":["2.45"],"of":["2.45"],"console":["2.46"],"log":["2.46"],"name":["2.46","6.43"],"劣势":["3.1"],"学习成本":["3.1"],"number":["3.2","6.31","6.40"],"类型别名不可以":["3.3"],"cosnt":["3.3"],"poing":["3.3"],"两者的扩展方式不同":["3.3"],"v":["3.4"],"表示对象中的值类型":["3.4"],"e":["3.4"],"表示元素类型":["3.4"],"举例":["3.4"],"参数类型":["3.5"],"应该有":["3.5"],"类型":["3.5"],"这样就不会报错了":["3.5"],"如何去表达这个":["3.5"],"类型约束":["3.5"],"的点呢":["3.5"],"实现这个需求的关键在于使用类型约束":["3.5"],"我们使用了":["3.6"],"的泛型和泛型约束":["3.6"],"首先定义了":["3.6"],"类型并使用":["3.6"],"关键字约束该类型必须是":["3.6"],"类型的子类型":["3.6"],"然后使用":["3.6"],"操作符获取":["3.6"],"类型的所有键":["3.6"],"其返回类型是联合类型":["3.6"],"最后利用":["3.6"],"关键字约束":["3.6"],"类型必须为":["3.6"],"联合类型的子类型":["3.6"],"是骡子是马拉出来遛遛就知道了":["3.6"],"我们来实际测试一下":["3.6"],"todo":["3.6"],"text":["3.6"],"done":["3.6"],"boolean":["3.6"],"learn":["3.6"],"gender":["3.7"],"加上只读":["3.8"],"如果是":["3.9"],"则递归类型":["3.9"],"u":["3.9"],"这个":["3.10"],"modifier":["3.10"],"的标识":["3.10"],"再拓展一下":["3.10"],"keyof":["3.11","3.12"],"启用严格的":["3.20"],"null":["3.20"],"检查":["3.20"],"noimplicitthis":["3.20"],"当":["3.20"],"表达式值为":["3.20"],"any":["3.20"],"类型的时候":["3.20"],"生成一个错误":["3.20"],"alwaysstrict":["3.20"],"以严格模式检查每个模块":["3.20"],"并在每个文件里加入":["3.20"],"use":["3.20"],"额外的检查":["3.20"],"nounusedlocals":["3.20"],"有未使用的变量时":["3.20"],"抛出错误":["3.20"],"nounusedparameters":["3.20"],"有未使用的参数时":["3.20"],"noimplicitreturns":["3.20"],"remotesigned":["4.1"],"来取消限制":["4.1"],"rimraf":["4.2"],"android":["4.3"],"sdk":["4.3"],"自动应用patch":["4.4"],"package的修改":["4.4"],"修改node":["4.4"],"modules中需要修改的包并记下包名":["4.4"],"loglevel":["4.5"],"debug":["4.5"],"pathrewrite":["4.5"],"router":["4.5"],"yarn":["4.6"],"ignore":["4.7"],"certificate":["4.7"],"deb":["4.8"],"arch":["4.9","4.10"],"x64":["4.9"],"ico":["4.10"],"图标路径":["4.10"],"nsis":["4.10"],"dmg":["4.10"],"contents":["4.10"],"x":["4.10","4.19","6.34","6.43"],"y":["4.10","6.43"],"path":["4.10"],"application":["4.10"],"extract":["4.11"],"百分比":["4.12"],"downloaded":["4.12"],"下载完成后强制用户安装":["4.12"],"不推荐":["4.12"],"module":["4.12"],"然后单独发这个请求":["4.16"],"等待了别的接口完成":["4.17"],"正确的路由鉴权写法应该是":["4.17"],"plugins":["4.18"],"filename":["4.18"],"xml":["4.19"],"clean":["4.20"],"force":["4.20"],"增加配置":["4.21"],"jscore":["5.1"],"wxss":["5.2"],"开发成本":["5.2"],"兼容性":["5.2"],"视图层渲染":["5.3"],"基于mobile":["5.3"],"这时候只需要编写一套代码就能够适配多端的能力就显得极为需要":["5.4"],"前进":["6.1"],"history":["6.1"],"pushstate":["6.1"],"replacestate":["6.1"],"hash":["6.1"],"location":["6.1"],"直接卸载并重新create":["6.2"],"dom结构一样":["6.2"],"不会卸载":["6.2"],"但是会update变化的内容":["6.2"],"所有同一层级的子节点":["6.2"],"他们都可以通过key来区分":["6.2"],"同时遵循1":["6.2"],"2两点":["6.2"],"其实这个key的存在与否只会影响diff算法的复杂度":["6.2"],"换言之":["6.2"],"你不加key的情况下":["6.2"],"diff算法就会以暴力的方式去根据一二的策略更新":["6.2"],"但是你加了key":["6.2"],"diff算法会引入一些另外的操作":["6.2"],"性能":["6.2"],"由于数据都有跟踪":["6.2"],"不需要手动优化":["6.2"],"但数据量大后":["6.2"],"过多的watcher会引起页面卡顿":["6.2"],"大批量的数据展示":["6.3"],"适合做大型应用":["6.3"],"特别适合公司的后台操作系统":["6.3"],"记录树的差异":["6.5"],"将差异应用到真正dom树上":["6.5"],"emit触发方法":["6.8"],"接收值组件":["6.8"],"on监听方法":["6.8"],"attrs":["6.8"],"listeners":["6.8"],"attrs继承所有的父组件属性":["6.8"],"除了prop传递的属性":["6.8"],"class和style":["6.8"],"定时器":["6.11"],"defineproperty一次性只能给对象的一个属性添加get":["6.15"],"父beforeupdate":["6.16"],"子beforeupdate":["6.16"],"子updated":["6.16"],"父updated":["6.16"],"但是仅限于组件本身的事件":["6.17"],"如果在":["6.17"],"js":["6.17","9.15"],"内使用":["6.17"],"addeventlistene":["6.17"],"等方式是不会自动销毁的":["6.17"],"我们需要在组件销毁时手动移除这些事件的监听":["6.17"],"以免造成内存泄露":["6.17"],"图片资源懒加载":["6.17"],"路由懒加载":["6.17"],"第三方插件按需引入":["6.17"],"优化无限列表性能":["6.17"],"如果你的应用存在非常长或者无限滚动的列表":["6.17"],"和vnode对应的键集合":["6.18"],"destoryed":["6.18"],"删除this":["6.18"],"cache中缓存的vnode实例":["6.18"],"调用prunecacheentry":["6.18"],"mounted":["6.18"],"对include和exclude监听":["6.18"],"setinterval":["6.19"],"而且不会对像动画和用户交互这些延迟触发但关键的事件产生影响":["6.20"],"webpack":["6.21"],"dll":["6.21"],"externals":["6.21"],"可以从传入事件回调的compilation拿到module的resource":["6.22"],"资源路径":["6.22"],"loaders等信息":["6.22"],"之后再将编译好的文件使用acorn解析生成ast静态语法书":["6.22"],"分析文件的依赖关系逐个拉取依赖模块并重复上述过程":["6.22"],"代码不会被执行":["6.23"],"永不到达":["6.23"],"第一个执行的loader接收源文件作为参数":["6.24"],"其他loader接收前一个执行的loader的返回值作为参数":["6.24"],"最后执行的loader会返回此模块的js源码":["6.24"],"可以使用css":["6.25"],"locale":["6.26"],"language":["6.26"],"json":["6.26"],"会把":["6.26"],"目录中的每个":["6.26"],"is":["6.27"],"框架":["6.28"],"讲表单抽象封装":["6.30"],"引入创建的方式":["6.30"],"componentinstance":["6.31"],"destroy":["6.31"],"patterntypes":["6.31"],"default":["6.31","9.12"],"abstract":["6.31"],"props":["6.31"],"include":["6.31"],"exclude":["6.31"],"max":["6.31","6.34"],"created":["6.31"],"create":["6.31"],"destroyed":["6.31"],"的":["6.33","6.35"],"body":["6.34","6.42"],"getelementbyid":["6.34"],"appendchild":["6.34"],"anttable":["6.34"],"parentnode":["6.34"],"getboundingclientrect":["6.34","6.41"],"innertext":["6.34"],"csstext":["6.34"],"absolute":["6.34"],"z":["6.34"],"index":["6.34","6.43"],"display":["6.34"],"block":["6.34"],"height":["6.34"],"top":["6.34","6.40","6.41","6.42"],"1px":["6.34"],"background":["6.34"],"409eff":["6.34"],"cursor":["6.34"],"resize":["6.34"],"userselect":["6.34"],"none":["6.34","9.20"],"onmousemove":["6.34"],"onmouseup":["6.34"],"math":["6.34"],"stoppropagation":["6.34"],"showdropforcol":["6.34"],"fixed":["6.34"],"tagname":["6.34"],"svg":["6.34"],"重置":["6.35"],"是td":["6.35"],"值":["6.35"],"加":["6.35"],"sign":["6.36"],"prop":["6.38"],"primary":["6.39"],"测试3":["6.39"],"获取到的值带px":["6.40"],"正则匹配替换":["6.40"],"styl":["6.40"],"styt":["6.40"],"注意在ie中":["6.40"],"第一次获取到的值为组件自带50":["6.40"],"移动之后赋值为px":["6.40"],"includes":["6.40"],"eslint":["6.40"],"disable":["6.40"],"next":["6.40"],"line":["6.40"],"no":["6.40"],"useless":["6.40"],"escape":["6.40"],"ant":["6.42"],"card":["6.42"],"series":["6.43"],"bar":["6.43"],"itemstyle":["6.43"],"normal":["6.43"],"x2":["6.43"],"y2":["6.43"],"linear":["6.43"],"global":["6.43"],"colorstops":["6.43"],"stack":["6.43"],"zs":["6.43"],"barmaxwidth":["6.43"],"auto":["6.43"],"barwidth":["6.43"],"label":["6.43"],"white":["6.43"],"第一个为":["6.44"],"请求出错的路径":["6.44"],"文档差":["6.45"],"技术落后":["6.45"],"傻逼":["6.47"],"有肉眼可见的性能提升":["6.48"],"执行栈中的任务执行完成后":["7.1"],"系统会读取任务队列中的事件":["7.1"],"根据事件读取对应的异步任务":["7.1"],"为了保证任务有优先级":["7.2"],"不会按照页面上的script顺序执行":["7.4"],"async":["7.4"],"全局变量":["7.6"],"分离的dom节点":["7.6"],"递归清除定时器":["7.7"],"在response":["7.9"],"header中返回last":["7.9"],"表示最有一次修改时间":["7.9"],"下次请求是request":["7.9"],"header中包含if":["7.9"],"去询问服务器是不是还是上次那个最后修改时间":["7.9"],"如果还是上次一样的事件":["7.9"],"说明数据没有更新":["7.9"],"地址栏回车":["7.10"],"页面链接跳转":["7.10"],"所以定时器被设计在另一个进程中被管理":["7.12"],"所以":["7.12","7.16"],"事件的独立注册表和派发机制导致":["7.13"],"他也不会和js存在一个进程中":["7.13"],"即不会共享cpu和内存":["7.14"],"而线程往下":["7.14"],"都是共享cpu和内存的":["7.14"],"它的作用即是对dom的变化做出响应":["7.16"],"应用层":["7.17"],"dns":["7.17"],"http":["7.17"],"dns解析ip并发送http请求":["7.17"],"传输层":["7.17"],"udp":["7.17"],"需要手动删除":["7.18"],"会话结束自动清除":["7.18"],"生成方式":["7.18"],"服务器生成":["7.18"],"前端生成":["7.18"],"举个例子":["7.19"],"使用height":["7.19"],"width":["7.19","9.5"],"padding作为transition的值时":["7.19"],"会造成浏览器主线程的工作量较重":["7.19"],"例如从margin":["7.19"],"20px渲染到margin":["7.19"],"主线程需要计算样式margin":["7.19"],"19px":["7.19"],"一直到margin":["7.19"],"不容易出bug":["9.0"],"出bug也容易找":["9.0"],"或者shift":["9.1"],"序号":["9.5"],"scopedslots":["9.5"],"customrender":["9.5"],"serial":["9.5"],"align":["9.5"],"center":["9.5"],"blur":["9.8"],"from":["9.9"],"api":["9.9"],"statementcentre":["9.9"],"electricalstatement":["9.9"],"若没有代码处理的函数":["9.14"],"就手动删除":["9.14"],"保持代码工整":["9.14"],"bus":["9.15"],"emit":["9.15"],"当前项目为多人开发":["9.17"],"项目中所有代码文件格式统一":["9.18"],"进阶阶段":["9.18"],"过的代码文件前":["9.19"],"先咨询组内成员该文件是否有人正在更新":["9.19"],"jsxsinglequote":["9.20"],"requireconfig":["9.20"],"stylelintintegration":["9.20"],"trailingcomma":["9.20"],"tslintintegration":["9.20"],"添加忽略文件":["9.20"],"alt":["9.21"],"l":["9.21"],"过渡阶段不要选中run":["9.21"],"save":["9.21"],"scss":["9.22"]},{"0":["0.29","1.10","2.22","2.37","2.40","6.35","6.41"],"1":["1.10","2.7","2.25"],"2":["1.7","1.16","2.25","2.36","4.9","4.12","6.5","6.23","7.2"],"3":["2.25","2.28","4.1","6.30","7.14","7.16"],"4":["0.35","0.40","4.4","9.14"],"5":["0.29","0.39"],"6":["2.33"],"8":["9.21"],"10":["2.44","6.34"],"16":["2.37"],"20":["7.19"],"21":["6.34"],"25":["6.41"],"26":["4.9"],"30":["9.3"],"35":["6.34"],"41":["6.34"],"50":["9.5"],"54":["6.43"],"55":["6.41"],"65":["2.44"],"72":["6.43"],"75":["0.29"],"96":["1.18"],"100":["6.34","6.40"],"114":["6.43"],"229":["0.29"],"234":["7.21"],"413":["1.13"],"414":["1.13"],"429":["1.13"],"12345":["1.11"],"20220613":["4.3"],"1px":["0.2"],"solid":["0.2"],"black":["0.2"],"但使用":["0.3"],"选择器":["0.4"],"另外":["0.4"],"error":["0.5"],"这样就错了":["0.5"],"可以简单地使用元素选择器":["0.6"],"比如选择所有的无序列表":["0.6"],"伪类可以让我们给":["0.7"],"曾经":["0.7"],"attr":["0.11"],"that":["0.11"],"contains":["0.11"],"the":["0.11"],"value":["0.11"],"的元素":["0.12"],"在元素后面添加间隔和清除浮动的元素":["0.13"],"这是你值得拥有的高级技巧":["0.13"],"尤其是当":["0.13"],"overflow":["0.13","0.34"],"pseudo":["0.14"],"color":["0.15","0.29"],"blue":["0.15"],"不建议":["0.15"],"right":["0.16","6.37"],"2px":["0.16","6.34"],"匹配段落的第一行":["0.16"],"比如":["0.17","1.24"],"最后选择器":["0.18"],"来选择":["0.19"],"倒数选择器":["0.20"],"start":["0.26"],"function":["0.26","1.11","4.5"],"step":["0.26"],"timestamp":["0.26"],"undefined":["0.26"],"elapsed":["0.26"],"子代反继承":["0.27"],"能":["0.27"],"transition":["0.27"],"style":["0.28","6.41"],"relative":["0.29"],"background":["0.29"],"hsla":["0.29"],"宽度随意":["0.29"],"需要与上面margin":["0.29"],"left一样":["0.29"],"超出这个高度会出现more元素":["0.29"],"子项":["0.30"],"order":["0.30"],"排序":["0.30"],"数值越小":["0.30"],"排名越前":["0.30"],"默认值0":["0.30"],"grow":["0.30"],"放大比例":["0.30"],"shrink":["0.30"],"缩小比例":["0.30"],"默认值1":["0.30"],"负值无效":["0.30"],"旋转":["0.32"],"svg":["0.33"],"ua":["0.33"],"方法":["0.33"],"设置0":["0.33"],"除了visible外的值":["0.34"],"bfc常用作用":["0.34"],"auto":["0.35"],"如何使用":["0.36"],"单冒号":["0.36"],"根据父元素而定":["0.37"],"定位":["0.37"],"除了margin":["0.38"],"都计算在宽高":["0.38"],"flex":["0.39","0.40"],"navigator":["0.41"],"target":["0.41"],"name":["0.41"],"ok":["1.1"],"状态码":["1.1"],"原因":["1.1"],"响应头":["1.1"],"会将请求报文一次性发出去":["1.2"],"分为两个tcp数据包":["1.2"],"先发header部分":["1.2"],"检测服务器是否为同源请求":["1.3"],"是否支持跨域":["1.3"],"当前页面设置的任何cookie":["1.5"],"host":["1.5"],"发出请求的页面所在的域":["1.5"],"control":["1.6"],"控制http缓存":["1.6"],"url转码":["1.7"],"multipart":["1.7"],"data":["1.7"],"该种方式也是一个常见的":["1.7"],"post":["1.7"],"每次抓取都能获取新内容":["1.8"],"那么日积月累":["1.8"],"的回访率也会提高":["1.8"],"产生较多304状态码的原因":["1.8"],"判断目标是否安全":["1.9"],"connect":["1.9"],"要求在与代理服务器通信时建立":["1.9"],"管道":["1.9"],"使用":["1.9","3.5"],"responsetext":["1.10"],"xmlhttprequest对象的状态码":["1.10"],"请求未建立":["1.10"],"创建了xhr对象":["1.10"],"但是还没调用open":["1.10"],"let":["1.11","2.46"],"c":["1.11"],"port":["1.12"],"主机名和端口号":["1.12"],"请求冲突":["1.13"],"entity":["1.13"],"too":["1.13"],"large":["1.13"],"请求体数据过大":["1.13"],"resuest":["1.13"],"uri":["1.13"],"long":["1.13"],"请求行里的uri太大":["1.13"],"应答":["1.14"],"一发一收":["1.14"],"有来有回":["1.14"],"公用一个tcp连接":["1.15"],"同一时刻只能处理一个请求":["1.15"],"encoding字段":["1.16"],"gzip":["1.16"],"当今最流行的压缩格式":["1.16"],"deflate":["1.16"],"br":["1.16","5.2"],"length字段会被忽略":["1.17"],"基于长连接持续推送动态内容":["1.17"],"connection":["1.17"],"alive":["1.18"],"text":["1.18","6.34"],"plain":["1.18","9.20"],"值由浏览器默认制定":["1.19"],"字符以url编码方式编码":["1.19"],"客户端私钥":["1.22"],"客户端生成一个私钥":["1.22"],"防止因网络问题导致报文失效而引起过时连接":["1.23"],"每次请求都必须附上所有信息":["1.24"],"所以":["1.24"],"请求的很多字段都是重复的":["1.24"],"cookie":["1.24"],"user":["1.24"],"agent":["1.24"],"一模一样的内容":["1.24"],"每次请求都必须附带":["1.24"],"这会浪费很多带宽":["1.24"],"也影响速度":["1.24"],"对这一点做了优化":["1.24"],"引入了头信息压缩机制":["1.24"],"设置新成员":["2.1"],"get":["2.1"],"获取键值":["2.1"],"flat":["2.2"],"拉平数组":["2.2"],"settimeout":["2.3","6.34"],"apply":["2.4","2.43"],"this":["2.4","2.43"],"item":["2.5"],"itemtype":["2.5"],"new":["2.6","2.9","2.25"],"symbol":["2.6"],"args":["2.7"],"argements":["2.7"],"result":["2.7"],"array":["2.7"],"isarray":["2.7"],"return":["2.8","2.22","2.44"],"relovepromise":["2.8"],"typeerror":["2.8"],"chaining":["2.8"],"cycle":["2.8"],"detected":["2.8"],"resolve":["2.10","4.5"],"if":["2.11","6.36"],"then":["2.12"],"val":["2.12","6.31"],"err":["2.13","2.14"],"modules":["2.16"],"class":["2.16"],"可链式调用":["2.17"],"没有prototype":["2.19"],"不能使用yield关键字":["2.19"],"只读":["2.20"],"heap":["2.21"],"大小不固定":["2.21"],"不会自动释放":["2.21"],"直至等于":["2.23"],"constructor":["2.24"],"ret":["2.24"],"直至null":["2.27"],"形成一个链":["2.27"],"成为原型链":["2.27"],"就在任务队列中放置一个事件":["2.28"],"执行栈中的任务执行完成后":["2.28"],"系统会读取任务队列中的事件":["2.28"],"根据事件读取对应的异步任务":["2.28"],"setimmedidate":["2.29"],"domcontentloaded":["2.30"],"width":["2.31"],"height":["2.31","6.35"],"context":["2.31"],"getcontext":["2.31"],"2d":["2.31"],"length":["2.33","2.37","2.43"],"push":["2.36","8.1"],"eval":["2.36"],"u":["2.38","3.4"],"tostring":["2.38"],"type":["2.39","3.7"],"application":["2.39"],"zip":["2.39"],"vnd":["2.39"],"openxmlformats":["2.39"],"officedocument":["2.39"],"spreadsheetml":["2.39"],"sheet":["2.39"],"ms":["2.39"],"excel":["2.39"],"pdf":["2.39"],"5s":["2.40"],"transformorigin":["2.40"],"left":["2.40"],"top":["2.40"],"mouseup":["2.41"],"结束拖拽":["2.41"],"内层函数的调用帧才会取代外层函数的调用帧":["2.42"],"否则就无法进行":["2.42"],"shift":["2.43"],"0xdf":["2.44"],"children":["2.46","6.38"],"for":["2.46"],"需要编译":["3.1"],"但互不排斥":["3.3"],"可以互相扩展":["3.3"],"tip":["3.3"],"扩展":["3.3"],"接口的扩展就是继承":["3.3"],"通过extends来实现":["3.3"],"类型别名的扩展就是交叉类型":["3.3"],"通过":["3.3"],"来实现":["3.3"],"接口的扩展":["3.3"],"pointx":["3.3"],"extends":["3.3","3.5","3.9","3.15","3.16"],"关键字可以做到这一点":["3.5"],"简单来说就是你定义一个类型":["3.5"],"然后让":["3.5"],"实现这个接口即可":["3.5"],"interface":["3.5"],"false":["3.6","4.10","6.39"],"很明显使用泛型":["3.6"],"重新定义后的":["3.6"],"报错":["3.7"],"argument":["3.7"],"of":["3.7"],"is":["3.7"],"not":["3.7"],"assignable":["3.7"],"readonly":["3.8"],"除了可以应用于":["3.10"],"modifiers":["3.10"],"p":["3.12"],"in":["3.12"],"infer":["3.14","3.19"],"extendsnull":["3.18"],"并不是所有函数里的代码都有返回值时":["3.20"],"nofallthroughcasesinswitch":["3.20"],"switch":["3.20"],"语句的":["3.20"],"fallthrough":["3.20"],"错误":["3.20"],"即":["3.20"],"不允许":["3.20"],"的":["3.20"],"case":["3.20"],"语句贯穿":["3.20"],"模块解析选项":["3.20"],"moduleresolution":["3.20"],"node":["3.20","4.2"],"选择模块解析策略":["3.20"],"classic":["3.20"],"typescript":["3.20","9.22"],"pre":["3.20"],"再执行":["4.1"],"geesunwms":["4.3"],"dev":["4.3"],"simpledemo":["4.3"],"src":["4.3"],"npx":["4.4"],"包名":["4.4"],"delete":["4.5"],"require":["4.5","6.22"],"cache":["4.5"],"errors":["4.7"],"rpm":["4.8"],"如果更换图标发现打包后没有生效":["4.8"],"有缓存":["4.8"],"version":["4.9"],"oneclick":["4.10"],"一键安装":["4.10"],"guid":["4.10"],"注册表名字":["4.10"],"不推荐修改":["4.10"],"permachine":["4.10"],"true":["4.10"],"是否开启安装时权限限制":["4.10"],"此电脑或当前用户":["4.10"],"exports":["4.12"],"在main":["4.12"],"js引入":["4.12"],"createwindow":["4.12"],"看看这个时间差":["4.16"],"dist":["4.18"],"rss":["4.19"],"yarn":["4.20"],"js":["4.21"],"gutterpreview":["4.21"],"视图层和逻辑层通过系统层的":["5.1"],"weixinjsbridge":["5.1"],"开发工具":["5.2"],"框架ui等":["5.2"],"chromium的xweb":["5.3"],"wkwebview":["5.3"],"编译实现跨端":["5.4"],"replace":["6.1","6.40"],"由于状态改变会引起组件全部重新渲染":["6.2"],"需要手动优化":["6.2"],"服务端渲染":["6.2"],"nuxt":["6.2"],"next":["6.2"],"生命周期":["6.2"],"beforecreate":["6.2"],"created":["6.2"],"beforemount":["6.2"],"mounted":["6.2","6.31"],"beforeupdate":["6.2"],"updated":["6.2"],"beforedestory":["6.2"],"要求高":["6.3"],"加载速度":["6.3"],"包小":["6.3"],"的作用":["6.7"],"它是一个对象":["6.8"],"包含了父作用域中的v":["6.8"],"on事件监听器":["6.8"],"可以配合v":["6.8"],"将所有的事件监听器指向这个组件的某个特定的子元素":["6.8"],"带有render函数的函数式组件":["6.13"],"set方法":["6.15"],"父更新过程":["6.16"],"那么需要采用":["6.17"],"窗口化":["6.17"],"的技术来优化性能":["6.17"],"只需要渲染少部分区域的内容":["6.17"],"减少重新渲染组件和创建":["6.17"],"dom":["6.17"],"节点的时间":["6.17"],"你可以参考以下开源项目":["6.17"],"vue":["6.17","7.21","9.20"],"virtual":["6.17"],"scroll":["6.17"],"list":["6.17"],"和":["6.17"],"然后实施更新this":["6.18"],"cache对象的数据":["6.18"],"render":["6.18","6.31"],"获取keep":["6.18"],"alive包裹的第一个子组件对象以及其组件名":["6.18"],"与黑白名单匹配":["6.18"],"绑定原生事件":["6.19"],"一般会按先进先调用的顺序执行":["6.20"],"plugin的问题":["6.21"],"需要配置在每次构建时都不参与编译的静态依赖":["6.21"],"并在首次构建时为他们预编译出一份js文件":["6.21"],"每次更新依赖需要手动维护":["6.21"],"一旦增删依赖或变更资源版本忘记更新就会报错":["6.21"],"最后将所有模块的require语法转化成":["6.22"],"来模拟模块化操作":["6.22"],"代码执行的结果不会被用到":["6.23"],"监听webpack生命周期广播的事件冰通过webpack提供的api改变输出结果":["6.24"],"本质":["6.24"],"是一个转化器":["6.24"],"module避免命名空间混乱":["6.25"],"允许css文件通过require的方式引入":["6.25"],"文件打包到新的":["6.26"],"chunk":["6.26"],"中":["6.26"],"在运行时":["6.26"],"an":["6.27"],"expression":["6.27"],"html":["6.28"],"vue挂载和卸载父子组件生命周期钩子执行顺序":["6.28"],"让其创建独立的表单":["6.30"],"不试用表单":["6.30"],"watch":["6.31"],"slot":["6.31"],"slots":["6.31"],"check":["6.31"],"对于没有name值的设置为路由的name":["6.31"],"支持vue":["6.31"],"devtool组件名称显示":["6.31"],"gutter":["6.33"],"100px":["6.34"],"white":["6.34"],"move":["6.34"],"align":["6.34"],"center":["6.34"],"box":["6.34"],"shadow":["6.34"],"6px":["6.34"],"rgba":["6.34"],"border":["6.34"],"radio":["6.34"],"5px":["6.34"],"set":["6.34"],"y":["6.34"],"recordname":["6.34"],"window":["6.34"],"cleartimeout":["6.34"],"indexarr":["6.34"],"filter":["6.34"],"temp":["6.34"],"important":["6.34"],"0px":["6.34","6.42"],"touch":["6.34"],"action":["6.34"],"transform":["6.34"],"border值":["6.35"],"getboundingclientrect":["6.35"],"getattribute":["6.36"],"itemm":["6.36"],"else":["6.39","6.40","8.1"],"返回":["6.39"],"g":["6.40"],"px":["6.40","6.41"],"maxheight":["6.41"],"a":["6.42"],"bordered":["6.42"],"formatter":["6.43"],"第二个为当前请求的":["6.44"],"它有的标注":["6.45"],"的坐标定义":["6.47"],"将对应的异步任务结束等待状态":["7.1"],"进入执行栈":["7.1"],"控制台的打印":["7.6"],"返回304":["7.9"],"浏览器直接取缓存":["7.9"],"如果不是那么就返回数据":["7.9"],"同时返回last":["7.9"],"etag":["7.9"],"none":["7.9"],"match":["7.9"],"这两个值是由服务器生成的资源唯一的表示字符串":["7.9"],"只要资源有变化这个值就会变化":["7.9"],"新开窗口":["7.10"],"前进后退":["7.10"],"定时器任务会有进程的切换":["7.12"],"事件的管理中心一定是在另外一个进程中实现的":["7.13"],"只是在一个空间中在进行拆分":["7.14"],"做切换":["7.14"],"他会在管理dom的进程中":["7.16"],"网络层":["7.17"],"ip":["7.17"],"arp":["7.17"],"ip寻址":["7.17"],"数据链路层":["7.17"],"ppp":["7.17"],"封装成帧":["7.17"],"osi":["7.17"],"与服务器同信":["7.18"],"携带在http头":["7.18"],"存放数据用":["7.18"],"而且每一次主线程计算样式后":["7.19"],"合成进程都需要绘制到gpu然后再渲染到屏幕上":["7.19"],"前后总共进行20次主线程渲染":["7.19"],"20次合成线程渲染":["7.19"],"20次":["7.19"],"总计40次计算":["7.19"],"如果使用transform的话":["7.19"],"例如tranform":["7.19"],"translate":["7.19"],"20px":["7.19"],"到transform":["7.19"],"test2":["7.21"],"但是规范是规范":["9.0"],"tab控制缩进":["9.1"],"组件号":["9.5"],"dataindex":["9.5"],"materialcode":["9.5"],"推荐":["9.8","9.9"],"model":["9.12"],"object":["9.12"],"不要在代码中遗留没用的代码":["9.14"],"推荐模板":["9.14"],"xxx":["9.15"],"yyy":["9.15"],"image":["9.15"],"若大家都突然使用格式化插件":["9.17"],"提交代码时容易造成大量冲突":["9.17"],"添加husky":["9.18"],"hooks在代码提交端格式化":["9.18"],"优先级低":["9.18"],"若有成员正在编辑此文件":["9.19"],"可等对方编辑完":["9.19"],"public":["9.20"],"vue的编译器在开发环境默认会对安装prettier的项目进行检查":["9.20"],"由于项目许多文件处于未格式化的状态":["9.20"],"所以要禁用该功能":["9.20"],"loader配置文档":["9.20"],"javascript":["9.20"],"点击apply":["9.21"],"可以使用":["9.21"],"来格式化代码了":["9.21"],"若执行格式化无响应":["9.21"]},{"0":["2.31","2.33"],"1":["3.20","6.35"],"2":["1.3","1.10"],"3":["1.7","1.10","4.12","6.23"],"4":["2.28","3.1","6.22","7.1"],"5":["0.35","4.4","4.20","9.18"],"6":["0.39","3.20","4.19"],"8":["2.31"],"20":["1.18"],"29":["1.18"],"100":["9.5"],"200":["0.26"],"334":["0.29"],"431":["1.13"],"500":["1.13"],"这段代码会定义":["0.2"],"div":["0.2","6.35","9.14"],"所有子元素的样式":["0.2"],"选择器时要谨慎":["0.3"],"可以使用":["0.4"],"问问自己是否真的需要加入这么多":["0.5"],"负荷":["0.5"],"可以用":["0.6"],"ul":["0.6"],"点击过或者":["0.7"],"访问过":["0.7"],"color":["0.11","6.34"],"red":["0.11"],"and":["0.11"],"which":["0.11"],"contain":["0.11"],"不管用的时候":["0.13"],"danger":["0.13"],"提示":["0.13"],"根据css3选择器规范":["0.13"],"语法上你应该使用双冒号来":["0.13"],"来指定伪类":["0.13"],"然而":["0.13"],"class":["0.14"],"p":["0.15","3.13","3.19"],"line":["0.16"],"4n":["0.17"],"可以选择排在4的倍数的元素":["0.17"],"奇数":["0.17"],"匹配第n到最后一个元素":["0.18"],"而不是子元素":["0.19"],"child":["0.19","2.46"],"倒数第n个元素":["0.20"],"type会匹配母元素里没有邻近兄弟元素的子元素":["0.24"],"transform":["0.26","2.40"],"translatex":["0.26"],"math":["0.26"],"min":["0.26","6.37"],"console":["0.26","2.36","2.45","3.4"],"log":["0.26","2.45","3.4"],"无效":["0.27"],"有效":["0.27"],"绑定的事件":["0.27"],"看情况":["0.28"],"改变浏览器大小":["0.28"],"浏览器字体大小":["0.28"],"transparent":["0.29"],"这个元素可自定义":["0.29"],"宽度":["0.29"],"确定位置":["0.29"],"basis":["0.30"],"属性定义了在分配多余空间之前":["0.30"],"项目占据的主轴空间":["0.30"],"浏览器根据这个属性":["0.30"],"计算主轴是否有多余空间":["0.30"],"它的默认值为auto":["0.30"],"即项目的本来大小":["0.30"],"的缩写":["0.30"],"缩放":["0.32"],"移动等动画":["0.32"],"translate":["0.32"],"transfrom":["0.33"],"base64":["0.33"],"ios浏览器":["0.33"],"阻止外边距折叠":["0.34"],"解决方法":["0.34"],"将元素放在不同的bfc容器":["0.34"],"flex布局":["0.35"],"双冒号":["0.36"],"无":["0.37","5.2"],"相对static定位以外的第一个父元素定位":["0.37"],"相对其正常位置定位":["0.37"],"宽高只包含content":["0.38"],"grid":["0.39"],"定位":["0.40"],"浏览器线程":["0.41"],"url":["0.41","4.12"],"content":["0.41","1.6"],"浏览器相关":["0.41"],"如果服务器相应100":["1.2"],"然后发body部分":["1.2"],"火狐浏览器post请求执法一个tcp包":["1.2"],"第二次为真正的":["1.3"],"post":["1.3"],"referer":["1.5"],"发出请求的页面的url":["1.5"],"user":["1.5"],"type":["1.6"],"提交方式":["1.7"],"通常表单上传文件时使用该种方式":["1.7"],"json":["1.7"],"服务器消息主体是序列化后的":["1.7"],"字符串":["1.7"],"页面更新周期长或不更新":["1.8"],"纯静态页面或强制生成静态html":["1.8"],"304状态码出现过多会造成以下问题":["1.8"],"网站快照停止":["1.8"],"进行tcp通信":["1.9"],"把服务器作为跳板":["1.9"],"让服务器代替用户去访问其他网页":["1.9"],"之后把数据原原本本的返回给用户":["1.9"],"服务器连接已建立":["1.10"],"请求已接收":["1.10"],"send之后":["1.10"],"服务器已经接收了请求":["1.10"],"函数接收一个":["1.11"],"函数作为参数":["1.11"],"取消ajax请求的意义":["1.11"],"已发出的请求可能仍然会到达后端":["1.11"],"取消后续的回调处理":["1.11"],"避免多余的回调处理":["1.11"],"path":["1.12"],"表示路径":["1.12"],"参数":["1.12"],"many":["1.13"],"请求过多":["1.13"],"header":["1.13"],"fields":["1.13"],"请求头的字段内容太大":["1.13"],"5xx":["1.13"],"服务器错误":["1.13"],"internal":["1.13"],"server":["1.13"],"无状态":["1.14"],"指的是通信过程中的上下文信息":["1.14"],"每次http请求都是独立":["1.14"],"br":["1.15","7.4"],"那么当前请求耗时过长的情况下":["1.15"],"一种专门为http发明的压缩算法":["1.16"],"支持语言1":["1.16"],"language":["1.16"],"language字符集":["1.16"],"keep":["1.17"],"alive及之前的为响应行和响应头":["1.17"],"后面的内容为响应体":["1.17"],"数据会分为多个部分":["1.19"],"每两个部分之间通过分隔符来分隔":["1.19"],"每部分表述均有http头部描述子包体":["1.19"],"生存周期":["1.21"],"通过expires和max":["1.21"],"一个随机数":["1.22"],"用于加密和解密客户端与服务器间传输数据":["1.22"],"用服务器公钥蓝加密":["1.22"],"fin":["1.23"],"一方面":["1.24"],"头信息使用":["1.24"],"gzip":["1.24"],"或":["1.24"],"compress":["1.24"],"压缩后再发送":["1.24"],"另一方面":["1.24"],"客户端和服务器同时维护一张头信息表":["1.24"],"所有字段都会存入这个表":["1.24"],"生成一个索引号":["1.24"],"以后就不发送同样字段了":["1.24"],"只发送索引号":["1.24"],"这样就能提高速度了":["1.24"],"服务器推送":["1.24"],"只对数组结构处理":["2.1"],"注意map的遍历顺序是插入顺序":["2.1"],"默认遍历器生成函数就是entries":["2.1"],"map转为数组用":["2.1"],"weakmap":["2.1"],"只接受对象作为键名":["2.1"],"null除外":["2.1"],"键名所指向的对象不计入垃圾回收机制":["2.1"],"最多拉平到一维数组":["2.2"],"返回一个新数组":["2.2"],"this":["2.6"],"contextkey":["2.6"],"delete":["2.6"],"throw":["2.7"],"typeerror":["2.7"],"from":["2.7"],"for":["2.8"],"called":["2.8"],"null":["2.8","2.23","9.12"],"object":["2.8","2.20"],"call":["2.8"],"y":["2.8","2.22","4.3"],"length":["2.11","6.43"],"err":["2.12"],"rejected":["2.13"],"reason":["2.13"],"aggregateerror":["2.14"],"return":["2.15","2.24","2.34","2.35","2.36","2.37"],"module":["2.15","6.21","9.20"],"promise":["2.16"],"新增数据类型":["2.16"],"内部保存一个值":["2.17"],"其中一个实例改变状态":["2.18"],"race状态就跟着改变":["2.18"],"括号后不能换行":["2.19"],"不具有super":["2.19"],"freeze可冻结指向的对象":["2.20"],"若对象中存在对象":["2.20"],"一般由程序员分配释放":["2.21"],"也可以由垃圾回收机制回收":["2.21"],"存放function":["2.21"],"为止":["2.23"],"apply":["2.24"],"typeof":["2.24"],"false":["2.25","6.42"],"作用域":["2.27"],"可访问变量的集合":["2.27"],"作用域链":["2.27"],"将对应的异步任务结束等待状态":["2.28"],"进入执行栈":["2.28"],"执行任务":["2.28","7.1"],"主线程不断执行第三步":["2.28"],"将制定的任务排到下一次事件循环执行":["2.29"],"无需等待样式表":["2.30"],"图像和子框架的完全加载":["2.30"],"drawimage":["2.31"],"quality":["2.31"],"0x":["2.36"],"join":["2.36"],"else":["2.36","2.37"],"replace":["2.38"],"g":["2.38"],"unescape":["2.38"],"a":["2.39"],"document":["2.39"],"createelement":["2.39"],"创建url":["2.39"],"bloburl":["2.39"],"window":["2.39"],"createobjecturl":["2.39"],"download":["2.39"],"href":["2.39"],"scale":["2.40"],"而目标也并不需要是拖拽的目标":["2.41"],"可mouseup并且在拖拽目标位置添加mouseenter事件":["2.41"],"结合定时器减少拖拽的错误":["2.41"],"尾调用优化":["2.42"],"若使用了内部变量":["2.42"],"reduce":["2.44"],"acc":["2.44"],"c":["2.44"],"of":["2.46"],"需要大量注释":["3.1"],"string":["3.2"],"类型别名扩展类型别名":["3.3"],"接口扩展类型别名":["3.3"],"message":["3.4"],"sizeable":["3.5"],"number":["3.5"],"函数":["3.6"],"已经可以正确地推导出指定键对应的类型":["3.6"],"那么当访问":["3.6"],"对象上不存在的属性时":["3.6"],"会出现什么情况":["3.6"],"比如":["3.6","3.10"],"date":["3.6"],"对于上述代码":["3.6"],"编译器会提示以下错误":["3.6"],"argument":["3.6"],"is":["3.6"],"not":["3.6","6.31"],"assignable":["3.6"],"parameter":["3.6","3.7"],"这就阻止我们尝试读取不存在的属性":["3.6"],"to":["3.7"],"还有应用在":["3.10"],"readonly":["3.10"],"in":["3.13"],"r":["3.14"],"never":["3.15","3.18"],"pick":["3.17"],"exclude":["3.17"],"baseurl":["3.20"],"用于解析非相对模块名称的基目录":["3.20"],"paths":["3.20","4.21"],"模块名到基于":["3.20"],"的路径映射的列表":["3.20"],"rootdirs":["3.20"],"根文件夹列表":["3.20"],"其组合内容表示项目运行时的结构内容":["3.20"],"typeroots":["3.20"],"包含类型声明的文件列表":["3.20"],"types":["3.20"],"需要包含的类型声明文件名列表":["3.20"],"allowsyntheticdefaultimports":["3.20"],"允许从没有设置默认导出的模块中默认导入":["3.20"],"source":["3.20"],"options":["3.20"],"sourceroot":["3.20"],"指定调试器应该找到":["3.20"],"文件而不是源文件的位置":["3.20"],"maproot":["3.20"],"指定调试器应该找到映射文件而不是生成文件的位置":["3.20"],"main":["4.3"],"assets":["4.3"],"apps":["4.3"],"s":["4.3"],"暂时没有将android":["4.3"],"生成patches文件夹":["4.4"],"此为修改的内容":["4.4"],"需要将patches包一并推入代码库中":["4.4"],"注意":["4.4","9.6","9.22"],"env":["4.5"],"const":["4.5"],"true":["4.7"],"packagerconfig":["4.8"],"工业互联网":["4.8"],"危化安全生产平台企业端":["4.8"],"修改此项即可":["4.8"],"icon":["4.8","4.9"],"overwrite":["4.9"],"build":["4.9","4.12"],"allowelevation":["4.10"],"允许请求提升":["4.10"],"如果为false":["4.10"],"则用户必须使用提升的权限重新启动安装程序":["4.10"],"allowtochangeinstallationdirectory":["4.10"],"允许修改安装目录":["4.10"],"installericon":["4.10"],"icons":["4.10"],"aaa":["4.10"],"安装图标":["4.10"],"uninstallericon":["4.10"],"bbb":["4.10"],"在package":["4.12"],"json的electron":["4.12"],"builder配置中增加":["4.12"],"其中url需要填一个可访问的服务器的静态文件夹地址":["4.12"],"version用于检测版本":["4.12"],"publish":["4.12"],"provider":["4.12"],"generic":["4.12"],"xxxx":["4.12"],"version":["4.12"],"res":["4.17"],"resolve":["4.18"],"dirname":["4.18"],"comp":["4.19"],"level":["4.19"],"生效":["4.19"],"不生效":["4.19"],"src":["4.21"],"通信":["5.1"],"更新机制":["5.2"],"发布即更新":["5.2"],"审核后小程序需要更新":["5.2"],"样式":["5.3"],"语法区别":["5.3"],"后退":["6.1"],"popstate":["6.1"],"hashchange":["6.1"],"memory":["6.1"],"abstract":["6.1"],"destoryed":["6.2"],"getdefaultprops":["6.2"],"getinitialstate":["6.2"],"conmponentwillmount":["6.2"],"render":["6.2","6.34"],"componentdidmount":["6.2"],"componentwillreceiveprops":["6.2"],"shouldcomponentupdate":["6.2"],"componentwillupdate":["6.2"],"componentdidupdate":["6.2"],"销毁组件":["6.2"],"包大":["6.3"],"学习成本":["6.3"],"低":["6.3"],"高":["6.3"],"减少dom操作":["6.5"],"扩展性强":["6.5"],"用于diff算法中辨识vnodes":["6.7"],"provide":["6.8"],"inject":["6.8"],"祖先组件通过provider提供变量":["6.8"],"孙组件通过inject来注入变量":["6.8"],"主要解决了跨域组件间的通讯问题":["6.8"],"不过它的使用场景":["6.8"],"主要是子组件获取上级组件的状态":["6.8"],"而proxy可以一次性给对象的所有属性添加get":["6.15"],"set":["6.15"],"销毁过程":["6.16"],"父beforedestroy":["6.16"],"子beforedestroy":["6.16"],"scroller":["6.17"],"来优化这种无限列表的场景的":["6.17"],"服务端渲染ssr":["6.17"],"or":["6.17"],"预渲染":["6.17"],"webpack图片压缩":["6.17"],"减少es6转为es5的冗余代码":["6.17"],"模板预编译":["6.17"],"提取组件的css":["6.17"],"优化":["6.17"],"sourcemap":["6.17"],"不匹配直接返回组件实例":["6.18"],"根据组件id和tag生成缓存key并在缓存对象中查找是否已缓存过该组件":["6.18"],"若存在":["6.18"],"直接取出缓存值冰更新该key在this":["6.18"],"keys中的位置":["6.18"],"在this":["6.18"],"除非函数在浏览器调用它之前就到了它的超时时间":["6.20"],"无法接入浏览器新特性type":["6.21"],"将所有资源预编译成一个文件":["6.21"],"并将这份文件显式注入项目构建的html模板中":["6.21"],"这样的做法在http1可以减少资源的请求数量":["6.21"],"emit阶段":["6.22"],"所有文件的编译及转化完成":["6.22"],"包含最终输出的资源":["6.22"],"可以在传入事件回调的compilation":["6.22"],"代码只会影响死变量":["6.23"],"直接操作文件":["6.24"],"将文件a编译成文件b":["6.24"],"是一个扩展器":["6.24"],"不能直接操作文件":["6.24"],"并返回css代码":["6.25"],"计算完变量":["6.26"],"后":["6.26"],"就可以使用像":["6.26"],"english":["6.26"],"webpack版本不支持import动态引入导致的报错":["6.27"],"可以改用require":["6.27"],"beforedestory注销监听":["6.28"],"ant":["6.28"],"用input":["6.30"],"并且绑定独立的属性":["6.30"],"included":["6.31"],"excluded":["6.31"],"储存的key值":["6.31"],"默认从router":["6.31"],"view设置的key中获取":["6.31"],"cid":["6.31"],"储存的key值设置为路由中得name值":["6.31"],"属性":["6.33"],"10px":["6.34"],"onmousedown":["6.34"],"onmouseenter":["6.34"],"relative":["6.34"],"localkeys":["6.34"],"keys":["6.34"],"showalert":["6.34"],"customrowclick":["6.34"],"record":["6.34"],"click":["6.34"],"button":["6.34"],"touppercase":["6.34"],"getselection":["6.34"],"range":["6.34"],"selecttext":["6.34"],"arr1":["6.34"],"arr2":["6.34"],"indexof":["6.34"],"splice":["6.34"],"childnodes":["6.35"],"innerhtml":["6.35"],"width":["6.37"],"确定":["6.39"],"onmousemove":["6.40"],"function":["6.40"],"通过事件委托":["6.40"],"计算移动的距离":["6.40"],"边界处理":["6.40"],"anttablebodyinner":["6.41"],"queryselectorall":["6.41"],"inner":["6.41"],"pictorialbar":["6.43"],"symbol":["6.43"],"diamond":["6.43"],"symboloffset":["6.43"],"symbolsize":["6.43"],"zlevel":["6.43"],"数据体本体":["6.44"],"bmapgl":["6.44"],"在原生的bmapgl都有":["6.45"],"而且更灵活":["6.45"],"cesium":["6.47"],"确保非阻塞":["7.2"],"页面解析完毕后会按照script标签的顺序执行":["7.4"],"遗忘的定时器":["7.6"],"判断过程同上":["7.9"],"不同的是当服务器返回304":["7.9"],"由于etag重新生成过":["7.9"],"response":["7.9"],"header中还是会将etag返回":["7.9"],"即使和原来的一样":["7.9"],"使用场景":["7.9"],"当资源定时更新":["7.9"],"但是资源内容没有变化时":["7.9"],"f5刷新":["7.10"],"ctrl":["7.10"],"所以只能是宏任务":["7.12"],"那么去派发事件":["7.13"],"也就是宏任务":["7.13"],"如果是js本身的命令是进程的话":["7.14"],"就没有办法拿到外面上下文的数据了":["7.14"],"因为不共享内存":["7.14"],"渲染也是一样的":["7.16"],"是在整个渲染流程中的某一步作的回调":["7.16"],"会话层":["7.17"],"表示层":["7.17"],"物理层":["7.17"],"利用物理介质传输比特流":["7.17"],"物理传输":["7.17"],"服务器接收请求做出响应":["7.17"],"数据共享":["7.18"],"同源页面共享":["7.18"],"易用性":["7.18"],"主线程只需要进行一次tranform":["7.19"],"然后合成线程去一次将":["7.19"],"20px转换到0px":["7.19"],"这样的话":["7.19"],"总计1":["7.19"],"20计算":["7.19"],"所以在使用css3":["7.19"],"transtion做动画效果时":["7.19"],"优先选择transform":["7.19"],"尽量不要使用height":["7.19"],"vue例子":["7.21"],"template":["7.21","9.14"],"e":["7.21"],"mousemoveevent":["7.21"],"text":["7.21"],"并不一定需要要求的特别死":["9.0"],"可根据自身阅读习惯自由调整":["9.0"],"任务包名称":["9.5"],"taskpackagename":["9.5"],"仅仅是单句而且后续没有复杂判断的情况下":["9.6"],"一般也可以写成这样":["9.6"],"不过此种写法不推荐":["9.6"],"进推荐在简短的代码中使用":["9.6"],"formproperty":["9.12"],"array":["9.12"],"vue":["9.14"],"20231227180917665":["9.15"],"20231227180931995":["9.15"],"见":["9.17"],"过渡阶段注意事项":["9.17"],"使用到的插件":["9.18"],"prettier":["9.18"],"合并代码后再进行格式化":["9.19"],"若短时间该成员不能结束编辑":["9.19"],"config":["9.20"],"js":["9.20"],"exports":["9.20"],"chainwebpack":["9.20"],"rule":["9.20"],"可能是未识别到":["9.21"],"prettierrc文件":["9.21"],"可重启":["9.21"],"或者进入":["9.21"],"prettierrc文件按":["9.21"],"顶部会提示是否使用此文件进行prettier配置":["9.21"],"点击":["9.21"],"yes":["9.21"],"需要去除":["9.22"],"自动保存格式化配置":["9.22"],"以上配置完成":["9.22"],"则可以使用":["9.22"],"shift":["9.22"],"alt":["9.22"]},{"0":["0.30"],"1":["0.16","0.30"],"2":["6.42","7.9"],"3":["1.11","3.6","7.9"],"4":["1.7","1.11","3.6","4.12","7.9","7.14"],"5":["3.6"],"20":["0.29"],"68":["3.4"],"200":["9.5"],"255":["0.29"],"500":["6.36"],"501":["1.13"],"502":["1.13"],"503":["1.13"],"1302":["9.21"],"2000":["0.26"],"100001":["2.43"],"跟上面一样":["0.2"],"如果可以尽量避免使用这个方法":["0.2"],"选择器来定义某一个特定的元素":["0.4"],"的链接添加样式":["0.7"],"border":["0.11"],"1px":["0.11"],"solid":["0.11"],"black":["0.11"],"为了兼容多数浏览器":["0.13"],"单冒号也被承认":["0.13"],"实际上":["0.13"],"在目前的情况下":["0.13"],"使用单冒号的选择是明智的":["0.13"],"green":["0.15"],"odd":["0.17"],"偶数even":["0.17"],"requestanimationframe":["0.26"],"不响应":["0.27"],"响应":["0.27"],"transform":["0.29"],"translate":["0.29"],"linear":["0.29"],"gradient":["0.29"],"90deg":["0.29"],"rgba":["0.29"],"fff":["0.29"],"这是使用渐变":["0.29"],"因为more元素会覆盖住content元素":["0.29"],"auto":["0.30"],"后两个属性可选":["0.30"],"快捷值auto":["0.30"],"none":["0.30"],"self":["0.30"],"允许与其他子项不一样的对齐方式":["0.30"],"可股改align":["0.30"],"items属性":["0.30"],"默认值为auto":["0.30"],"定义2d转换":["0.32"],"安卓浏览器":["0.33"],"chrome":["0.33","6.17"],"firefox":["0.33"],"safari":["0.33"],"清除浮动":["0.34"],"阻止元素被浮动元素覆盖":["0.34"],"grid布局":["0.35"],"根据浏览器窗口位置定位":["0.37"],"html":["0.41"],"长度限制":["1.2"],"浏览器规定":["1.2"],"请求":["1.3"],"agent":["1.5"],"浏览器的用户代理字符串":["1.5"],"表示后面的文档属于什么mime类型":["1.6"],"text":["1.7"],"xml":["1.7"],"该种方式主要用来提交":["1.7"],"格式的数据":["1.7"],"收录减少":["1.8"],"权重下降":["1.8"],"trace":["1.9"],"该方法会让服务器原样返回任意客户端请求的信息内容":["1.9"],"主要":["1.9"],"于测试或诊断":["1.9"],"请求处理中":["1.10"],"请求已完成":["1.10"],"且响应已就绪":["1.10"],"4状态码等同于onload事件":["1.10"],"以及特殊情况":["1.11"],"先发出的后返回":["1.11"],"导致回调中的数据错误覆盖":["1.11"],"取消loading效果":["1.11"],"以及该请求的其他交互效果":["1.11"],"特别是在单页应用中":["1.11"],"a页面跳转到b页面之后":["1.11"],"a页面的请求应该取消":["1.11"],"否则回调中的一些处理可能影响b页面":["1.11"],"超时处理":["1.11"],"错误处理等都省去了":["1.11"],"节约资源":["1.11"],"锚点":["1.12"],"error":["1.13"],"implemented":["1.13"],"表示客户端请求的功能还不支持":["1.13"],"gateway":["1.13"],"服务器正常但访问出错":["1.13"],"service":["1.13"],"unavailable":["1.13"],"服务器正忙":["1.13"],"无关的":["1.14"],"默认不需要保存状态信息":["1.14"],"其他的请求只能处于阻塞状态":["1.15"],"type中的charset":["1.16"],"charset":["1.16"],"这两部分用换行符隔开":["1.17"],"eex":["1.18"],"jspy":["1.18"],"e":["1.18"],"表示":["1.18"],"请求一定是多段数据请求":["1.18"],"响应体中的分隔符是00000010101":["1.18"],"在最后的分隔符会加":["1.19"],"age设置":["1.21"],"公用一个私钥加密解密":["1.22"],"允许服务器未经请求":["1.24"],"主动向客户端发送资源":["1.24"],"这叫做服务器推送":["1.24"],"使用服务器推送提前给客户端推送必要的资源":["1.24"],"这样就可以相对减少一些延迟时间":["1.24"],"这里需要注意的是":["1.24"],"http2":["1.24"],"下服务器主动推送的是静态资源":["1.24"],"websocket":["1.24"],"以及使用":["1.24"],"sse":["1.24"],"等方式向客户端发送即时数据的推送是不同的":["1.24"],"也是弱引用":["2.1"],"weakref用于对象的弱引用":["2.1"],"有一个方法deref":["2.1"],"用于判断对象是否被回收":["2.1"],"finalizationregistry":["2.1"],"用于制定目标对象被回收后执行的回调函数register":["2.1"],"方法":["2.1"],"用来注册所要观察的目标对象":["2.1"],"取消已经注册的回调函数":["2.1"],"则要向register":["2.1"],"传入第三个参数作为标记":["2.1"],"然后使用unregister":["2.1"],"标记":["2.1"],"取消":["2.1"],"return":["2.4","2.6","2.33","2.38","4.5","9.20"],"result":["2.6"],"contextkey":["2.7"],"delete":["2.7"],"true":["2.8","4.8"],"rejrct":["2.8"],"else":["2.8"],"err":["2.11"],"all":["2.14"],"wewe":["2.14"],"rejected":["2.14"],"exports":["2.15"],"则需要递归使用此方法冻结":["2.20"],"array":["2.21"],"object":["2.21","2.24"],"prototype":["2.25"],"tostring":["2.25"],"call":["2.25"],"isarray":["2.25"],"es5之前不支持":["2.25"],"函数执行的上下文环境的作用域呈链式链接":["2.27"],"任务队列中的事件除了i":["2.28"],"o还包括交互时间中制定了回调函数的事件":["2.28"],"任务队列是一个先进先出的结构":["2.28"],"但是计时器需要先检查执行时间":["2.28"],"这里的dataurl就是base64类型":["2.31"],"dataurl":["2.31"],"todataurl":["2.31"],"jpeg":["2.31"],"使用todataurl将图片转换成jpeg的格式":["2.31"],"不要把图片压缩成png":["2.31"],"因为压缩成png后base64的字符串可能比不转换前的长":["2.31"],"log":["2.36","2.37"],"颜色错误":["2.36","2.37"],"console":["2.37"],"000":["2.37"],"body":["2.39"],"appendchild":["2.39"],"click":["2.39"],"释放内存":["2.39"],"revokeobjecturl":["2.39"],"removechild":["2.39"],"webkittransform":["2.40"],"可参考ant中的实现":["2.41"],"则形成了闭包":["2.42"],"二":["2.44"],"parseint":["2.44","6.31"],"hexstring":["2.44"],"name":["2.45"],"push":["2.46","6.31"],"相对js没有那么灵活":["3.1"],"intgerface":["3.3"],"类型别名扩展接口":["3.3"],"semlinker":["3.4"],"in":["3.6"],"用于遍历枚举类型":["3.6"],"keys":["3.6"],"a":["3.6"],"b":["3.6"],"c":["3.6"],"p":["3.6"],"infer":["3.6"],"在条件类型语句中":["3.6"],"可以用":["3.6"],"声明一个类型变量并且对它进行使用":["3.6"],"returntype":["3.6"],"args":["3.6"],"r":["3.6"],"继承类型":["3.6"],"partialedwindow":["3.9"],"现在t上所有属性都变成了可选啦":["3.9"],"这个类型":["3.10"],"never":["3.16","3.19"],"inlinesourcemap":["3.20"],"生成单个":["3.20"],"soucemaps":["3.20"],"而不是将":["3.20"],"sourcemaps":["3.20"],"生成不同的文件":["3.20"],"inlinesources":["3.20"],"将代码与":["3.20"],"生成到一个文件中":["3.20"],"要求同时设置了":["3.20"],"或":["3.20","6.26"],"属性":["3.20"],"其他选项":["3.20"],"experimentaldecorators":["3.20"],"启用装饰器":["3.20"],"emitdecoratormetadata":["3.20"],"为装饰器提供元数据的支持":["3.20"],"表示已解禁":["4.1"],"studio命令行加入":["4.3"],"更新版本时":["4.3"],"以及新的打包目录都需要重新定义":["4.3"],"没有必要":["4.3"],"package需要用git":["4.4"],"需要配置环境变量":["4.4"],"build":["4.8"],"icons":["4.8","4.9"],"asar":["4.8"],"ico":["4.9"],"卸载图标":["4.10"],"installerheadericon":["4.10"],"安装时头部图标":["4.10"],"createdesktopshortcut":["4.10"],"创建桌面图标":["4.10"],"createstartmenushortcut":["4.10"],"创建开始菜单图标":["4.10"],"shortcutname":["4.10"],"图标名称":["4.10"],"xxx":["4.12"],"builder打包":["4.12"],"会生成":["4.12"],"latest":["4.12"],"yml":["4.12"],"和安装包":["4.12"],"将这两个文件扔进服务器的静态文件夹中":["4.12"],"尝试访问":["4.12"],"xxxx为服务器地址":["4.12"],"若访问成功即成功了":["4.12"],"此处应该返回一个promise":["4.17"],"包含的是最后的请求结果":["4.17"],"即用户信息的返回":["4.17"],"才能放行页面":["4.17"],"pathprefix":["4.18"],"image":["4.19"],"20240319110715931":["4.19"],"20240319110724992":["4.19"],"i":["4.20"],"渲染机制":["5.2"],"浏览器渲染":["5.2"],"双线程":["5.2"],"调用":["6.2"],"destory":["6.2"],"就会执行beforedestory":["6.2"],"react执行完componentwillunmount之后把事件":["6.2"],"数据":["6.2"],"dom都全部处理掉了":["6.2"],"也就是说当父组件从渲染这个子组件变成不渲染这个子组件的时候":["6.2"],"子组件相当于被销毁":["6.2"],"所以根本不需要其他的钩子函数了":["6.2"],"react销毁组件的时候":["6.2"],"会将组件的dom结构也移除":["6.2"],"vue则不然":["6.2"],"在调用destory方法销毁组件的时候":["6.2"],"组件的dom结构还是存在于页面中的":["6.2"],"this":["6.2"],"destory组件结构还是存在的":["6.2"],"只是移除了事件监听":["6.2"],"所以这就是为什么vue中有destroyed":["6.2"],"而react却没有componentdidunmount":["6.2"],"稳定性":["6.3"],"稳定":["6.3"],"跨级组件间建立了一种主动提供与依赖注入的关系":["6.8"],"ref":["6.8"],"ref在组件或者dom元素上标记":["6.8"],"通过this":["6.8"],"refs访问属性":["6.8"],"vux":["6.8"],"子destroyed":["6.16"],"父destroyed":["6.16"],"构建结果输出分析":["6.17"],"开启":["6.17"],"gzip":["6.17"],"压缩":["6.17"],"浏览器缓存":["6.17"],"cdn":["6.17"],"的使用":["6.17"],"performance":["6.17"],"查找性能瓶颈":["6.17"],"cache对象中储存该组件实例并保存key值":["6.18"],"之后检查缓存的实例数量是否超过max":["6.18"],"超过则根据lru置换策略删除最近最久未使用的实例":["6.18"],"即下标为0的那个key":["6.18"],"将该组件实例的keepalive的属性值设置为true":["6.18"],"但在http2时代拆除多个cdn":["6.21"],"link能够利用http2的多路复用特性":["6.21"],"减少加载时长":["6.21"],"拆分":["6.21"],"assets上拿到的所需数据":["6.22"],"包括即将输出的资源":["6.22"],"代码块chunk等":["6.22"],"只写不读":["6.23"],"针对的是loader结束后":["6.24"],"webpack打包的整个过程":["6.24"],"german":["6.26"],"的任何文件":["6.26"],"design":["6.28"],"绑定属性可以用一个对象保存每一个input的属性":["6.30"],"make":["6.31"],"freshest":["6.31"],"prune":["6.31"],"oldest":["6.31"],"entry":["6.31"],"data":["6.31"],"keepalive":["6.31"],"localkey":["6.34"],"local":["6.34"],"substring":["6.34"],"如果需要使用alert":["6.34"],"则重新绑定":["6.34"],"事件":["6.34"],"如果没打算开启":["6.34"],"则清空默认的选择项":["6.34"],"customrow":["6.34"],"thisk":["6.34"],"on":["6.34"],"scopedslots":["6.34"],"components":["6.34"],"header":["6.34"],"cell":["6.34"],"onexpand":["6.34"],"expanded":["6.34"],"emit":["6.34"],"expand":["6.34"],"slots":["6.34"],"class":["6.34"],"wrapper":["6.34"],"px":["6.35","6.36"],"height":["6.36"],"getboundingclientrect":["6.36"],"content":["6.37"],"cancel":["6.39"],"移动当前元素":["6.40"],"onmouseup":["6.40"],"null":["6.40"],"foreach":["6.41"],"item":["6.41"],"此方案有可能会造成样式污染":["6.42"],"尽可能将类名起长":["6.42"],"结合文件名更佳":["6.42"],"自定义指令":["6.42"],"echarts":["6.42"],"symbolposition":["6.43"],"end":["6.43"],"elemenui":["6.43"],"主线程不断执行第三步":["7.1"],"同时会在document的domcontentloaded之前执行":["7.4"],"资源每秒更新多次时":["7.9"],"由于last":["7.9"],"modify的时间只精确到秒":["7.9"],"某些服务器不能精确的得到文件的最后更改时间":["7.9"],"可和last":["7.9"],"modify一起用":["7.9"],"etag优先":["7.9"],"f5强制刷新":["7.10"],"js本身的部分一定是比线程小的":["7.14"],"并没有切换出它的本身所在的空间":["7.16"],"若connection":["7.17"],"keep":["7.17"],"alive":["7.17"],"tcp会持久连接":["7.17"],"浏览器收到响应开始下载资源":["7.17"],"浏览器解析html":["7.17"],"css":["7.17"],"js渲染":["7.17"],"差":["7.18"],"好":["7.18"],"margin和padding":["7.19"],"为什么transform更加平滑":["7.19"],"在使用transform做动画效果时":["7.19"],"transform实现的动画是与合成器线程相关的":["7.19"],"不需要等待主线程样式计算或者":["7.19"],"计算速度是很快的":["7.19"],"而使用height":["7.19"],"margin和padding时":["7.19"],"导致布局和绘制的调整":["7.19"],"触发回流":["7.19"],"主线程需要重新计算样式并且执行js":["7.19"],"计算速度自然就慢了":["7.19"],"mousemoveevent2":["7.21"],"text2":["7.21"],"concat":["8.1"],"以上两种方式均可":["9.3"],"重点是判断的方式":["9.3"],"至于每个变量的最后一项是否严格要求加":["9.5"],"需要看公司项目是否要求":["9.5"],"一般来说推荐加":["9.5"],"filelist":["9.12"],"importdatetime":["9.12"],"避免出现这种错误":["9.15"],"用于格式化代码":["9.18"],"则放弃此次格式化":["9.19"],"use":["9.20"],"loader":["9.20"],"tap":["9.20"],"options":["9.20"],"prettify":["9.20"],"即可":["9.21"],"97d7576a":["9.21"],"4d4f":["9.21"],"83e8":["9.21"],"ddc9f6515d8b":["9.21"],"f":["9.22"],"进行格式化":["9.22"],"具体":["9.22"],"快捷键":["9.22"],"可右击文件查看":["9.22"],"92ffab99":["9.22"],"4fd3":["9.22"],"48e9":["9.22"],"9e1d":["9.22"],"adf1ef72cfc7":["9.22"]}]'},e={"0.0":{t:"# css\r",p:"\r",l:"content/css.html",a:"css"},"0.1":{t:"常用选择器\r",p:"\r",l:"content/css.html#常用选择器",a:"常用选择器"},"0.2":{t:"* (通配选择器)\r",p:`

星号可以用来定义页面的所有元素。许多开发者会使用这个技巧来把margin和padding都设为0。在快速开发测试中这种设置固然是好的，但我建议绝对不要在最终的产品代码中使用。因为会给浏览器增加大量 ...`,l:"content/css.html#通配选择器",a:"通配选择器"},"0.3":{t:"#X (id选择器)\r",p:`
使用＃号作为前缀可以选择该id的元素。这是最常见的用法，但使用id选择器时要谨慎。

`,l:"content/css.html#x-id选择器",a:"x-id选择器"},"0.4":{t:".X (类选择器)\r",p:`
这是class类选择器。id和class类选择器的区别是，类选择器可以定义多个元素。当你想定义一组元素的样式时可以使用class选择器。另外，可以使用id选择器来定义某一个特定的元素。

`,l:"content/css.html#x-类选择器",a:"x-类选择器"},"0.5":{t:"X Y (后代选择器)\r",p:`
如果你的选择器看起来像X Y Z A B.error这样就错了。问问自己是否真的需要加入这么多负荷。

`,l:"content/css.html#x-y-后代选择器",a:"x-y-后代选择器"},"0.6":{t:"X (元素选择器)\r",p:`
假如你想定义页面里所有type标签类型一样的元素，而不使用id或者class呢？可以简单地使用元素选择器。比如选择所有的无序列表，可以用ul {}。

`,l:"content/css.html#x-元素选择器",a:"x-元素选择器"},"0.7":{t:"X:visited / X:link (链接选择器)\r",p:`

我们使用:link伪类来定义所有还没点击的链接。


另外还有:visited伪类可以让我们给曾经点击过或者访问过的链接添加样式。


`,l:"content/css.html#x-visited-x-link-链接选择器",a:"x-visited-x-link-链接选择器"},"0.8":{t:"X + Y (邻近选择器)\r",p:`
这是邻近元素选择器，只会选中紧接在另一个元素后的元素

`,l:"content/css.html#x-y-邻近选择器",a:"x-y-邻近选择器"},"0.9":{t:"X > Y (直接后代选择器)\r",p:`
只会选中直接后代

`,l:"content/css.html#x-y-直接后代选择器",a:"x-y-直接后代选择器"},"0.10":{t:"X ~ Y (兄弟选择器)\r",p:`
兄弟选择器，在X后面的Y元素都会被选中

`,l:"content/css.html#x-y-兄弟选择器",a:"x-y-兄弟选择器"},"0.11":{t:"X[title] (属性选择器)\r",p:`

属性选择器


X[href=&quot;foo&quot;]  //指向具体


X[href*=&quot;nettuts&quot;] //正则匹配


X[href^=&quot;http ...`,l:"content/css.html#x-title-属性选择器",a:"x-title-属性选择器"},"0.12":{t:"X:checked (选中选择器)\r",p:`
这个伪类可以用来定义**选中（checked）**的元素

`,l:"content/css.html#x-checked-选中选择器",a:"x-checked-选中选择器"},"0.13":{t:"X:after (伪类选择器)\r",p:`

伪类before和after属于高级用法。几乎每一天都有人找到高效而有创意的新用法。这两个伪类可以在元素前面和后面添加内容。


许多人认识到这两个伪类是因为这是清除浮动的技巧。
.clearfi ...`,l:"content/css.html#x-after-伪类选择器",a:"x-after-伪类选择器"},"0.14":{t:"X:hover (交互选择器)\r",p:`
用户交互伪类user action pseudo class

`,l:"content/css.html#x-hover-交互选择器",a:"x-hover-交互选择器"},"0.15":{t:"X:not(selector) (否定伪类选择器)\r",p:`

比如，我希望选中所有的div元素，除了一个id为container的div
div:not(#container) {
 color: blue;
}

// 不建议
*:not(p) {
col ...`,l:"content/css.html#x-not-selector-否定伪类选择器",a:"x-not-selector-否定伪类选择器"},"0.16":{t:"X::pseudoElement (伪元素选择器)\r",p:`

伪元素（用::表示）来定义某些片段元素


要记住的是这只能用于块状（block）元素


下面匹配段落的第一个字母
p::first-letter {
 float: left;
 font-s ...`,l:"content/css.html#x-pseudoelement-伪元素选择器",a:"x-pseudoelement-伪元素选择器"},"0.17":{t:"X:nth-child(n) (队列选择器)\r",p:`
队列元素选择器
要注意的是nth-child指序列里的第n个元素，从1数起。如果你想匹配列表里的第二个元素，可以使用li:nth-child(2)。
我们甚至可以使用这种方法来选择一系列的子元素。比 ...`,l:"content/css.html#x-nth-child-n-队列选择器",a:"x-nth-child-n-队列选择器"},"0.18":{t:"X:nth-last-child(n) (n ~ 最后选择器)\r",p:`
匹配第N到最后一个元素

`,l:"content/css.html#x-nth-last-child-n-n-最后选择器",a:"x-nth-last-child-n-n-最后选择器"},"0.19":{t:"X:nth-of-type(n) (元素类型选择器)\r",p:`
元素的类型type来选择，而不是子元素child。

`,l:"content/css.html#x-nth-of-type-n-元素类型选择器",a:"x-nth-of-type-n-元素类型选择器"},"0.20":{t:"X:nth-last-of-type(n) (倒数选择器)\r",p:`
倒数第n个元素

`,l:"content/css.html#x-nth-last-of-type-n-倒数选择器",a:"x-nth-last-of-type-n-倒数选择器"},"0.21":{t:"X:first-child (第一子元素选择器)\r",p:`
选中母元素的第一个子元素，常常用于去掉第一个或最后一个元素的边框。

`,l:"content/css.html#x-first-child-第一子元素选择器",a:"x-first-child-第一子元素选择器"},"0.22":{t:"X:last-child (最后子元素选择器)\r",p:`
匹配最后一个子元素

`,l:"content/css.html#x-last-child-最后子元素选择器",a:"x-last-child-最后子元素选择器"},"0.23":{t:"X:only-child (唯一子元素选择器)\r",p:`
匹配唯一的子元素

`,l:"content/css.html#x-only-child-唯一子元素选择器",a:"x-only-child-唯一子元素选择器"},"0.24":{t:"X:only-of-type (唯一子元素类型选择器)\r",p:`
only-of-type会匹配母元素里没有邻近兄弟元素的子元素

`,l:"content/css.html#x-only-of-type-唯一子元素类型选择器",a:"x-only-of-type-唯一子元素类型选择器"},"0.25":{t:"X:first-of-type (第一个元素类型选择器)\r",p:`
选择该类型的第一个元素

`,l:"content/css.html#x-first-of-type-第一个元素类型选择器",a:"x-first-of-type-第一个元素类型选择器"},"0.26":{t:"css和js两种方式实现div右移1000px动画\r",p:`css：
#test{
	width:50px;
	height:50px;
	box-shadow:0 0 5px rgba(0,0,0,0.6);
	animation:1s move forwa ...`,l:"content/css.html#css和js两种方式实现div右移1000px动画",a:"css和js两种方式实现div右移1000px动画"},"0.27":{t:"visibility、display、opacity的区别\r",p:`


项目
display:none
opacity:0
visibility:hidden




占位
否
是
是


回流与渲染
是
否
否


子代继承
不继承
继承
继承


子代反继承
否 ...`,l:"content/css.html#visibility、display、opacity的区别",a:"visibility、display、opacity的区别"},"0.28":{t:"回流和重绘（回流一定会触发重绘，而重绘不一定会回流）\r",p:`


项目
回流
重绘




添加、删除元素
是
是


display:none
是
是


visibility
否
是


移动元素
是
是


style
看情况
看情况


改变浏览器大小 ...`,l:"content/css.html#回流和重绘-回流一定会触发重绘-而重绘不一定会回流",a:"回流和重绘-回流一定会触发重绘-而重绘不一定会回流"},"0.29":{t:"单行截断和多行截断\r",p:`单行：
span{
	display:line-block;
	width:150px;
	overflow:hidden;
	text-overflow:ellipsis;
	white-space ...`,l:"content/css.html#单行截断和多行截断",a:"单行截断和多行截断"},"0.30":{t:"flex布局\r",p:`flexible box，弹性布局（webkit内核的浏览器需要加-webkit）

设置属性后，float、clear、vertival-align均失效
有两个主轴：main axis、cross ...`,l:"content/css.html#flex布局",a:"flex布局"},"0.31":{t:"flex：1\r",p:`放大一倍
`,l:"content/css.html#flex-1",a:"flex-1"},"0.32":{t:"transition、transform、translate的区别\r",p:`transition：过渡，transition-property、transition-duration、transition-timing-function、transition-delay
tr ...`,l:"content/css.html#transition、transform、translate的区别",a:"transition、transform、translate的区别"},"0.33":{t:"如何画一条 0.5px 的边框\r",p:`
直接定义0.5px
缩放 scaleY(0.5)，虚化问题可加 transform-origin: 50% 100% 解决
渐变 linear-gradient(0deg,#fff,#000),有虚 ...`,l:"content/css.html#如何画一条-0-5px-的边框",a:"如何画一条-0-5px-的边框"},"0.34":{t:"说一下BFC\r",p:`::: tip block formatting contexts(块级格式化上下文)
容器内的元素不会影响容器外的元素
:::
形成条件：

body根元素
浮动元素
绝对定位元素
display: ...`,l:"content/css.html#说一下bfc",a:"说一下bfc"},"0.35":{t:"CSS垂直居中的方案\r",p:`
绝对定位+margin负值
绝对定位+translate位移
绝对定位+margin：auto
flex布局
Grid布局

`,l:"content/css.html#css垂直居中的方案",a:"css垂直居中的方案"},"0.36":{t:"伪元素和伪类的区别\r",p:`


项
伪元素
伪类




区别
创建元素
操作已有元素


如何使用
单冒号
双冒号



`,l:"content/css.html#伪元素和伪类的区别",a:"伪元素和伪类的区别"},"0.37":{t:"position的几个属性和含义\r",p:`


项
static
absolute
relative
fixed
inherit




含义
默认文档流
绝对定位
相对定位
绝对定位
继承父元素定位


文档流
正常文档流
脱离文档流
脱离 ...`,l:"content/css.html#position的几个属性和含义",a:"position的几个属性和含义"},"0.38":{t:"说一下盒模型\r",p:`


盒模型
border-box
content-box




区域
除了margin，都计算在宽高
宽高只包含content



`,l:"content/css.html#说一下盒模型",a:"说一下盒模型"},"0.39":{t:"响应式布局方案\r",p:`
媒体查询
百分比布局
rem
vw\\vh
flex
grid

`,l:"content/css.html#响应式布局方案",a:"响应式布局方案"},"0.40":{t:"三栏式布局方案\r",p:`
纯浮动
浮动+bfc
flex
定位

`,l:"content/css.html#三栏式布局方案",a:"三栏式布局方案"},"0.41":{t:"关于低版本的安卓系统下浏览器的异常表现\r",p:`
css3动画会引起页面的canvas闪屏，可以考虑切换svg以获得更优的性能
css3动画掉帧的问题，尽量使用transform来做动画，不要使用height、width、margin、paddin ...`,l:"content/css.html#关于低版本的安卓系统下浏览器的异常表现",a:"关于低版本的安卓系统下浏览器的异常表现"},"1.0":{t:"# HTTP\r",p:"\r",l:"content/http.html",a:"http"},"1.1":{t:"http报文结构\r",p:`


请求报文





起始行
GET /home HTTP/1.1(方法、路径、http版本，最后接一个换行)


头部
1、字段名不区分大小写&lt;br /&gt;2、字段名不允许出现空格、下 ...`,l:"content/http.html#http报文结构",a:"http报文结构"},"1.2":{t:"get和post的区别\r",p:`


项
get
post




缓存
浏览器主动缓存
无缓存


编码
只能进行url编码&lt;br /&gt;只能接受ASCII字符
无限制


参数
查询字符串
请求体


幂等性&lt;b ...`,l:"content/http.html#get和post的区别",a:"get和post的区别"},"1.3":{t:"为什么post请求会发送两次请求\r",p:`
1.第一次请求为options预检请求，状态码为:204

作用：

作用1: 询问服务器是否支持修改的请求头，如果服务器支持，则在第二次中发送真正的请求
作用2: 检测服务器是否为同源请求,是否支 ...`,l:"content/http.html#为什么post请求会发送两次请求",a:"为什么post请求会发送两次请求"},"1.4":{t:"常见的HTTP请求头和响应头\r",p:"\r",l:"content/http.html#常见的http请求头和响应头",a:"常见的http请求头和响应头"},"1.5":{t:"HTTP Request Header\r",p:`
Accept：浏览器能够处理的内容类型
Accept-Charset：浏览器能够显示的字符集
Accept-Encoding：浏览器能够处理的压缩编码
Accept-Language：浏览器当前设置 ...`,l:"content/http.html#http-request-header",a:"http-request-header"},"1.6":{t:"HTTP Responses Header\r",p:`
Date：表示消息发送的时间，时间的描述格式由rfc822定义
server：服务器名称
Connection：浏览器与服务器之间连接的类型
Cache-Control：控制HTTP缓存
conte ...`,l:"content/http.html#http-responses-header",a:"http-responses-header"},"1.7":{t:"Content-Type\r",p:`常见的 Content-Type 属性值有以下四种：
（1）application/x-www-form-urlencoded：浏览器的原生 form 表单，如果不设置 enctype 属性，那么最终 ...`,l:"content/http.html#content-type",a:"content-type"},"1.8":{t:"304多一点好还是少一点\r",p:`为什么会有304
服务器为了提高网站访问速度，对之前访问的部分页面指定缓存机制，当客户端在此对这些页面进行请求，服务器会根据缓存内容判断页面与之前是否相同，若相同便直接返回304，此时客户端调用缓存内 ...`,l:"content/http.html#_304多一点好还是少一点",a:"_304多一点好还是少一点"},"1.9":{t:"常见的HTTP请求方法\r",p:`
GET: 向服务器获取数据；
POST：发送数据给服务器，通常会造成服务器资源的新增修改；
PUT：用于全量修改目标资源(看接口，也可以用于添加)；
PATCH：用于对资源进行部分修改
DELETE ...`,l:"content/http.html#常见的http请求方法",a:"常见的http请求方法"},"1.10":{t:"Ajax基本写法\r",p:`let xhr = new XMLHttpRequest()
xhr.open('get', 'https://www.baidu.com')
xhr.setRequestHeader('Conten ...`,l:"content/http.html#ajax基本写法",a:"ajax基本写法"},"1.11":{t:"ajax请求如何取消\r",p:`1. 原生xhr取消请求
var xhr = new XMLHttpRequest();
xhr.abort();

2.axios取消请求
1.使用 CancelToken.source 工厂方法创 ...`,l:"content/http.html#ajax请求如何取消",a:"ajax请求如何取消"},"1.12":{t:"URI（统一资源标识符）\r",p:`scheme://user:passwd@host:portpath?query#fragment




scheme
协议名(http、https、file等)，必须跟://




user:p ...`,l:"content/http.html#uri-统一资源标识符",a:"uri-统一资源标识符"},"1.13":{t:"HTTP状态码\r",p:`


1XX
表示目前是协议处理的中间状态，还需要后续操作&lt;br /&gt;101 Switching Protocols 在http升级为websocket的时候，如果服务器同意变更，就会发送 ...`,l:"content/http.html#http状态码",a:"http状态码"},"1.14":{t:"HTTP 的特点\r",p:`


灵活可扩展
1、语义上的自由，只规定了基本格式，没有严格的语法限制&lt;br /&gt;2、传输形式的多样性，不仅可以传输文本，还能传输图片、视频等




可靠传输
基于TCP/IP


请 ...`,l:"content/http.html#http-的特点",a:"http-的特点"},"1.15":{t:"**HTTP的缺点**\r",p:`


无状态
需要长连接的场景中，需要保存大量的上下文信息，以免传输大量重复的信息




明文传输
协议中的报文(主要指头部)不适用二进制数据，而是文本形式


对头阻塞问题
当http开启长连接时 ...`,l:"content/http.html#http的缺点",a:"http的缺点"},"1.16":{t:"**accept字段**\r",p:`
数据格式(MIME type)
发送端：Content-Type
接收端：Accept




类型
值




text
text/html、text/plain、text/css


image ...`,l:"content/http.html#accept字段",a:"accept字段"},"1.17":{t:"**HTTP是如何传入定长和不定长的数据**\r",p:`定长包：
发送端会在带上Content-Length，短于返回值，会被截去，长于返回值，则导致传输失败
不定长包：
Transfer-Enconding：chunked 分块传输，设置该字段后，Con ...`,l:"content/http.html#http是如何传入定长和不定长的数据",a:"http是如何传入定长和不定长的数据"},"1.18":{t:"**HTTP如何处理大文件传输**\r",p:`范围请求：
响应头需要增加Accrpt-Ranges：none通知客户端支持范围请求
客户端：
Range请求头字段确定，格式为bytes=x-y 0-499位开始到第499个字节、500-表示第50 ...`,l:"content/http.html#http如何处理大文件传输",a:"http如何处理大文件传输"},"1.19":{t:"**HTTP中如何处理表单数据的提交**\r",p:`有两种主要的表单提交方式



application/x-www-form-urlencoded
multipart/form-data




数据会被编码成以&amp;分隔的键值对
Conten ...`,l:"content/http.html#http中如何处理表单数据的提交",a:"http中如何处理表单数据的提交"},"1.20":{t:"**HTTP1.1如何解决HTTP的对头阻塞问题**\r",p:`
并发
域名分片

`,l:"content/http.html#http1-1如何解决http的对头阻塞问题",a:"http1-1如何解决http的对头阻塞问题"},"1.21":{t:"cookie\r",p:`


请求头
Cookie: a=xxx;b=xxx




响应头
Set-Cookie: a=xxx&lt;br /&gt;Set-Cookie: b=xxx


生存周期
通过Expires和M ...`,l:"content/http.html#cookie",a:"cookie"},"1.22":{t:"**HTTPS为什么可靠**\r",p:`
http是明文通讯，而https是加密通讯
CA证书

密钥传输过程：



客户端
过程
服务端




CA证书公钥黄
-----&gt;&lt;br /&gt;请求服务器公钥
CA证书私钥绿、 ...`,l:"content/http.html#https为什么可靠",a:"https为什么可靠"},"1.23":{t:"**TCP传输**\r",p:`


客户端
过程
服务端




标记位SYN(同步序列编号)=1，seq=j
-----&gt;




&lt;-----
标记位SYN=1,ACK=1,ack=j+1,seq= k


ack ...`,l:"content/http.html#tcp传输",a:"tcp传输"},"1.24":{t:"**HTTP 1.1 和 HTTP 2.0 的区别**\r",p:`
二进制协议：HTTP/2 是一个二进制协议。在 HTTP/1.1 版中，报文的头信息必须是文本（ASCII 编码），数据体可以是文本，也可以是二进制。HTTP/2 则是一个彻底的二进制协议，头信息和 ...`,l:"content/http.html#http-1-1-和-http-2-0-的区别",a:"http-1-1-和-http-2-0-的区别"},"2.0":{t:"# JavaScript\r",p:"\r",l:"content/js.html",a:"javascript"},"2.1":{t:"Map和Set的区别，Map和Object的区别\r",p:`Set：
类似数组，但成员唯一，可用于数组、字符串去重。不会发生类型转换，使用的算法叫same-value-zero equality类似===，但是区别在于Set认为NaN===NaN，对象总是不相 ...`,l:"content/js.html#map和set的区别-map和object的区别",a:"map和set的区别-map和object的区别"},"2.2":{t:"数组的filter、every、flat的作用是什么\r",p:`
filter：过滤数组，会创建一个新数组
every：测试数组中的每个值，返回一个布尔值
flat：拉平数组，最多拉平到一维数组，返回一个新数组

`,l:"content/js.html#数组的filter、every、flat的作用是什么",a:"数组的filter、every、flat的作用是什么"},"2.3":{t:"防抖（触发最后一次）\r",p:`function debounce(fn,wait = 1000,immediate = false) {
	let timer = null
	return function debounced(. ...`,l:"content/js.html#防抖-触发最后一次",a:"防抖-触发最后一次"},"2.4":{t:"节流（触发第一次）\r",p:`function throttle(fn,wait = 1000) {
	let previous = 0
	const throttled = (...args) =&gt; {
	if(now - ...`,l:"content/js.html#节流-触发第一次",a:"节流-触发第一次"},"2.5":{t:"深拷贝\r",p:`function cloneType(target){
	return Object.prototype.toString.call(target).slice(8,-1)
}

function c ...`,l:"content/js.html#深拷贝",a:"深拷贝"},"2.6":{t:"call\r",p:`Function.prototype.myCall = function(context,args){
	if(context === null || context === undefined){
 ...`,l:"content/js.html#call",a:"call"},"2.7":{t:"apply\r",p:`Function.prototype.myApply = function (context){
	if(context === null || context === undefined) {
		 ...`,l:"content/js.html#apply",a:"apply"},"2.8":{t:"Promise\r",p:`class Promise {
    constructor(runPromise) {
        this.state = 'pending'
        this.successVal ...`,l:"content/js.html#promise",a:"promise"},"2.9":{t:"Promise.resolve\r",p:`Promise.resolve = function (value) {
    if (value instanceof Promise) {
        return value
    }
 ...`,l:"content/js.html#promise-resolve",a:"promise-resolve"},"2.10":{t:"Promise.reject\r",p:`Promise.reject = function (reason) {
    return new Promise((resolve, reject) =&gt; reject(reason))
 ...`,l:"content/js.html#promise-reject",a:"promise-reject"},"2.11":{t:"Promise.all\r",p:`Promise.all = function (promiseArr) {
    let index = 0, result = []
    return new Promise((resolve ...`,l:"content/js.html#promise-all",a:"promise-all"},"2.12":{t:"Promise.race\r",p:`Promise.race = function (promiseArr) {
    return new Promise((resolve, reject) =&gt; {
        prom ...`,l:"content/js.html#promise-race",a:"promise-race"},"2.13":{t:"Promise.allSettled\r",p:`Promise.allSettled = function (promiseArr) {
    let result = []
    return new Promise((resolve, re ...`,l:"content/js.html#promise-allsettled",a:"promise-allsettled"},"2.14":{t:"Promise.any\r",p:`Promise.any = function (promiseArr) {
    let index = 0
    return new Promise((resolve, reject) =&g ...`,l:"content/js.html#promise-any",a:"promise-any"},"2.15":{t:"验证Promise\r",p:`//promises-aplus-tests

Promise.defer = Promise.deferred = function() {
	let dfd = {}
	dfd.promise = ...`,l:"content/js.html#验证promise",a:"验证promise"},"2.16":{t:"es6有哪些新特性\r",p:`

块级作用域


箭头函数


默认参数


扩展运算符


解构赋值


模板字符串


字面量增强


对象属性增强


modules


class


promise


新增数据类型

 ...`,l:"content/js.html#es6有哪些新特性",a:"es6有哪些新特性"},"2.17":{t:"说一下对Promise的了解\r",p:`
有三个状态，pending、fulfilled、rejected
状态改变后不可逆
可链式调用
内部保存一个值

`,l:"content/js.html#说一下对promise的了解",a:"说一下对promise的了解"},"2.18":{t:"Promise的all和race有什么区别\r",p:`all：

接收一个Iterator结构的数据作为参数，其中的每个值都是promise实例
只有状态都变成fulfilled才，all的状态才会变成fulfilled
只有所有值中均没有reject， ...`,l:"content/js.html#promise的all和race有什么区别",a:"promise的all和race有什么区别"},"2.19":{t:"箭头函数和普通函数的区别\r",p:`
写法简洁
没有this，会捕获上下文的this作为自己的this值
匿名函数，不能作为构造函数
使用call、apply、bind对this没影响
没有prototype
不能使用yield关键字
 ...`,l:"content/js.html#箭头函数和普通函数的区别",a:"箭头函数和普通函数的区别"},"2.20":{t:"let、var和const的区别？如果希望const定义的对象的属性也不能被修改该怎么做？\r",p:`var：
有变量提升
let：

只在命令所在的代码块内有效
不存在变量提升
暂时性死区
不允许重复声明

const：

只在命令所在的代码块有效
不存在变量提升
暂时性死区
不允许重复声明
只读（ ...`,l:"content/js.html#let、var和const的区别-如果希望const定义的对象的属性也不能被修改该怎么做",a:"let、var和const的区别-如果希望const定义的对象的属性也不能被修改该怎么做"},"2.21":{t:"堆和栈的区别\r",p:`栈(stack)：

自动释放
存储一些基础变量(string、number、boolean、null、undefined)以及一些对象的引用变量
固定大小
线性结构，后进先出
读取速度快

堆(he ...`,l:"content/js.html#堆和栈的区别",a:"堆和栈的区别"},"2.22":{t:"闭包的原理\r",p:`::: tip 闭包
闭包是函数创建时创建的，即有函数创建就会生成闭包
闭包和其函数在统一上下文
闭包包含该作用域下所有变量/引用地址
定义函数不会创建闭包，只有创建/执行函数同时才创建闭包
:::
 ...`,l:"content/js.html#闭包的原理",a:"闭包的原理"},"2.23":{t:"instanceof的实现原理\r",p:`用于检测构造函数的prototype属性是否是某个实例对象的原型链上
实现原理：不断遍历左边值的隐式属性__proto__，判断其是否等于右边值的prototype，直至等于null为止
`,l:"content/js.html#instanceof的实现原理",a:"instanceof的实现原理"},"2.24":{t:"new的实现原理\r",p:`:::tip new
创建一个空对象obj
将obj的原型链上的__proto__指向构造函数的原型prototype
并且在原型链__proto__上设置构造函数的constructor为要实例化的 ...`,l:"content/js.html#new的实现原理",a:"new的实现原理"},"2.25":{t:"数据类型有哪些？如何判断一个数据是否是数组\r",p:`
Number
String
Boolean
null
undefined
Array
Object
Function
Symbol

判断是否为数组
instanceof(可更改不稳定)
const ...`,l:"content/js.html#数据类型有哪些-如何判断一个数据是否是数组",a:"数据类型有哪些-如何判断一个数据是否是数组"},"2.26":{t:"JQuery实现链式调用的原理是什么\r",p:`返回jq对象
`,l:"content/js.html#jquery实现链式调用的原理是什么",a:"jquery实现链式调用的原理是什么"},"2.27":{t:"分别介绍一下原型、原型链、作用域和作用域链的含义和使用场景\r",p:`原型：
函数有一个prototype属性，它指向一个对象，该对象称为原型对象，即原型
原型链：
原型拥有自己的原型__proto__，其不断指向其最上层原型，直至null，形成一个链，成为原型链
作用 ...`,l:"content/js.html#分别介绍一下原型、原型链、作用域和作用域链的含义和使用场景",a:"分别介绍一下原型、原型链、作用域和作用域链的含义和使用场景"},"2.28":{t:"js运行机制和事件循环\r",p:`js其重要用途是用于交互，为了避免出现矛盾的交互情况，所以其只能是单线程语言，web worker允许js脚本创建线程，但子线程完全受主线程控制，且不得操作dom
js 的任务分为同步任务和异步任务， ...`,l:"content/js.html#js运行机制和事件循环",a:"js运行机制和事件循环"},"2.29":{t:"nodejs的事件循环\r",p:`
process.nextTick：将指定任务排到所有异步任务之前，运行效率高，不用检查任务队列
setImmedidate：将制定的任务排到下一次事件循环执行

`,l:"content/js.html#nodejs的事件循环",a:"nodejs的事件循环"},"2.30":{t:"onload 和 DOMContentLoaded的区别\r",p:`
onload：在文档中的所有对象都在DOM中，所有图片，脚本，链接以及子框都完成了装载。
DOMContentLoaded：无需等待样式表、图像和子框架的完全加载

`,l:"content/js.html#onload-和-domcontentloaded的区别",a:"onload-和-domcontentloaded的区别"},"2.31":{t:"图像文件转换为base64\r",p:`1、上传图片
imageToBase64 (file) {
    var reader = new FileReader()
    reader.readAsDataURL(file)
    r ...`,l:"content/js.html#图像文件转换为base64",a:"图像文件转换为base64"},"2.32":{t:"FormData相关\r",p:`::: warning 注意
FormData中append上去的数据中，null和undefined会被转为字符串
:::
`,l:"content/js.html#formdata相关",a:"formdata相关"},"2.33":{t:"十六进制\r",p:`function randomColor() {
    const color = Math.floor(Math.random() * 1677216).toString(16) //生成ffff ...`,l:"content/js.html#十六进制",a:"十六进制"},"2.34":{t:"rgb\r",p:`function randomColor() {
    const [r, g, b] = [Math.floor(Math.random() * 256), Math.floor(Math.ran ...`,l:"content/js.html#rgb",a:"rgb"},"2.35":{t:"rgba\r",p:`function randomColor() {
    const [r, g, b, a] = [Math.floor(Math.random() * 256), Math.floor(Math. ...`,l:"content/js.html#rgba",a:"rgba"},"2.36":{t:"十六进制转rgb <hexToRGB />\r",p:`function hexToRGB(hex) {
    let rgb = []
    if (/^\\#[0-9A-F]{3}$/i.test(hex)) {
        let sixHex ...`,l:"content/js.html#十六进制转rgb-hextorgb",a:"十六进制转rgb-hextorgb"},"2.37":{t:"rgb转十六进制 <rgbToHex />\r",p:`function rgb2Hex(rgb) {
    if (/^rgb\\((\\d{1,3}\\,){2}\\d{1,3}\\)$/i.test(rgb)) {
        let hex = '#' ...`,l:"content/js.html#rgb转十六进制-rgbtohex",a:"rgb转十六进制-rgbtohex"},"2.38":{t:"随机生成中文\r",p:`createRandomChinese(count) {
    const start = parseInt('4e00', 16)
    const end = parseInt('9fa5', ...`,l:"content/js.html#随机生成中文",a:"随机生成中文"},"2.39":{t:"监听文件下载进度\r",p:`async function downloadFile(fileUrl, fileName = '未命名的文件') {
    const blob = await this.getBlob(file ...`,l:"content/js.html#监听文件下载进度",a:"监听文件下载进度"},"2.40":{t:"实现页面等比缩放适应所有屏幕\r",p:`function resize () {
    document.body.style.width = '1920px';
    document.body.style.height = '108 ...`,l:"content/js.html#实现页面等比缩放适应所有屏幕",a:"实现页面等比缩放适应所有屏幕"},"2.41":{t:"性能较好的拖拽方案\r",p:`
mousedown目标元素触发拖拽，并创建拖拽动画
body的mousemove拖拽动画跟随鼠标，改变margin值
body的mouseup结束拖拽，而目标也并不需要是拖拽的目标，可mouseup ...`,l:"content/js.html#性能较好的拖拽方案",a:"性能较好的拖拽方案"},"2.42":{t:"尾调用\r",p:`::: tip 尾调用
即函数在最后一步调用函数自身
【function f() { return f() }】
必须是调用自身
注意，只有不再用到外层函数的内部变量，内层函数的调用帧才会取代外层函数 ...`,l:"content/js.html#尾调用",a:"尾调用"},"2.43":{t:"优化尾递归\r",p:`1、蹦床函数
function trampoline(f) {
  while (f &amp;&amp; f instanceof Function) {
    f = f();
  }
  re ...`,l:"content/js.html#优化尾递归",a:"优化尾递归"},"2.44":{t:"toString(16)恢复 <hex2int />\r",p:`一：
function hex2int(hex) {
    const len = hex.length
    let a = new Array(len), code;
    for (let ...`,l:"content/js.html#tostring-16-恢复-hex2int",a:"tostring-16-恢复-hex2int"},"2.45":{t:"深度优先遍历（DFS）\r",p:`function dfs(node) {
    if (node.children) {
        for (let child of node.children) {
            ...`,l:"content/js.html#深度优先遍历-dfs",a:"深度优先遍历-dfs"},"2.46":{t:"广度优先遍历（BFS）\r",p:`function bfs(root) {
    const queue = [root];
    while (queue.length &gt; 0) {
        const node  ...`,l:"content/js.html#广度优先遍历-bfs",a:"广度优先遍历-bfs"},"3.0":{t:"# Typescript\r",p:"\r",l:"content/ts.html",a:"typescript"},"3.1":{t:"Typescript相较于JavaScript有什么优势和劣势？\r",p:`优势：

静态类型，可以在编写脚本时就检查出类型错误
由于严格的类型检查，使得重构比较安全，容易
提供更加安全的合作环境

劣势：

学习成本
需要编译
需要大量注释
相对js没有那么灵活

`,l:"content/ts.html#typescript相较于javascript有什么优势和劣势",a:"typescript相较于javascript有什么优势和劣势"},"3.2":{t:"const func = (a, b) => a + b; 要求编写Typescript，要求a，b参数类型一致，都为number或者都为string\r",p:`interface A {
	(a:number,b:number):number;
	(a:string,b:string):string;
}

`,l:"content/ts.html#const-func-a-b-a-b-要求编写typescript-要求a-b参数类型一致-都为number或者都为string",a:"const-func-a-b-a-b-要求编写typescript-要求a-b参数类型一致-都为number或者都为string"},"3.3":{t:"接口和类型别名的区别\r",p:`1、语法不同
——interface
interface Point {
    x: number;
    y: numbe;
}

interface SetPoint {
    (x: nu ...`,l:"content/ts.html#接口和类型别名的区别",a:"接口和类型别名的区别"},"3.4":{t:"泛型\r",p:`T：是一个抽象类型，只有在调用的时候才确定它的值
function identity&lt;T&gt;(arg: T): T {return arg}

其中 T 代表 Type，在定义泛型时通常用作 ...`,l:"content/ts.html#泛型",a:"泛型"},"3.5":{t:"泛型约束\r",p:`若参数的类型不是简单的类型，则需要对泛型进行约束，例如
function trace&lt;T&gt;(arg: T): T {
  console.log(arg.size); // Error:  ...`,l:"content/ts.html#泛型约束",a:"泛型约束"},"3.6":{t:"泛型工具类型\r",p:`1、typeof
typeof 的主要用途是在类型上下文中获取变量或者属性的类型
interface Person {
  name: string;
  age: number;
}
const s ...`,l:"content/ts.html#泛型工具类型",a:"泛型工具类型"},"3.7":{t:"索引类型\r",p:`function getValues&lt;T, K extends keyof T&gt;(person: T, keys: K[]): T[K][] {
  return keys.map(key ...`,l:"content/ts.html#索引类型",a:"索引类型"},"3.8":{t:"类型映射\r",p:`::: tip 概念
根据旧的类型创建出新的类型, 我们称之为映射类型
:::
interface TestInterface {
    name:string,
    age:number
}
 ...`,l:"content/ts.html#类型映射",a:"类型映射"},"3.9":{t:"Partial\r",p:`::: tip 概念
Partial&lt;T&gt; 将类型的属性变成可选
:::
type Partial&lt;T&gt; = {
  [P in keyof T]?: T[P];
};

局限 ...`,l:"content/ts.html#partial",a:"partial"},"3.10":{t:"Required\r",p:`Required将类型的属性变成必选
type Required&lt;T&gt; = { 
    [P in keyof T]-?: T[P] 
};

其中 -? 是代表移除 ? 这个 modi ...`,l:"content/ts.html#required",a:"required"},"3.11":{t:"Readonly\r",p:`type Readonly&lt;T&gt; = {
    readonly [p in keyof T]: T[p];
}

`,l:"content/ts.html#readonly",a:"readonly"},"3.12":{t:"Pick\r",p:`Pick 从某个类型中挑出一些属性出来
type Pick&lt;T, K extends keyof T&gt; = {
    [P in K]: T[P];
};

`,l:"content/ts.html#pick",a:"pick"},"3.13":{t:"Record\r",p:`Record&lt;K extends keyof any, T&gt; 的作用是将 K 中所有的属性的值转化为 T 类型。
type Record&lt;K extends keyof any, T ...`,l:"content/ts.html#record",a:"record"},"3.14":{t:"ReturnType\r",p:`用来得到一个函数的返回值类型
type ReturnType&lt;T extends (...args: any[]) =&gt; any&gt; = T extends (
  ...args:  ...`,l:"content/ts.html#returntype",a:"returntype"},"3.15":{t:"Exclude\r",p:`Exclude&lt;T, U&gt; 的作用是将某个类型中属于另一个的类型移除掉。
type Exclude&lt;T, U&gt; = T extends U ? never : T;

`,l:"content/ts.html#exclude",a:"exclude"},"3.16":{t:"Extract\r",p:`Extract&lt;T, U&gt; 的作用是从 T 中提取出 U。
type Extract&lt;T, U&gt; = T extends U ? T : never;

`,l:"content/ts.html#extract",a:"extract"},"3.17":{t:"Omit\r",p:`Omit&lt;T, K extends keyof any&gt; 的作用是使用 T 类型中除了 K 类型的所有属性，来构造一个新的类型
type Omit&lt;T, K extends keyo ...`,l:"content/ts.html#omit",a:"omit"},"3.18":{t:"NonNullable\r",p:`NonNullable&lt;T&gt; 的作用是用来过滤类型中的 null 及 undefined 类型。
type NonNullable&lt;T&gt; = T extendsnull | u ...`,l:"content/ts.html#nonnullable",a:"nonnullable"},"3.19":{t:"Parameters\r",p:`Parameters&lt;T&gt; 的作用是用于获得函数的参数类型组成的元组类型。
type Parameters&lt;T extends (...args: any) =&gt; any&gt ...`,l:"content/ts.html#parameters",a:"parameters"},"3.20":{t:"tsconfig.json\r",p:`重要字段：

files - 设置要编译的文件的名称；
include - 设置需要进行编译的文件，支持路径模式匹配；
exclude - 设置无需进行编译的文件，支持路径模式匹配；
compiler ...`,l:"content/ts.html#tsconfig-json",a:"tsconfig-json"},"4.0":{t:"# 其他\r",p:"\r",l:"content/其他.html",a:"其他"},"4.1":{t:"解决vsCode终端不能运行yarn脚本\r",p:`

vsCode的终端执行  get-ExecutionPolicy ，显示‘Restricted’ -- 受限


执行   set-ExecutionPolicy RemoteSigned  来取 ...`,l:"content/其他.html#解决vscode终端不能运行yarn脚本",a:"解决vscode终端不能运行yarn脚本"},"4.2":{t:"删除node_modules\r",p:`
进入文件夹
rimraf node_modules

`,l:"content/其他.html#删除node-modules",a:"删除node-modules"},"4.3":{t:"命令行打包\r",p:`e:
cd E:\\HBuilderX
cli publish --platform APP --type appResource --project mes-pda
xcopy F:\\mes-pda\\ ...`,l:"content/其他.html#命令行打包",a:"命令行打包"},"4.4":{t:"patch-package使用\r",p:`::: tip 使用
1、安装npm i patch-package / yarn add patch-package
2、package.json的script中增加&quot;postinstal ...`,l:"content/其他.html#patch-package使用",a:"patch-package使用"},"4.5":{t:"修改服务器配置地址不重启项目的方法\r",p:`在项目根目录创建env.js
module.exports = {
    url: 'http://xxxxxx' // DEV,测试
}

在vue.config.js的代理中
'/xxx': { ...`,l:"content/其他.html#修改服务器配置地址不重启项目的方法",a:"修改服务器配置地址不重启项目的方法"},"4.6":{t:"electron依赖安装缓慢\r",p:`
npm

npm config set ELECTRON_MIRROR https://npm.taobao.org/mirrors/electron/


yarn

yarn config se ...`,l:"content/其他.html#electron依赖安装缓慢",a:"electron依赖安装缓慢"},"4.7":{t:"electron由于地址证书问题导致打开白屏\r",p:`app.commandLine.appendSwitch('--ignore-certificate-errors', 'true');

`,l:"content/其他.html#electron由于地址证书问题导致打开白屏",a:"electron由于地址证书问题导致打开白屏"},"4.8":{t:"electron-forge存在的打包问题\r",p:`

Id is required


&quot;makers&quot;: [
        {
          &quot;name&quot;: &quot;@electron-forge ...`,l:"content/其他.html#electron-forge存在的打包问题",a:"electron-forge存在的打包问题"},"4.9":{t:"electron-packager\r",p:`
打包直接生成绿色包，无需安装
无法打包成安装包

&quot;package&quot;: &quot;electron-packager ./ test --out ./OutApp --1.0. ...`,l:"content/其他.html#electron-packager",a:"electron-packager"},"4.10":{t:"electron-builder\r",p:`
优点

可打包成安装包
无缓存
有免安装
快速


缺点

会将项目下的所有内容都打包，尽可能保持项目的干净，以保持安装包体积



{
  &quot;name&quot;: &quot;my-e ...`,l:"content/其他.html#electron-builder",a:"electron-builder"},"4.11":{t:"打包文件去除缓存\r",p:`const timeStamp = new Date().getTime()  
configureWebpack: {
    output: {
      filename: \`static/j ...`,l:"content/其他.html#打包文件去除缓存",a:"打包文件去除缓存"},"4.12":{t:"electron-update\r",p:`electron自动更新


在根目录新建updater.js
const { autoUpdater } = require('electron-updater');
var mainWin = n ...`,l:"content/其他.html#electron-update",a:"electron-update"},"4.13":{t:"关于接口延迟的测试方法\r",p:"\r",l:"content/其他.html#关于接口延迟的测试方法",a:"关于接口延迟的测试方法"},"4.14":{t:"如果出现一个接口超时\r",p:"\r",l:"content/其他.html#如果出现一个接口超时",a:"如果出现一个接口超时"},"4.15":{t:"网络问题：\r",p:`如果仅仅只是网络延迟，所有接口都应该超时
`,l:"content/其他.html#网络问题",a:"网络问题"},"4.16":{t:"接口串行问题：\r",p:`该接口在后台等待了别的接口处理，这种情况的判断的方法：去接口拦截器把超时时间设置1到2分钟，看看实际请求时间，然后单独发这个请求，看看这个时间差
`,l:"content/其他.html#接口串行问题",a:"接口串行问题"},"4.17":{t:"发现这个问题的场景\r",p:`在写路由鉴权时，没有把用户权限都请求回来，是不能放行的
router.beforeEach((to, from, next) =&gt; {
  NProgress.start()
  if (get ...`,l:"content/其他.html#发现这个问题的场景",a:"发现这个问题的场景"},"4.18":{t:"打包出zip\r",p:`const ZipPlugin = require('zip-webpack-plugin')

const path = require('path')

...

  configureWebpa ...`,l:"content/其他.html#打包出zip",a:"打包出zip"},"4.19":{t:"关于压缩的问题\r",p:`

NODE_ENV不是production的话很多node_modules里的包不会压缩


使用gzip
gzip on;
gzip_vary on;
gzip_proxied any;
gzip ...`,l:"content/其他.html#关于压缩的问题",a:"关于压缩的问题"},"4.20":{t:"安装依赖的时候提示淘宝镜像证书过期的问题\r",p:`
切换好镜像
删除node_modules
删除package-lock.json
运行npm cache clean --force / yarn cache clean --force
运行npm ...`,l:"content/其他.html#安装依赖的时候提示淘宝镜像证书过期的问题",a:"安装依赖的时候提示淘宝镜像证书过期的问题"},"4.21":{t:"vscode图片预览\r",p:`

安装Image preview


打开settings.json


增加配置
&quot;gutterpreview.paths&quot;: {
  &quot;@&quot;: &quot ...`,l:"content/其他.html#vscode图片预览",a:"vscode图片预览"},"5.0":{t:"# 小程序\r",p:"\r",l:"content/小程序.html",a:"小程序"},"5.1":{t:"小程序架构\r",p:`双线程模型：

渲染层：webview(多线程)
逻辑层：jscore

视图层和逻辑层通过系统层的weixinjsbridge通信
`,l:"content/小程序.html#小程序架构",a:"小程序架构"},"5.2":{t:"小程序和H5的区别\r",p:`


项
H5
小程序




运行环境
浏览器
特定的移动软件平台


运行机制
网页
可以热启动


系统权限
×
√


开发语言
html、css、js
wxml、wxss、js


开发成本 ...`,l:"content/小程序.html#小程序和h5的区别",a:"小程序和h5的区别"},"5.3":{t:"小程序在安卓和ios区别\r",p:`


项
安卓
ios




js运行环境
v8
jscore


视图层渲染
基于mobile chromium的xweb
wkwebview


样式




语法区别





`,l:"content/小程序.html#小程序在安卓和ios区别",a:"小程序在安卓和ios区别"},"5.4":{t:"为什么要用Taro？Taro是如何实现跨端的？\r",p:`现如今市面上端的形态多种多样，当业务要求各终端都要实现，开发成本就很高，这时候只需要编写一套代码就能够适配多端的能力就显得极为需要
编译实现跨端
`,l:"content/小程序.html#为什么要用taro-taro是如何实现跨端的",a:"为什么要用taro-taro是如何实现跨端的"},"6.0":{t:"# 框架相关\r",p:"\r",l:"content/框架.html",a:"框架相关"},"6.1":{t:"React-router、vue-router原理\r",p:`


项
hash模式
history模式




标记
带有#
无#


原理
改变hash值不会触发浏览器请求，并且会触发hashchange事件，最低支持ie8
会触发浏览器请求，如果资源不存在 ...`,l:"content/框架.html#react-router、vue-router原理",a:"react-router、vue-router原理"},"6.2":{t:"vue和 react 的区别\r",p:`


项
vue
react




问世
14年2月
13年5月


数据绑定
vue是实现了双向数据绑定的mvvm框架，当视图改变更新模型层，当模型层改变更新视图层。在vue中，使用了双向绑定技术 ...`,l:"content/框架.html#vue和-react-的区别",a:"vue和-react-的区别"},"6.3":{t:"vue和 react 如何做技术选型\r",p:`


项
vue
react




适合
webapp，适合做用户交互多、各种动态效果变化丰富的应用。特别是PC、手机的网页版 商城等页面
oa，适合 大批量的数据展示、适合做大型应用。特别适合公司 ...`,l:"content/框架.html#vue和-react-如何做技术选型",a:"vue和-react-如何做技术选型"},"6.4":{t:"css module原理\r",p:`通过编译生成独一无二的类名
`,l:"content/框架.html#css-module原理",a:"css-module原理"},"6.5":{t:"说一下虚拟DOM?为什么要使用虚拟DOM?\r",p:`

用js对象表示dom的树结构，用于构建真实dom，用新的dom树和旧的dom树对比，记录树的差异，将差异应用到真正dom树上


减少dom操作，扩展性强


`,l:"content/框架.html#说一下虚拟dom-为什么要使用虚拟dom",a:"说一下虚拟dom-为什么要使用虚拟dom"},"6.6":{t:"虚拟DOM是如何合并patch的\r",p:`防抖
`,l:"content/框架.html#虚拟dom是如何合并patch的",a:"虚拟dom是如何合并patch的"},"6.7":{t:"map 和 v-for 中 key 的作用\r",p:`用于diff算法中辨识VNodes
`,l:"content/框架.html#map-和-v-for-中-key-的作用",a:"map-和-v-for-中-key-的作用"},"6.8":{t:"组件通信的方式有哪些\r",p:`


项
父子通讯
兄弟通讯
跨级通讯
用法




props/$emit
√


props：父组件绑定属性，子组件props属性接收&lt;br /&gt;$emits：父组件定义方法，子组件$ ...`,l:"content/框架.html#组件通信的方式有哪些",a:"组件通信的方式有哪些"},"6.9":{t:"watch能监听computed的属性吗\r",p:`能，但是只能监听data中存在的属性，conputed可以定义data中不存在的属性
`,l:"content/框架.html#watch能监听computed的属性吗",a:"watch能监听computed的属性吗"},"6.10":{t:"vue的响应式原理\r",p:`Object.defineProperty()

`,l:"content/框架.html#vue的响应式原理",a:"vue的响应式原理"},"6.11":{t:"mounted拿到数据可以后可以直接获取dom吗\r",p:`
this.$nextTick
定时器

`,l:"content/框架.html#mounted拿到数据可以后可以直接获取dom吗",a:"mounted拿到数据可以后可以直接获取dom吗"},"6.12":{t:"nextTick原理\r",p:`置于任务队列的最后
`,l:"content/框架.html#nexttick原理",a:"nexttick原理"},"6.13":{t:"vue模板(template)里为什么不能使用多个头结点\r",p:`
虚拟dom比较算法依赖于单根节点的组件
带有render函数的函数式组件

`,l:"content/框架.html#vue模板-template-里为什么不能使用多个头结点",a:"vue模板-template-里为什么不能使用多个头结点"},"6.14":{t:"vuex为什么同时设计mutation和action?只设计一个行不行?\r",p:`
为了能用devtools追踪状态变化
mutation是同步的，同步的意义在于每一个mutation执行完后都可以对应到一个新的状态

`,l:"content/框架.html#vuex为什么同时设计mutation和action-只设计一个行不行",a:"vuex为什么同时设计mutation和action-只设计一个行不行"},"6.15":{t:"vue2和 vue3 在数据绑定这一块有什么区别?\r",p:`vue2运用Object.defineProperty()
vue3运用es6的Proxy

Object.defineProperty一次性只能给对象的一个属性添加get/set方法，而proxy可 ...`,l:"content/框架.html#vue2和-vue3-在数据绑定这一块有什么区别",a:"vue2和-vue3-在数据绑定这一块有什么区别"},"6.16":{t:"vue挂载和卸载父子组件生命周期钩子执行顺序\r",p:`


项
过程




渲染过程
父beforeCreate-&gt;父created-&gt;父beforeMount-&gt;子beforeCreate-&gt;子created-&gt;子bef ...`,l:"content/框架.html#vue挂载和卸载父子组件生命周期钩子执行顺序",a:"vue挂载和卸载父子组件生命周期钩子执行顺序"},"6.17":{t:"vue的优化方案（等同于如何编写可读性高、易维护且高性能的vue代码）\r",p:`

v-if、v-show


v-if为真正的条件渲染，确保切换过程中条件块内的事件监听器和子组件适当的被销毁和重建；也是惰性的：如果初始渲染时条件为假，则什么也不做直至条件变为真时，才开始渲染

 ...`,l:"content/框架.html#vue的优化方案-等同于如何编写可读性高、易维护且高性能的vue代码",a:"vue的优化方案-等同于如何编写可读性高、易维护且高性能的vue代码"},"6.18":{t:"keep-alive的原理,使用有什么问题?如何解决?\r",p:`抽象组件，本身不会渲染一个dom元素，也不会出现在父组件链中，使用keep-alive包裹动态组件时，会缓存不活动的组件实例

include：定义缓存白名单
exclude：定义缓存黑名单
max： ...`,l:"content/框架.html#keep-alive的原理-使用有什么问题-如何解决",a:"keep-alive的原理-使用有什么问题-如何解决"},"6.19":{t:"setState是同步还是异步的\r",p:`
进入了react的调度流程就是异步，没有进入就是同步
什么东西不会进入react的调度流程，setTimeout、setInterval，绑定原生事件

`,l:"content/框架.html#setstate是同步还是异步的",a:"setstate是同步还是异步的"},"6.20":{t:"fiber的实现原理\r",p:"window.requestIdIeCallback()：会在浏览器空闲时期一次调用函数，可以让开发者在主事件循环中执行后台或低优先级的任务，而且不会对像动画和用户交互这些延迟触发但关键的事件产生影响 ...",l:"content/框架.html#fiber的实现原理",a:"fiber的实现原理"},"6.21":{t:"为什么webpack打包慢？为什么vite会比webpack快？如果想提高webpack速度，应该怎么做？\r",p:`主要在编译js和css的loader以及对这两类代码压缩的plugin上
原因是编译和压缩的过程中，都需要将代码转化为AST(语法分析树)，接着需要遍历树转化回代码
提高编译速度：


缓存


多线 ...`,l:"content/框架.html#为什么webpack打包慢-为什么vite会比webpack快-如果想提高webpack速度-应该怎么做",a:"为什么webpack打包慢-为什么vite会比webpack快-如果想提高webpack速度-应该怎么做"},"6.22":{t:"说说webpack编译打包的流程\r",p:`
读取命令行传入的配置以及项目中的webpack.config.js文件，初始化本次构建的配置参数，并且执行配置文件中的插件实例化语句，生成Compiler传入plugin的apply方法，为webp ...`,l:"content/框架.html#说说webpack编译打包的流程",a:"说说webpack编译打包的流程"},"6.23":{t:"说一下对tree-shaking的了解,对CommonJS和ESM都可以用tree-shaking吗\r",p:`通过工具消除无用的js代码
uglify不能跨文件做dce
::: tip dce的特征：

代码不会被执行、永不到达
代码执行的结果不会被用到
代码只会影响死变量(只写不读)

:::
`,l:"content/框架.html#说一下对tree-shaking的了解-对commonjs和esm都可以用tree-shaking吗",a:"说一下对tree-shaking的了解-对commonjs和esm都可以用tree-shaking吗"},"6.24":{t:"webpack中plugin和laoder的区别，它们的执行时机，以及常用的plugin和loader\r",p:`


项
loader
plugin




作用
文件加载器、处理文件
事件监听器


运行
一个文件可以使用多个loader&lt;br /&gt;执行顺序和配置中的顺序相反&lt;br /&gt ...`,l:"content/框架.html#webpack中plugin和laoder的区别-它们的执行时机-以及常用的plugin和loader",a:"webpack中plugin和laoder的区别-它们的执行时机-以及常用的plugin和loader"},"6.25":{t:"css-loader的作用是什么?不使用css-loader行不行\r",p:`
配合webpack打包css文件
css组件化
可以使用css-module避免命名空间混乱
允许css文件通过require的方式引入，并返回css代码

`,l:"content/框架.html#css-loader的作用是什么-不使用css-loader行不行",a:"css-loader的作用是什么-不使用css-loader行不行"},"6.26":{t:"动态路由找不到模块\r",p:`::: warning import() 中的表达式
不能使用完全动态的 import 语句，例如 import(foo)。是因为 foo 可能是系统或项目中任何文件的任何路径。
import() 必 ...`,l:"content/框架.html#动态路由找不到模块",a:"动态路由找不到模块"},"6.27":{t:"**错误：Critical dependency: the request of a dependency is an expression**\r",p:`webpack版本不支持import动态引入导致的报错，可以改用require
`,l:"content/框架.html#错误-critical-dependency-the-request-of-a-dependency-is-an-expression",a:"错误-critical-dependency-the-request-of-a-dependency-is-an-expression"},"6.28":{t:"事件总线需要注意的问题\r",p:`
mountred开启监听(原因参考&lt;navigator :target=&quot;{ name: '生命周期', url: '/content/框架.html#vue挂载和卸载父子组件生命周 ...`,l:"content/框架.html#事件总线需要注意的问题",a:"事件总线需要注意的问题"},"6.29":{t:"a-input只读属性无效\r",p:`readOnly

`,l:"content/框架.html#a-input只读属性无效",a:"a-input只读属性无效"},"6.30":{t:"页面存在多个表单冲突的解决方案\r",p:`原理：创建多个表单时，vue只会实例一个表单，不仅表单本身会冲突，表单下的item如果属性相同也会冲突

合并为一个表单，为每个表单的item绑定独立的属性值
讲表单抽象封装，引入创建的方式，让其创建 ...`,l:"content/框架.html#页面存在多个表单冲突的解决方案",a:"页面存在多个表单冲突的解决方案"},"6.31":{t:"修改keepAlive的缓存策略\r",p:`/**
 * base-keep-alive 主要解决问题场景：多级路由缓存
 * 前提：保证动态路由生成的route fullPath 值都声明了且唯一
 * 基于以上对keep-alive进行以下 ...`,l:"content/框架.html#修改keepalive的缓存策略",a:"修改keepalive的缓存策略"},"6.32":{t:"避免input读取历史记录\r",p:`autoComplete=&quot;off&quot;

`,l:"content/框架.html#避免input读取历史记录",a:"避免input读取历史记录"},"6.33":{t:"textarea输入不自动撑开的原因之一\r",p:`使用了栅格，
如ant中的a-row 的:gutter属性
`,l:"content/框架.html#textarea输入不自动撑开的原因之一",a:"textarea输入不自动撑开的原因之一"},"6.34":{t:"a-table增加列拖拽排序、列拖拽调整列宽\r",p:`import T from 'ant-design-vue/es/table/Table'
import get from 'lodash.get'

export default {
  data  ...`,l:"content/框架.html#a-table增加列拖拽排序、列拖拽调整列宽",a:"a-table增加列拖拽排序、列拖拽调整列宽"},"6.35":{t:"ant 展开列后 固定列错位问题\r",p:`@expand=&quot;expand&quot;

expand(expanded, record) {
    this.$nextTick(() =&gt; {
        const e ...`,l:"content/框架.html#ant-展开列后-固定列错位问题",a:"ant-展开列后-固定列错位问题"},"6.36":{t:"ant固定列高度问题\r",p:`const autoFixHeight = (el, binding, vnode, oldVnode) =&gt; {
  setTimeout(() =&gt; {
    const resul ...`,l:"content/框架.html#ant固定列高度问题",a:"ant固定列高度问题"},"6.37":{t:"a-table中fixed与ellipsis无法共存的问题\r",p:`// 全局样式加入
.ant-table-fixed-left table, .ant-table-fixed-right table{
  width: min-content;
}

`,l:"content/框架.html#a-table中fixed与ellipsis无法共存的问题",a:"a-table中fixed与ellipsis无法共存的问题"},"6.38":{t:"a-select搜索问题\r",p:`option-filter-prop=&quot;children&quot;

`,l:"content/框架.html#a-select搜索问题",a:"a-select搜索问题"},"6.39":{t:"a-modal内嵌a-modal引发的问题(按钮增加key可解决)\r",p:`&lt;template&gt;
  &lt;div&gt;
    &lt;button @click=&quot;visible = true&quot;&gt;测试&lt;/button&gt; ...`,l:"content/框架.html#a-modal内嵌a-modal引发的问题-按钮增加key可解决",a:"a-modal内嵌a-modal引发的问题-按钮增加key可解决"},"6.40":{t:"a-modal拖拽\r",p:`const drag = (el, binding, vnode, oldVnode) =&gt; {
  Vue.nextTick(() =&gt; {
    const isThemeModal ...`,l:"content/框架.html#a-modal拖拽",a:"a-modal拖拽"},"6.41":{t:"表格调整高度\r",p:`const adjustTableScrollXY = (el, binding, vnode, oldVnode) =&gt; {
  Vue.nextTick(() =&gt; {
    con ...`,l:"content/框架.html#表格调整高度",a:"表格调整高度"},"6.42":{t:"关于jsx修改框架样式(jsx deep)\r",p:`一般做法：
module.exports = {
  css: {
    requireModuleExtension: true
  }
}

import styles from './test ...`,l:"content/框架.html#关于jsx修改框架样式-jsx-deep",a:"关于jsx修改框架样式-jsx-deep"},"6.43":{t:"立体柱状图\r",p:`const colorArr = [
   [
      { offset: 0, color: 'rgb(91, 255, 255)', },
      { offset: 0.5, color ...`,l:"content/框架.html#立体柱状图",a:"立体柱状图"},"6.44":{t:"关于el-image失败时更换请求地址的操作\r",p:`::: tip 提示
由于官方文档稀烂得来
:::
el-image的error函数接收两个参数，第一个为请求出错的路径，第二个为当前请求的数据体本体
BMapGL
`,l:"content/框架.html#关于el-image失败时更换请求地址的操作",a:"关于el-image失败时更换请求地址的操作"},"6.45":{t:"关于可视化mapgl\r",p:`能不使用它最好不要使用

性能差，尤其需要注意不能频繁创建，因为它并不会帮你查重，会一直创建新画布
文档差
技术落后，它有的标注，在原生的BMapGL都有，而且更灵活

`,l:"content/框架.html#关于可视化mapgl",a:"关于可视化mapgl"},"6.46":{t:"关于BMapGL的图标标记出现异常图标的问题\r",p:`这里建立图标的时候需要设立图标的宽高，必须为图标本身的宽高，或者小于图片的宽高
`,l:"content/框架.html#关于bmapgl的图标标记出现异常图标的问题",a:"关于bmapgl的图标标记出现异常图标的问题"},"6.47":{t:"关于BMapGL的地图瓦片问题\r",p:`经过测试基本上是失败，图片转化问题存在太多的误差以及偏移，这多亏了百度**独树一帜(傻逼)**的坐标定义
cesium
`,l:"content/框架.html#关于bmapgl的地图瓦片问题",a:"关于bmapgl的地图瓦片问题"},"6.48":{t:"关于性能问题\r",p:`经过测试基本上和显卡挂钩，不用想着去优化了
如果实在想优化，可以采取缩小地图宽高的方式，有肉眼可见的性能提升
`,l:"content/框架.html#关于性能问题",a:"关于性能问题"},"7.0":{t:"# 浏览器&网络\r",p:"\r",l:"content/浏览器相关.html",a:"浏览器-网络"},"7.1":{t:"介绍一下EventLoop\r",p:`
所有同步任务在主线程执行，形成一个执行栈
主线程外存在一个任务队列，异步任务有了结果，就在任务队列中放置一个事件
执行栈中的任务执行完成后，系统会读取任务队列中的事件，根据事件读取对应的异步任务，将 ...`,l:"content/浏览器相关.html#介绍一下eventloop",a:"介绍一下eventloop"},"7.2":{t:"EventLoop中为什么要同时存在宏任务和微任务两个队列？设计一个行不行？一段代码在执行时，程序是如何去区分宏任务和微任务的？\r",p:`
为了保证任务有优先级
确保非阻塞

`,l:"content/浏览器相关.html#eventloop中为什么要同时存在宏任务和微任务两个队列-设计一个行不行-一段代码在执行时-程序是如何去区分宏任务和微任务的",a:"eventloop中为什么要同时存在宏任务和微任务两个队列-设计一个行不行-一段代码在执行时-程序是如何去区分宏任务和微任务的"},"7.3":{t:"script标签为什么要放在底部\r",p:`避免脚本阻塞
`,l:"content/浏览器相关.html#script标签为什么要放在底部",a:"script标签为什么要放在底部"},"7.4":{t:"defer和async的区别，以及它们的加载和执行时机\r",p:`


项
共同点
不同




defer
并行下载js、异步
下载完毕后立即执行，不会按照页面上的script顺序执行


async
并行下载js、异步
页面解析完毕后会按照script标签的顺序 ...`,l:"content/浏览器相关.html#defer和async的区别-以及它们的加载和执行时机",a:"defer和async的区别-以及它们的加载和执行时机"},"7.5":{t:"如何设计css、js等文件的缓存\r",p:`
增加版本号
增加修改时间戳

`,l:"content/浏览器相关.html#如何设计css、js等文件的缓存",a:"如何设计css、js等文件的缓存"},"7.6":{t:"内存泄漏\r",p:`定义：由于疏忽或程序错误造成的未能释放已经不再使用的内存
引起内存泄漏的场景：

闭包使用不当引起内存泄漏
全局变量
分离的DOM节点
控制台的打印
遗忘的定时器

`,l:"content/浏览器相关.html#内存泄漏",a:"内存泄漏"},"7.7":{t:"setTimeout为什么会造成内存泄露？如何防止setTimeout内存泄露？清除定时器为什么就不会有内存泄露？\r",p:`

第一个参数为字符串


递归


递归清除定时器
`,l:"content/浏览器相关.html#settimeout为什么会造成内存泄露-如何防止settimeout内存泄露-清除定时器为什么就不会有内存泄露",a:"settimeout为什么会造成内存泄露-如何防止settimeout内存泄露-清除定时器为什么就不会有内存泄露"},"7.8":{t:"介绍一下http缓存\r",p:`为了提升页面的访问速度，把能缓存的页面或数据缓存到能够更快取到的地方
`,l:"content/浏览器相关.html#介绍一下http缓存",a:"介绍一下http缓存"},"7.9":{t:"哪些字段用做强缓存?哪些字段用做协商缓存?\r",p:`


项
强缓存
协商缓存




定义
本地缓存，只浏览器不发出请求，直接从缓存中获取
当校验发现不能使用强缓存


expires(http1.0，值为一个绝对时间的标准GMT格式的时间字符串)
 ...`,l:"content/浏览器相关.html#哪些字段用做强缓存-哪些字段用做协商缓存",a:"哪些字段用做强缓存-哪些字段用做协商缓存"},"7.10":{t:"用户行为对缓存的影响\r",p:`


用户操作
Expires/Cache-Control
Last-Modify/ETag




地址栏回车
√
√


页面链接跳转
√
√


新开窗口
√
√


前进后退
√
√


F5 ...`,l:"content/浏览器相关.html#用户行为对缓存的影响",a:"用户行为对缓存的影响"},"7.11":{t:"宏任务和微任务的区别\r",p:`
进程的切换肯定是宏任务
线程的切换是微任务

`,l:"content/浏览器相关.html#宏任务和微任务的区别",a:"宏任务和微任务的区别"},"7.12":{t:"为什么和定时器有关的任务是宏任务\r",p:`因为计时是实时的，它一定不能被阻塞，所以定时器被设计在另一个进程中被管理，所以，定时器任务会有进程的切换，所以只能是宏任务
`,l:"content/浏览器相关.html#为什么和定时器有关的任务是宏任务",a:"为什么和定时器有关的任务是宏任务"},"7.13":{t:"事件为什么是宏任务呢\r",p:"事件的触发是依赖于浏览器的实现，平台有它自己的事件注册和派发机制，比如nodeJS用的内核libuv，所以不管怎样，事件的独立注册表和派发机制导致，他也不会和JS存在一个进程中，事件的管理中心一定是在 ...",l:"content/浏览器相关.html#事件为什么是宏任务呢",a:"事件为什么是宏任务呢"},"7.14":{t:"JS本身语法内的\r",p:`
比如async/await,它本身是一个迭代器，迭代器利用了纤程，在不同的纤程之间切换，所以是微任务
进程和纤（线）程最大的区别是：进程占用单独的资源，即不会共享CPU和内存，而线程往下，都是共享C ...`,l:"content/浏览器相关.html#js本身语法内的",a:"js本身语法内的"},"7.15":{t:"非JS本身的\r",p:`非JS本身的，因为往往被设计成不被JS阻塞的，所以会单独开启一个进程作管理，这样出来的都是宏任务
`,l:"content/浏览器相关.html#非js本身的",a:"非js本身的"},"7.16":{t:"那么像Observer(如MutationObserver等)，和一些渲染为什么都是微任务呢？\r",p:`
虽然它们和JS的本身无关，但是它们的执行时机和它们所在的进程是有关的
比如MutationObserver，观察的是DOM,它的作用即是对DOM的变化做出响应，所以，他会在管理DOM的进程中
渲染也 ...`,l:"content/浏览器相关.html#那么像observer-如mutationobserver等-和一些渲染为什么都是微任务呢",a:"那么像observer-如mutationobserver等-和一些渲染为什么都是微任务呢"},"7.17":{t:"浏览器页面加载过程\r",p:`


浏览器进程进程
作用




浏览器进程
管理标签页的创建销毁以及页面的显示、资源下载


第三方插件进程
管理第三方插件


GPU进程
3D绘制与硬件加速(最多一个)


渲染进程
页面文档 ...`,l:"content/浏览器相关.html#浏览器页面加载过程",a:"浏览器页面加载过程"},"7.18":{t:"sessionSorage、localstorage、cookie的区别？同一个系统开两个网页，两个网页的sessionStorage共享吗？\r",p:`


项
cookie
localStorage
sessionStorage




大小
4K
5M
5M


生命周期
不设置有效期则会存放在内存中，会话结束自动删除&lt;br /&gt;设置 ...`,l:"content/浏览器相关.html#sessionsorage、localstorage、cookie的区别-同一个系统开两个网页-两个网页的sessionstorage共享吗",a:"sessionsorage、localstorage、cookie的区别-同一个系统开两个网页-两个网页的sessionstorage共享吗"},"7.19":{t:"浏览器线程\r",p:`浏览器的2个重要的执行线程，这 2 个线程协同工作来渲染一个网页：主线程和合成线程
::: tip 主线程

运行 JavaScript
计算 HTML 元素的 CSS 样式
页面的布局
将元素绘制到 ...`,l:"content/浏览器相关.html#浏览器线程",a:"浏览器线程"},"7.20":{t:"关于渲染时部分样式丢失的问题\r",p:`可用定时器让任务重复排进队列
`,l:"content/浏览器相关.html#关于渲染时部分样式丢失的问题",a:"关于渲染时部分样式丢失的问题"},"7.21":{t:"关于一个mousemove加条件判断的怪异卡顿问题\r",p:`&lt;mousemove /&gt;

鼠标在上方移动时，第一个区域会存在卡顿的问题，但如果打开开发者控制台，则卡顿问题会消失
目前不知道如何解释这种情况，个人理解是否是因为第一个的if条件相当于个 ...`,l:"content/浏览器相关.html#关于一个mousemove加条件判断的怪异卡顿问题",a:"关于一个mousemove加条件判断的怪异卡顿问题"},"8.0":{t:"# 算法\r",p:"\r",l:"content/算法.html",a:"算法"},"8.1":{t:"快排\r",p:`function quickSort(arr) {
	var len = arr.length
	if (len &lt; 1) return arr
 	var mid=Math.floor(arr ...`,l:"content/算法.html#快排",a:"快排"},"9.0":{t:"# 规范\r",p:`::: tip 个人总结的代码规范
代码规范很重要，能够帮你很舒服的阅读代码，代码工整很容易维护，不容易出bug，出bug也容易找
但是规范是规范，并不一定需要要求的特别死，可根据自身阅读习惯自由调整 ...`,l:"content/规范.html",a:"规范"},"9.1":{t:"缩进\r",p:`如果公司有自定义的规则，则无视
否则规定两个空格作为缩进
选中代码片段tab、或者shift+tab控制缩进
`,l:"content/规范.html#缩进",a:"缩进"},"9.2":{t:"js相关\r",p:"\r",l:"content/规范.html#js相关",a:"js相关"},"9.3":{t:"三元不等式\r",p:`aaa ? 1 : 2

在表达式较长时，推荐换行
xxlajsdlkjaklsd
  ? aslkdjasjdklasd(12308102938123)
  : lghldsfgjdfgdjklfg ...`,l:"content/规范.html#三元不等式",a:"三元不等式"},"9.4":{t:"匿名函数\r",p:`(function(){}())
(function(){})()

必须在开头加;
;(function(){}())
;(function(){})()

`,l:"content/规范.html#匿名函数",a:"匿名函数"},"9.5":{t:"关于变量的风格\r",p:`一般不超过编辑器的2/3的，均不推荐换行
const result = [
    'id',
    'name',
    'address',
    'old',
    'home',
]
 ...`,l:"content/规范.html#关于变量的风格",a:"关于变量的风格"},"9.6":{t:"if判断\r",p:`判断路径下的代码逻辑只有一句的情况下，可不用写{}
if (aaa) return 1

if (aaa) {
    return 1
}


if (aaa) return 1
else if ( ...`,l:"content/规范.html#if判断",a:"if判断"},"9.7":{t:"vue相关\r",p:"\r",l:"content/规范.html#vue相关",a:"vue相关"},"9.8":{t:"template\r",p:`
必须严格要求缩进
一个组件元素只要长度不超过编辑器的2/3，可以写在一行，一旦超过必须换行，而且闭合标签必须和开头标签保持相同的缩进

// 不推荐
&lt;a-input 
  v-model=& ...`,l:"content/规范.html#template",a:"template"},"9.9":{t:"import\r",p:`
没有用到的变量，必须手动删除，不要留在代码上
import的对象属性，超过5个需要换行，注意严格保持缩进

// 不推荐
import { GetList, ImportExcel, GetList ...`,l:"content/规范.html#import",a:"import"},"9.10":{t:"name\r",p:`必须为组件生命一个独立的name，此步骤不能缺，开头必须为大写字母
`,l:"content/规范.html#name",a:"name"},"9.11":{t:"components\r",p:`
必须换行
结尾元素必须加,

`,l:"content/规范.html#components",a:"components"},"9.12":{t:"props\r",p:`
在每一个属性不长时，推荐不换行，若其中有一项函数过长，则单独让它换行
最后一项必须加,

props: {
  visible: { type: Boolean, required: true }, ...`,l:"content/规范.html#props",a:"props"},"9.13":{t:"data\r",p:`
变量声明的数据格式必须和其后续复制的数据格式一致

`,l:"content/规范.html#data",a:"data"},"9.14":{t:"模板推荐的写法(常用)\r",p:`
created =&gt; mounted =&gt; method =&gt; computed =&gt; watch
watch不要在生命周期中声明，单独写watch监听
在1中，若没有代码处 ...`,l:"content/规范.html#模板推荐的写法-常用",a:"模板推荐的写法-常用"},"9.15":{t:"关于事件总线规范\r",p:`

可在created/mounted等生命周期里面监听，但是必须在beforeDestroy注销监听


事件名称统一使用字符串，全局搜索也比较方便，并且不存在事件出错的问题，如下
$bus.$em ...`,l:"content/规范.html#关于事件总线规范",a:"关于事件总线规范"},"9.16":{t:"代码规范(偷)\r",p:"\r",l:"content/规范.html#代码规范-偷",a:"代码规范-偷"},"9.17":{t:"背景\r",p:`
前端代码格式本身松散
公司项目代码格式不一致
手动格式代码太过繁琐、心智负担过重
当前项目为多人开发，若大家都突然使用格式化插件，提交代码时容易造成大量冲突，见【过渡阶段注意事项】

`,l:"content/规范.html#背景",a:"背景"},"9.18":{t:"阶段\r",p:`
初始阶段-初次添加Prettier插件
过渡阶段-项目中存在【已格式化】/【未格式化】两种代码文件
完成阶段-项目中所有代码文件格式统一
进阶阶段-添加husky hooks在代码提交端格式化-优先 ...`,l:"content/规范.html#阶段",a:"阶段"},"9.19":{t:"过渡阶段注意事项\r",p:`
过渡阶段只使用【快捷键】格式化代码
在格式化某个【从未格式化】过的代码文件前，先咨询组内成员该文件是否有人正在更新，若有成员正在编辑此文件，可等对方编辑完，合并代码后再进行格式化，若短时间该成员不能 ...`,l:"content/规范.html#过渡阶段注意事项",a:"过渡阶段注意事项"},"9.20":{t:"安装插件及其配置\r",p:`
安装prettier插件npm install --save-dev prettier@3.2.5
添加/.prettierrc.json配置文件，前端-常见的Prettier配置

{
  &qu ...`,l:"content/规范.html#安装插件及其配置",a:"安装插件及其配置"},"9.21":{t:"编辑器Webstorm配置\r",p:`
完成【安装插件及其配置】
进入【设置/setting】-&gt;【语言&amp;框架/Language&amp;Frameworks】-&gt;【JavaScript】-&gt;【Prettier】 ...`,l:"content/规范.html#编辑器webstorm配置",a:"编辑器webstorm配置"},"9.22":{t:"编辑器VSCode配置\r",p:`
完成【安装插件及其配置】
安装VSCode【Prettier】插件
进入设置页配置*setting.json*

{
    &quot;prettier.configPath&quot;: &qu ...`,l:"content/规范.html#编辑器vscode配置",a:"编辑器vscode配置"}},n={previewLength:100,buttonLabel:"搜索",placeholder:"情输入关键词",allow:[],ignore:[]},o={INDEX_DATA:t,PREVIEW_LOOKUP:e,Options:n};export{o as default};
